{
  "metadata": {
    "timestamp": 1736708119118,
    "page": 531,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjU0MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "eclipse-paho/paho.mqtt.android",
      "stars": 2958,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 1.2783203125,
          "content": "# [Android] ========================\n# Built application files\n*.apk\n*.ap_\n\n# Files for the Dalvik VM\n*.dex\n\n# Java class files\n*.class\n\n# Generated files\nbin/\ngen/\n\n# Gradle files\n.gradle/\nbuild\n\n# Cache of project\n.gradletasknamecache\n\n# Ignore Gradle GUI config\ngradle-app.setting\n\n\n# Local configuration file (sdk path, etc)\nlocal.properties\n\n# Proguard folder generated by Eclipse\nproguard/\n\n# Log Files\n*.log\n\n\n## Directory-based project format:\n.idea/\n*.iml\n\n## File-based project format:\n*.ipr\n*.iws\n\n## Plugin-specific files:\n\n# IntelliJ\nout/\n\n# mpeltonen/sbt-idea plugin\n.idea_modules/\n\n# JIRA plugin\natlassian-ide-plugin.xml\n\n# Crashlytics plugin (for Android Studio and IntelliJ)\ncom_crashlytics_export_strings.xml\n\n\n# [Maven] ========================\ntarget/\npom.xml.tag\npom.xml.releaseBackup\npom.xml.versionsBackup\npom.xml.next\nrelease.properties\n\n\n# [Gradle-Android] ========================\n# Ignore Gradle GUI config\ngradle-app.setting\n\n# Properties\ngradle.properties\n\n# Mobile Tools for Java (J2ME)\n.mtj.tmp/\n\n# Package Files #\n*.jar\n*.war\n*.ear\n!gradle-wrapper.jar\n\n# virtual machine crash logs, see http://www.java.com/en/download/help/error_hotspot.xml\nhs_err_pid*\n\n# Misc\n/.idea/workspace.xml\n/.idea/libraries\n.DS_Store\n/captures\n**/*.iml\n*.class\n\n\norg.eclipse.paho.android.sample/libs/\n"
        },
        {
          "name": ".travis.yml",
          "type": "blob",
          "size": 0.5732421875,
          "content": "language: android\njdk: oraclejdk8\nandroid:\n  components:\n    - tools\n    - build-tools-23.0.3\n    - android-24\n    - extra-android-support\n    - extra\n\n#before_script:\n#  - echo no | android create avd --force -n test -t android-19 --abi armeabi-v7a\n#  - emulator -avd test -no-audio -no-window &\n#  - android-wait-for-emulator\n#  - adb shell input keyevent 82 &\n\nscript:\n  - ./gradlew clean\n  - ./gradlew org.eclipse.paho.android.sample:assemble paho.mqtt.android.example:assemble\n#  - ./gradlew org.eclipse.paho.android.service:assemble org.eclipse.paho.android.service:connectedCheck\n"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 9.576171875,
          "content": "# Community Code of Conduct\n\n**Version 2.0  \nJanuary 1, 2023**\n\n## Our Pledge\n\nIn the interest of fostering an open and welcoming environment, we as community members, contributors, Committers[^1], and Project Leads (collectively \"Contributors\") pledge to make participation in our projects and our community a harassment-free and inclusive experience for everyone.\n\nThis Community Code of Conduct (\"Code\") outlines our behavior expectations as members of our community in all Eclipse Foundation activities, both offline and online. It is not intended to govern scenarios or behaviors outside of the scope of Eclipse Foundation activities. Nor is it intended to replace or supersede the protections offered to all our community members under the law. Please follow both the spirit and letter of this Code and encourage other Contributors to follow these principles into our work. Failure to read or acknowledge this Code does not excuse a Contributor from compliance with the Code.\n\n## Our Standards\n\nExamples of behavior that contribute to creating a positive and professional environment include:\n\n- Using welcoming and inclusive language;\n- Actively encouraging all voices;\n- Helping others bring their perspectives and listening actively. If you find yourself dominating a discussion, it is especially important to encourage other voices to join in;\n- Being respectful of differing viewpoints and experiences;\n- Gracefully accepting constructive criticism;\n- Focusing on what is best for the community;\n- Showing empathy towards other community members;\n- Being direct but professional; and\n- Leading by example by holding yourself and others accountable\n\nExamples of unacceptable behavior by Contributors include:\n\n- The use of sexualized language or imagery;\n- Unwelcome sexual attention or advances;\n- Trolling, insulting/derogatory comments, and personal or political attacks;\n- Public or private harassment, repeated harassment;\n- Publishing others' private information, such as a physical or electronic address, without explicit permission;\n- Violent threats or language directed against another person;\n- Sexist, racist, or otherwise discriminatory jokes and language;\n- Posting sexually explicit or violent material;\n- Sharing private content, such as emails sent privately or non-publicly, or unlogged forums such as IRC channel history;\n- Personal insults, especially those using racist or sexist terms;\n- Excessive or unnecessary profanity;\n- Advocating for, or encouraging, any of the above behavior; and\n- Other conduct which could reasonably be considered inappropriate in a professional setting\n\n## Our Responsibilities\n\nWith the support of the Eclipse Foundation employees, consultants, officers, and directors (collectively, the \"Staff\"), Committers, and Project Leads, the Eclipse Foundation Conduct Committee (the \"Conduct Committee\") is responsible for clarifying the standards of acceptable behavior. The Conduct Committee takes appropriate and fair corrective action in response to any instances of unacceptable behavior.\n\n## Scope\n\nThis Code applies within all Project, Working Group, and Interest Group spaces and communication channels of the Eclipse Foundation (collectively, \"Eclipse spaces\"), within any Eclipse-organized event or meeting, and in public spaces when an individual is representing an Eclipse Foundation Project, Working Group, Interest Group, or their communities. Examples of representing a Project or community include posting via an official social media account, personal accounts, or acting as an appointed representative at an online or offline event. Representation of Projects, Working Groups, and Interest Groups may be further defined and clarified by Committers, Project Leads, or the Staff.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be reported by contacting the Conduct Committee via conduct@eclipse-foundation.org. All complaints will be reviewed and investigated and will result in a response that is deemed necessary and appropriate to the circumstances. Without the explicit consent of the reporter, the Conduct Committee is obligated to maintain confidentiality with regard to the reporter of an incident. The Conduct Committee is further obligated to ensure that the respondent is provided with sufficient information about the complaint to reply. If such details cannot be provided while maintaining confidentiality, the Conduct Committee will take the respondent‘s inability to provide a defense into account in its deliberations and decisions. Further details of enforcement guidelines may be posted separately.\n\nStaff, Committers and Project Leads have the right to report, remove, edit, or reject comments, commits, code, wiki edits, issues, and other contributions that are not aligned to this Code, or to block temporarily or permanently any Contributor for other behaviors that they deem inappropriate, threatening, offensive, or harmful. Any such actions will be reported to the Conduct Committee for transparency and record keeping.\n\nAny Staff (including officers and directors of the Eclipse Foundation), Committers, Project Leads, or Conduct Committee members who are the subject of a complaint to the Conduct Committee will be recused from the process of resolving any such complaint.\n\n## Responsibility\n\nThe responsibility for administering this Code rests with the Conduct Committee, with oversight by the Executive Director and the Board of Directors. For additional information on the Conduct Committee and its process, please write to <conduct@eclipse-foundation.org>.\n\n## Investigation of Potential Code Violations\n\nAll conflict is not bad as a healthy debate may sometimes be necessary to push us to do our best. It is, however, unacceptable to be disrespectful or offensive, or violate this Code. If you see someone engaging in objectionable behavior violating this Code, we encourage you to address the behavior directly with those involved. If for some reason, you are unable to resolve the matter or feel uncomfortable doing so, or if the behavior is threatening or harassing, please report it following the procedure laid out below.\n\nReports should be directed to <conduct@eclipse-foundation.org>. It is the Conduct Committee’s role to receive and address reported violations of this Code and to ensure a fair and speedy resolution.\n\nThe Eclipse Foundation takes all reports of potential Code violations seriously and is committed to confidentiality and a full investigation of all allegations. The identity of the reporter will be omitted from the details of the report supplied to the accused. Contributors who are being investigated for a potential Code violation will have an opportunity to be heard prior to any final determination. Those found to have violated the Code can seek reconsideration of the violation and disciplinary action decisions. Every effort will be made to have all matters disposed of within 60 days of the receipt of the complaint.\n\n## Actions\nContributors who do not follow this Code in good faith may face temporary or permanent repercussions as determined by the Conduct Committee.\n\nThis Code does not address all conduct. It works in conjunction with our [Communication Channel Guidelines](https://www.eclipse.org/org/documents/communication-channel-guidelines/), [Social Media Guidelines](https://www.eclipse.org/org/documents/social_media_guidelines.php), [Bylaws](https://www.eclipse.org/org/documents/eclipse-foundation-be-bylaws-en.pdf), and [Internal Rules](https://www.eclipse.org/org/documents/ef-be-internal-rules.pdf) which set out additional protections for, and obligations of, all contributors. The Foundation has additional policies that provide further guidance on other matters.\n\nIt’s impossible to spell out every possible scenario that might be deemed a violation of this Code. Instead, we rely on one another’s good judgment to uphold a high standard of integrity within all Eclipse Spaces. Sometimes, identifying the right thing to do isn’t an easy call. In such a scenario, raise the issue as early as possible.\n\n## No Retaliation\n\nThe Eclipse community relies upon and values the help of Contributors who identify potential problems that may need to be addressed within an Eclipse Space. Any retaliation against a Contributor who raises an issue honestly is a violation of this Code. That a Contributor has raised a concern honestly or participated in an investigation, cannot be the basis for any adverse action, including threats, harassment, or discrimination. If you work with someone who has raised a concern or provided information in an investigation, you should continue to treat the person with courtesy and respect. If you believe someone has retaliated against you, report the matter as described by this Code. Honest reporting does not mean that you have to be right when you raise a concern; you just have to believe that the information you are providing is accurate.\n\nFalse reporting, especially when intended to retaliate or exclude, is itself a violation of this Code and will not be accepted or tolerated.\n\nEveryone is encouraged to ask questions about this Code. Your feedback is welcome, and you will get a response within three business days. Write to <conduct@eclipse-foundation.org>.\n\n## Amendments\n\nThe Eclipse Foundation Board of Directors may amend this Code from time to time and may vary the procedures it sets out where appropriate in a particular case.\n\n### Attribution\n\nThis Code was inspired by the [Contributor Covenant](https://www.contributor-covenant.org/), version 1.4, available [here](https://www.contributor-covenant.org/version/1/4/code-of-conduct/).\n\n[^1]: Capitalized terms used herein without definition shall have the meanings assigned to them in the Bylaws.\n\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 3.6162109375,
          "content": "# Contributing to Paho\r\n\r\nThanks for your interest in this project!\r\n\r\nYou can contribute bugfixes and new features by sending pull requests through GitHub.\r\n\r\n## Legal\r\n\r\nIn order for your contribution to be accepted, it must comply with the Eclipse Foundation IP policy.\r\n\r\nPlease read the [Eclipse Foundation policy on accepting contributions via Git](http://wiki.eclipse.org/Development_Resources/Contributing_via_Git).\r\n\r\n1. Sign the [Eclipse CLA](http://www.eclipse.org/legal/CLA.php)\r\n  1. Register for an Eclipse Foundation User ID. You can register [here](https://dev.eclipse.org/site_login/createaccount.php).\r\n  2. Log into the [Projects Portal](https://projects.eclipse.org/), and click on the '[Eclipse CLA](https://projects.eclipse.org/user/sign/cla)' link.\r\n2. Go to your [account settings](https://dev.eclipse.org/site_login/myaccount.php#open_tab_accountsettings) and add your GitHub username to your account.\r\n3. Make sure that you _sign-off_ your Git commits in the following format:\r\n  ``` Signed-off-by: John Smith <johnsmith@nowhere.com> ``` This is usually at the bottom of the commit message. You can automate this by adding the '-s' flag when you make the commits. e.g.   ```git commit -s -m \"Adding a cool feature\"```\r\n4. Ensure that the email address that you make your commits with is the same one you used to sign up to the Eclipse Foundation website with.\r\n\r\n## Contributing a change\r\n\r\n## Contributing a change\r\n\r\n1. [Fork the repository on GitHub](https://github.com/eclipse/paho.mqtt.android/fork)\r\n2. Clone the forked repository onto your computer: ``` git clone https://github.com/<your username>/paho.mqtt.android.git ```\r\n3. Create a new branch from the latest ```develop``` branch with ```git checkout -b YOUR_BRANCH_NAME origin/develop```\r\n4. Make your changes\r\n5. If developing a new feature, make sure to include JUnit tests.\r\n6. Ensure that all new and existing tests pass.\r\n7. Commit the changes into the branch: ``` git commit -s ``` Make sure that your commit message is meaningful and describes your changes correctly.\r\n8. If you have a lot of commits for the change, squash them into a single / few commits.\r\n9. Push the changes in your branch to your forked repository.\r\n10. Finally, go to [https://github.com/eclipse/paho.mqtt.android](https://github.com/eclipse/paho.mqtt.android) and create a pull request from your \"YOUR_BRANCH_NAME\" branch to the ```develop``` one to request review and merge of the commits in your pushed branch.\r\n\r\n\r\nWhat happens next depends on the content of the patch. If it is 100% authored\r\nby the contributor and is less than 1000 lines (and meets the needs of the\r\nproject), then it can be pulled into the main repository. If not, more steps\r\nare required. These are detailed in the\r\n[legal process poster](http://www.eclipse.org/legal/EclipseLegalProcessPoster.pdf).\r\n\r\n\r\n\r\n## Developer resources:\r\n\r\n\r\nInformation regarding source code management, builds, coding standards, and more.\r\n\r\n- [https://projects.eclipse.org/projects/iot.paho/developer](https://projects.eclipse.org/projects/iot.paho/developer)\r\n\r\nContact:\r\n--------\r\n\r\nContact the project developers via the project's development\r\n[mailing list](https://dev.eclipse.org/mailman/listinfo/paho-dev).\r\n\r\nSearch for bugs:\r\n----------------\r\n\r\nThis project uses GitHub Issues here: [github.com/eclipse/paho.mqtt.android/issues](https://github.com/eclipse/paho.mqtt.android/issues) to track ongoing development and issues.\r\n\r\nCreate a new bug:\r\n-----------------\r\n\r\nBe sure to search for existing bugs before you create another one. Remember that contributions are always welcome!\r\n\r\n- [Create new Paho bug](https://github.com/eclipse/paho.mqtt.android/issues/new)\r\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 0.5078125,
          "content": "Eclipse Public License - v 2.0\n\nThis program and the accompanying materials\nare made available under the terms of the Eclipse Public License v2.0\nand Eclipse Distribution License v1.0 which accompany this distribution.\n\nThe Eclipse Public License is available at\n  https://www.eclipse.org/legal/epl-2.0/\nand the Eclipse Distribution License is available at\n  http://www.eclipse.org/org/documents/edl-v10.php.\n\nFor an explanation of what dual-licensing means to you, see:\nhttps://www.eclipse.org/legal/eplfaq.php#DUALLIC\n"
        },
        {
          "name": "NOTICE",
          "type": "blob",
          "size": 2.017578125,
          "content": "# Notices for Eclipse Paho\n\nThis content is produced and maintained by the Eclipse Paho project.\n\n* Project home: https://projects.eclipse.org/projects/iot.paho\n\n## Trademarks\n\nPaho™ is a trademark of the Eclipse Foundation.\n\n## Copyright\n\nAll content is the property of the respective authors or their employers. For\nmore information regarding authorship of content, please consult the listed\nsource code repository logs.\n\n## Declared Project Licenses\n\nThis program and the accompanying materials are made available under the terms\nof the Eclipse Public License v2.0 which is available at\nhttps://www.eclipse.org/legal/epl-2.0, or the Eclipse Distribution License\nv1.0 which is available at https://www.eclipse.org/org/documents/edl-v10.php.\n\nSPDX-License-Identifier: EPL-2.0 OR BSD-3-Clause\n\n## Source Code\n\nThe project maintains the following source code repositories:\n\n* https://github.com/eclipse/paho-website\n* https://github.com/eclipse/paho.golang\n* https://github.com/eclipse/paho.mqtt-sn.embedded-c\n* https://github.com/eclipse/paho.mqtt-spy\n* https://github.com/eclipse/paho.mqtt.android\n* https://github.com/eclipse/paho.mqtt.c\n* https://github.com/eclipse/paho.mqtt.cpp\n* https://github.com/eclipse/paho.mqtt.d\n* https://github.com/eclipse/paho.mqtt.embedded-c\n* https://github.com/eclipse/paho.mqtt.golang\n* https://github.com/eclipse/paho.mqtt.java\n* https://github.com/eclipse/paho.mqtt.javascript\n* https://github.com/eclipse/paho.mqtt.m2mqtt\n* https://github.com/eclipse/paho.mqtt.python\n* https://github.com/eclipse/paho.mqtt.ruby\n* https://github.com/eclipse/paho.mqtt.rust\n* https://github.com/eclipse/paho.mqtt.testing\n\n## Cryptography\n\nContent may contain encryption software. The country in which you are currently\nmay have restrictions on the import, possession, and use, and/or re-export to\nanother country, of encryption software. BEFORE using any encryption software,\nplease check the country's laws, regulations and policies concerning the import,\npossession, or use, and re-export of encryption software, to see if this is\npermitted.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 5.4248046875,
          "content": "# Eclipse Paho Android Service\n[![Build Status](https://travis-ci.org/eclipse/paho.mqtt.android.svg?branch=master)](https://travis-ci.org/eclipse/paho.mqtt.android)\n\nThe Paho Android Service is an MQTT client library written in Java for developing applications on Android.\n\n\n## Features\n|                     |                    |   |                      |                    |\n|---------------------|--------------------|---|----------------------|--------------------|\n| MQTT 3.1            | :heavy_check_mark: |   | Automatic Reconnect  | :heavy_check_mark: |\n| MQTT 3.1.1          | :heavy_check_mark: |   | Offline Buffering    | :heavy_check_mark: |\n| LWT                 | :heavy_check_mark: |   | WebSocket Support    | :heavy_check_mark: |\n| SSL / TLS           | :heavy_check_mark: |   | Standard TCP Support | :heavy_check_mark: |\n| Message Persistence | :heavy_check_mark: |   |\n\n\nTo get started, download [Android Studio](http://developer.android.com/tools/studio/index.html). You will also need to download the [Android SDK](https://developer.android.com/sdk/installing/adding-packages.html). Currently you will need the SDK for 24.\n\n\n## Project description:\n\nThe Paho project has been created to provide reliable open-source implementations of open and standard messaging protocols aimed at new, existing, and emerging applications for Machine-to-Machine (M2M) and Internet of Things (IoT).\nPaho reflects the inherent physical and cost constraints of device connectivity. Its objectives include effective levels of decoupling between devices and applications, designed to keep markets open and encourage the rapid growth of scalable Web and Enterprise middleware and applications.\n\n\n## Links\n\n- Project Website: [https://www.eclipse.org/paho](https://www.eclipse.org/paho)\n- Eclipse Project Information: [https://projects.eclipse.org/projects/iot.paho](https://projects.eclipse.org/projects/iot.paho)\n- Paho Android Client Page: [https://www.eclipse.org/paho/clients/android/](https://www.eclipse.org/paho/clients/android/)\n- GitHub: [https://github.com/eclipse/paho.mqtt.android](https://github.com/eclipse/paho.mqtt.android)\n- Twitter: [@eclipsepaho](https://twitter.com/eclipsepaho)\n- Issues: [https://github.com/eclipse/paho.mqtt.android/issues](https://github.com/eclipse/paho.mqtt.android/issues)\n- Mailing-list: [https://dev.eclipse.org/mailman/listinfo/paho-dev](https://dev.eclipse.org/mailman/listinfo/paho-dev)\n\n\n## Using the Paho Android Client\n\n### Downloading\n\n#### Maven\n\nEclipse hosts a Nexus repository for those who want to use Maven to manage their dependencies.\n\nAdd the repository definition and the dependency definition shown below to your pom.xml.\n\nReplace %REPOURL% with either ``` https://repo.eclipse.org/content/repositories/paho-releases/ ``` for the official releases, or ``` https://repo.eclipse.org/content/repositories/paho-snapshots/  ``` for the nightly snapshots. Replace %VERSION% with the level required .\nThe latest release version is ```1.1.1``` and the current snapshot version is ```1.1.2-SNAPSHOT```.\n\n```\n<project ...>\n<repositories>\n    <repository>\n        <id>Eclipse Paho Repo</id>\n        <url>%REPOURL%</url>\n    </repository>\n</repositories>\n...\n<dependencies>\n    <dependency>\n        <groupId>org.eclipse.paho</groupId>\n        <artifactId>org.eclipse.paho.android.service</artifactId>\n        <version>%VERSION%</version>\n    </dependency>\n</dependencies>\n</project>\n\n```\n\n#### Gradle\n\nIf you are using Android Studio and / or Gradle to manage your application dependencies and build then you can use the same repository to get the Paho Android Service. Add the Eclipse Maven repository to your `build.gradle` file and then add the Paho dependency to the `dependencies` section.\n\n```\nrepositories {\n    maven {\n        url \"https://repo.eclipse.org/content/repositories/paho-snapshots/\"\n    }\n}\n\n\ndependencies {\n    compile 'org.eclipse.paho:org.eclipse.paho.client.mqttv3:1.1.0'\n    compile 'org.eclipse.paho:org.eclipse.paho.android.service:1.1.1'\n}\n```\n__Note:__ currently you have to include the `org.eclipse.paho:org.eclipse.paho.client.mqttv3` dependency as well. We are attempting to get the build to produce an Android `AAR` file that contains both the Android service as well as it's dependencies, however this is still experimental. If you wish to try it, remove the `org.eclipse.paho:org.eclipse.paho.client.mqttv3` dependency and append `@aar` to the end of the Android Service dependency. E.g. `org.eclipse.paho:org.eclipse.paho.android.service:1.1.1@aar`\n\nIf you find that there is functionality missing or bugs in the release version, you may want to try using the snapshot version to see if this helps before raising a feature request or an issue.\n\n### Building from source\n\n - Open a terminal and navigate to this directory (org.eclipse.paho.android.service)\n - Run the command ``./gradlew clean assemble exportJar` or on Windows: `gradlew.bat clean assemble exportJar`\n\n### Running the Sample App:\n\n * Open the this current directory in Android Studio (org.eclipse.paho.android.service).\n * In the toolbar along the top, there should be a dropdown menu. Make sure that it contains 'org.eclipse.android.sample' then click the Green 'Run' Triangle. It should now build and launch an Virtual Android Device to run the App. If you have an Android device with developer mode turned on plugged in, you will have the oppertunity to run it directly on that.\n * If you have any problems, check out the Android Developer Documentation for help: https://developer.android.com\n"
        },
        {
          "name": "SECURITY.md",
          "type": "blob",
          "size": 0.64453125,
          "content": "# Security Policy\n\nThis project follows the [Eclipse Vulnerability Reporting Policy](https://www.eclipse.org/security/policy.php).\nVulnerabilities are tracked by the Eclipse security team, in cooperation with the project lead.\nFixing vulnerabilities is taken care of by the project committers, with assistance and guidance of the security\nteam.\n\n## Supported Versions\n\nEclipse Paho provides security updates for the most recent version only.\n\n## Reporting a Vulnerability\n\nWe recommend that in case of suspected vulnerabilities you do not create a GitHub issue, but instead contact the\nEclipse Security Team directly sending an email to security@eclipse.org.\n\n"
        },
        {
          "name": "about.html",
          "type": "blob",
          "size": 1.5673828125,
          "content": "<!DOCTYPE html PUBLIC \"-//W3C//DTD XHTML 1.0 Strict//EN\" \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd\">\n<html xmlns=\"http://www.w3.org/1999/xhtml\"><head>\n<meta http-equiv=\"Content-Type\" content=\"text/html; charset=ISO-8859-1\">\n<title>About</title>\n</head>\n<body lang=\"EN-US\">\n<h2>About This Content</h2>\n \n<p><em>December 9, 2013</em></p>\t\n<h3>License</h3>\n\n<p>The Eclipse Foundation makes available all content in this plug-in (\"Content\").  Unless otherwise \nindicated below, the Content is provided to you under the terms and conditions of the\nEclipse Public License Version 1.0 (\"EPL\") and Eclipse Distribution License Version 1.0 (\"EDL\").\nA copy of the EPL is available at \n<a href=\"http://www.eclipse.org/legal/epl-v10.html\">http://www.eclipse.org/legal/epl-v10.html</a> \nand a copy of the EDL is available at \n<a href=\"http://www.eclipse.org/org/documents/edl-v10.php\">http://www.eclipse.org/org/documents/edl-v10.php</a>. \nFor purposes of the EPL, \"Program\" will mean the Content.</p>\n\n<p>If you did not receive this Content directly from the Eclipse Foundation, the Content is \nbeing redistributed by another party (\"Redistributor\") and different terms and conditions may\napply to your use of any object code in the Content.  Check the Redistributor's license that was \nprovided with the Content.  If no such license exists, contact the Redistributor.  Unless otherwise\nindicated below, the terms and conditions of the EPL still apply to any source code in the Content\nand such source code may be obtained at <a href=\"http://www.eclipse.org/\">http://www.eclipse.org</a>.</p>\n\n</body></html>\n"
        },
        {
          "name": "build.gradle",
          "type": "blob",
          "size": 1.5302734375,
          "content": "// Top-level build file where you can add configuration options common to all sub-projects/modules.\n\nbuildscript {\n    repositories {\n        jcenter()\n        mavenCentral()\n    }\n    dependencies {\n\t    classpath 'com.android.tools.build:gradle:2.2.3'\n        // NOTE: Do not place your application dependencies here; they belong\n        // in the individual module build.gradle files\n    }\n}\n\next{\n\n    compileSdkVersion = 24\n    buildToolsVersion = '23.0.3'\n\n\n    group = 'org.eclipse.paho'\n\n    sampleArchivesBaseName = 'org.eclipse.paho.android.sample'\n    sampleVersion = '1.1.1'\n\n    serviceArchivesBaseName = 'org.eclipse.paho.android.service'\n    serviceVersion = '1.1.1'\n\n    clientVersion = '1.1.0'\n\n    mavenUrl = \"https://repo.eclipse.org/content/repositories/paho-releases/\"\n\n    supportLibVersion = '24.2.1'\n\n}\n\ndef getSdkDirFromLocalProperties() {\n    def rootDir = project.rootDir\n    def localProperties = new File(rootDir, \"local.properties\")\n    Properties properties = new Properties()\n    localProperties.withInputStream { instr ->\n        properties.load(instr)\n    }\n    properties.getProperty('sdk.dir')\n}\n\n\ndef androidHome = System.env['ANDROID_HOME']\n\ndef androidHomeIsDefined = androidHome?.trim()\n\ndef sdkDir = androidHomeIsDefined ? androidHome : getSdkDirFromLocalProperties()\n\nprintln \"SDK dir: $sdkDir\"\n\n\nallprojects {\n\n    repositories {\n        jcenter()\n        maven {\n            url \"file://$sdkDir/extras/android/m2repository/\"\n        }\n    }\n\n    version = rootProject.ext.serviceVersion\n    group = rootProject.ext.group\n}\n"
        },
        {
          "name": "edl-v10",
          "type": "blob",
          "size": 1.52734375,
          "content": "\nEclipse Distribution License - v 1.0\n\nCopyright (c) 2007, Eclipse Foundation, Inc. and its licensors.\n\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\n    Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n    Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n    Neither the name of the Eclipse Foundation, Inc. nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission. \n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n"
        },
        {
          "name": "epl-v10",
          "type": "blob",
          "size": 10.96875,
          "content": "Eclipse Public License - v 1.0\n\nTHE ACCOMPANYING PROGRAM IS PROVIDED UNDER THE TERMS OF THIS ECLIPSE PUBLIC LICENSE (\"AGREEMENT\"). ANY USE, REPRODUCTION OR DISTRIBUTION OF THE PROGRAM CONSTITUTES RECIPIENT'S ACCEPTANCE OF THIS AGREEMENT.\n\n1. DEFINITIONS\n\n\"Contribution\" means:\n\na) in the case of the initial Contributor, the initial code and documentation distributed under this Agreement, and\nb) in the case of each subsequent Contributor:\ni) changes to the Program, and\nii) additions to the Program;\nwhere such changes and/or additions to the Program originate from and are distributed by that particular Contributor. A Contribution 'originates' from a Contributor if it was added to the Program by such Contributor itself or anyone acting on such Contributor's behalf. Contributions do not include additions to the Program which: (i) are separate modules of software distributed in conjunction with the Program under their own license agreement, and (ii) are not derivative works of the Program.\n\"Contributor\" means any person or entity that distributes the Program.\n\n\"Licensed Patents\" mean patent claims licensable by a Contributor which are necessarily infringed by the use or sale of its Contribution alone or when combined with the Program.\n\n\"Program\" means the Contributions distributed in accordance with this Agreement.\n\n\"Recipient\" means anyone who receives the Program under this Agreement, including all Contributors.\n\n2. GRANT OF RIGHTS\n\na) Subject to the terms of this Agreement, each Contributor hereby grants Recipient a non-exclusive, worldwide, royalty-free copyright license to reproduce, prepare derivative works of, publicly display, publicly perform, distribute and sublicense the Contribution of such Contributor, if any, and such derivative works, in source code and object code form.\nb) Subject to the terms of this Agreement, each Contributor hereby grants Recipient a non-exclusive, worldwide, royalty-free patent license under Licensed Patents to make, use, sell, offer to sell, import and otherwise transfer the Contribution of such Contributor, if any, in source code and object code form. This patent license shall apply to the combination of the Contribution and the Program if, at the time the Contribution is added by the Contributor, such addition of the Contribution causes such combination to be covered by the Licensed Patents. The patent license shall not apply to any other combinations which include the Contribution. No hardware per se is licensed hereunder.\nc) Recipient understands that although each Contributor grants the licenses to its Contributions set forth herein, no assurances are provided by any Contributor that the Program does not infringe the patent or other intellectual property rights of any other entity. Each Contributor disclaims any liability to Recipient for claims brought by any other entity based on infringement of intellectual property rights or otherwise. As a condition to exercising the rights and licenses granted hereunder, each Recipient hereby assumes sole responsibility to secure any other intellectual property rights needed, if any. For example, if a third party patent license is required to allow Recipient to distribute the Program, it is Recipient's responsibility to acquire that license before distributing the Program.\nd) Each Contributor represents that to its knowledge it has sufficient copyright rights in its Contribution, if any, to grant the copyright license set forth in this Agreement.\n3. REQUIREMENTS\n\nA Contributor may choose to distribute the Program in object code form under its own license agreement, provided that:\n\na) it complies with the terms and conditions of this Agreement; and\nb) its license agreement:\ni) effectively disclaims on behalf of all Contributors all warranties and conditions, express and implied, including warranties or conditions of title and non-infringement, and implied warranties or conditions of merchantability and fitness for a particular purpose;\nii) effectively excludes on behalf of all Contributors all liability for damages, including direct, indirect, special, incidental and consequential damages, such as lost profits;\niii) states that any provisions which differ from this Agreement are offered by that Contributor alone and not by any other party; and\niv) states that source code for the Program is available from such Contributor, and informs licensees how to obtain it in a reasonable manner on or through a medium customarily used for software exchange.\nWhen the Program is made available in source code form:\n\na) it must be made available under this Agreement; and\nb) a copy of this Agreement must be included with each copy of the Program.\nContributors may not remove or alter any copyright notices contained within the Program.\n\nEach Contributor must identify itself as the originator of its Contribution, if any, in a manner that reasonably allows subsequent Recipients to identify the originator of the Contribution.\n\n4. COMMERCIAL DISTRIBUTION\n\nCommercial distributors of software may accept certain responsibilities with respect to end users, business partners and the like. While this license is intended to facilitate the commercial use of the Program, the Contributor who includes the Program in a commercial product offering should do so in a manner which does not create potential liability for other Contributors. Therefore, if a Contributor includes the Program in a commercial product offering, such Contributor (\"Commercial Contributor\") hereby agrees to defend and indemnify every other Contributor (\"Indemnified Contributor\") against any losses, damages and costs (collectively \"Losses\") arising from claims, lawsuits and other legal actions brought by a third party against the Indemnified Contributor to the extent caused by the acts or omissions of such Commercial Contributor in connection with its distribution of the Program in a commercial product offering. The obligations in this section do not apply to any claims or Losses relating to any actual or alleged intellectual property infringement. In order to qualify, an Indemnified Contributor must: a) promptly notify the Commercial Contributor in writing of such claim, and b) allow the Commercial Contributor to control, and cooperate with the Commercial Contributor in, the defense and any related settlement negotiations. The Indemnified Contributor may participate in any such claim at its own expense.\n\nFor example, a Contributor might include the Program in a commercial product offering, Product X. That Contributor is then a Commercial Contributor. If that Commercial Contributor then makes performance claims, or offers warranties related to Product X, those performance claims and warranties are such Commercial Contributor's responsibility alone. Under this section, the Commercial Contributor would have to defend claims against the other Contributors related to those performance claims and warranties, and if a court requires any other Contributor to pay any damages as a result, the Commercial Contributor must pay those damages.\n\n5. NO WARRANTY\n\nEXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, THE PROGRAM IS PROVIDED ON AN \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED INCLUDING, WITHOUT LIMITATION, ANY WARRANTIES OR CONDITIONS OF TITLE, NON-INFRINGEMENT, MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE. Each Recipient is solely responsible for determining the appropriateness of using and distributing the Program and assumes all risks associated with its exercise of rights under this Agreement , including but not limited to the risks and costs of program errors, compliance with applicable laws, damage to or loss of data, programs or equipment, and unavailability or interruption of operations.\n\n6. DISCLAIMER OF LIABILITY\n\nEXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, NEITHER RECIPIENT NOR ANY CONTRIBUTORS SHALL HAVE ANY LIABILITY FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING WITHOUT LIMITATION LOST PROFITS), HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OR DISTRIBUTION OF THE PROGRAM OR THE EXERCISE OF ANY RIGHTS GRANTED HEREUNDER, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n7. GENERAL\n\nIf any provision of this Agreement is invalid or unenforceable under applicable law, it shall not affect the validity or enforceability of the remainder of the terms of this Agreement, and without further action by the parties hereto, such provision shall be reformed to the minimum extent necessary to make such provision valid and enforceable.\n\nIf Recipient institutes patent litigation against any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the Program itself (excluding combinations of the Program with other software or hardware) infringes such Recipient's patent(s), then such Recipient's rights granted under Section 2(b) shall terminate as of the date such litigation is filed.\n\nAll Recipient's rights under this Agreement shall terminate if it fails to comply with any of the material terms or conditions of this Agreement and does not cure such failure in a reasonable period of time after becoming aware of such noncompliance. If all Recipient's rights under this Agreement terminate, Recipient agrees to cease use and distribution of the Program as soon as reasonably practicable. However, Recipient's obligations under this Agreement and any licenses granted by Recipient relating to the Program shall continue and survive.\n\nEveryone is permitted to copy and distribute copies of this Agreement, but in order to avoid inconsistency the Agreement is copyrighted and may only be modified in the following manner. The Agreement Steward reserves the right to publish new versions (including revisions) of this Agreement from time to time. No one other than the Agreement Steward has the right to modify this Agreement. The Eclipse Foundation is the initial Agreement Steward. The Eclipse Foundation may assign the responsibility to serve as the Agreement Steward to a suitable separate entity. Each new version of the Agreement will be given a distinguishing version number. The Program (including Contributions) may always be distributed subject to the version of the Agreement under which it was received. In addition, after a new version of the Agreement is published, Contributor may elect to distribute the Program (including its Contributions) under the new version. Except as expressly stated in Sections 2(a) and 2(b) above, Recipient receives no rights or licenses to the intellectual property of any Contributor under this Agreement, whether expressly, by implication, estoppel or otherwise. All rights in the Program not expressly granted under this Agreement are reserved.\n\nThis Agreement is governed by the laws of the State of New York and the intellectual property laws of the United States of America. No party to this Agreement will bring a legal action under this Agreement more than one year after the cause of action arose. Each party waives its rights to a jury trial in any resulting litigation.\n"
        },
        {
          "name": "gradle.properties",
          "type": "blob",
          "size": 0.8349609375,
          "content": "# Project-wide Gradle settings.\n\n# IDE (e.g. Android Studio) users:\n# Gradle settings configured through the IDE *will override*\n# any settings specified in this file.\n\n# For more details on how to configure your build environment visit\n# http://www.gradle.org/docs/current/userguide/build_environment.html\n\n# Specifies the JVM arguments used for the daemon process.\n# The setting is particularly useful for tweaking memory settings.\n# Default value: -Xmx10248m -XX:MaxPermSize=256m\n# org.gradle.jvmargs=-Xmx2048m -XX:MaxPermSize=512m -XX:+HeapDumpOnOutOfMemoryError -Dfile.encoding=UTF-8\n\n# When configured, Gradle will run in incubating parallel mode.\n# This option should only be used with decoupled projects. More details, visit\n# http://www.gradle.org/docs/current/userguide/multi_project_builds.html#sec:decoupled_projects\n# org.gradle.parallel=true"
        },
        {
          "name": "gradle",
          "type": "tree",
          "content": null
        },
        {
          "name": "gradlew",
          "type": "blob",
          "size": 4.927734375,
          "content": "#!/usr/bin/env bash\n\n##############################################################################\n##\n##  Gradle start up script for UN*X\n##\n##############################################################################\n\n# Attempt to set APP_HOME\n# Resolve links: $0 may be a link\nPRG=\"$0\"\n# Need this for relative symlinks.\nwhile [ -h \"$PRG\" ] ; do\n    ls=`ls -ld \"$PRG\"`\n    link=`expr \"$ls\" : '.*-> \\(.*\\)$'`\n    if expr \"$link\" : '/.*' > /dev/null; then\n        PRG=\"$link\"\n    else\n        PRG=`dirname \"$PRG\"`\"/$link\"\n    fi\ndone\nSAVED=\"`pwd`\"\ncd \"`dirname \\\"$PRG\\\"`/\" >/dev/null\nAPP_HOME=\"`pwd -P`\"\ncd \"$SAVED\" >/dev/null\n\nAPP_NAME=\"Gradle\"\nAPP_BASE_NAME=`basename \"$0\"`\n\n# Add default JVM options here. You can also use JAVA_OPTS and GRADLE_OPTS to pass JVM options to this script.\nDEFAULT_JVM_OPTS=\"\"\n\n# Use the maximum available, or set MAX_FD != -1 to use that value.\nMAX_FD=\"maximum\"\n\nwarn ( ) {\n    echo \"$*\"\n}\n\ndie ( ) {\n    echo\n    echo \"$*\"\n    echo\n    exit 1\n}\n\n# OS specific support (must be 'true' or 'false').\ncygwin=false\nmsys=false\ndarwin=false\nnonstop=false\ncase \"`uname`\" in\n  CYGWIN* )\n    cygwin=true\n    ;;\n  Darwin* )\n    darwin=true\n    ;;\n  MINGW* )\n    msys=true\n    ;;\n  NONSTOP* )\n    nonstop=true\n    ;;\nesac\n\nCLASSPATH=$APP_HOME/gradle/wrapper/gradle-wrapper.jar\n\n# Determine the Java command to use to start the JVM.\nif [ -n \"$JAVA_HOME\" ] ; then\n    if [ -x \"$JAVA_HOME/jre/sh/java\" ] ; then\n        # IBM's JDK on AIX uses strange locations for the executables\n        JAVACMD=\"$JAVA_HOME/jre/sh/java\"\n    else\n        JAVACMD=\"$JAVA_HOME/bin/java\"\n    fi\n    if [ ! -x \"$JAVACMD\" ] ; then\n        die \"ERROR: JAVA_HOME is set to an invalid directory: $JAVA_HOME\n\nPlease set the JAVA_HOME variable in your environment to match the\nlocation of your Java installation.\"\n    fi\nelse\n    JAVACMD=\"java\"\n    which java >/dev/null 2>&1 || die \"ERROR: JAVA_HOME is not set and no 'java' command could be found in your PATH.\n\nPlease set the JAVA_HOME variable in your environment to match the\nlocation of your Java installation.\"\nfi\n\n# Increase the maximum file descriptors if we can.\nif [ \"$cygwin\" = \"false\" -a \"$darwin\" = \"false\" -a \"$nonstop\" = \"false\" ] ; then\n    MAX_FD_LIMIT=`ulimit -H -n`\n    if [ $? -eq 0 ] ; then\n        if [ \"$MAX_FD\" = \"maximum\" -o \"$MAX_FD\" = \"max\" ] ; then\n            MAX_FD=\"$MAX_FD_LIMIT\"\n        fi\n        ulimit -n $MAX_FD\n        if [ $? -ne 0 ] ; then\n            warn \"Could not set maximum file descriptor limit: $MAX_FD\"\n        fi\n    else\n        warn \"Could not query maximum file descriptor limit: $MAX_FD_LIMIT\"\n    fi\nfi\n\n# For Darwin, add options to specify how the application appears in the dock\nif $darwin; then\n    GRADLE_OPTS=\"$GRADLE_OPTS \\\"-Xdock:name=$APP_NAME\\\" \\\"-Xdock:icon=$APP_HOME/media/gradle.icns\\\"\"\nfi\n\n# For Cygwin, switch paths to Windows format before running java\nif $cygwin ; then\n    APP_HOME=`cygpath --path --mixed \"$APP_HOME\"`\n    CLASSPATH=`cygpath --path --mixed \"$CLASSPATH\"`\n    JAVACMD=`cygpath --unix \"$JAVACMD\"`\n\n    # We build the pattern for arguments to be converted via cygpath\n    ROOTDIRSRAW=`find -L / -maxdepth 1 -mindepth 1 -type d 2>/dev/null`\n    SEP=\"\"\n    for dir in $ROOTDIRSRAW ; do\n        ROOTDIRS=\"$ROOTDIRS$SEP$dir\"\n        SEP=\"|\"\n    done\n    OURCYGPATTERN=\"(^($ROOTDIRS))\"\n    # Add a user-defined pattern to the cygpath arguments\n    if [ \"$GRADLE_CYGPATTERN\" != \"\" ] ; then\n        OURCYGPATTERN=\"$OURCYGPATTERN|($GRADLE_CYGPATTERN)\"\n    fi\n    # Now convert the arguments - kludge to limit ourselves to /bin/sh\n    i=0\n    for arg in \"$@\" ; do\n        CHECK=`echo \"$arg\"|egrep -c \"$OURCYGPATTERN\" -`\n        CHECK2=`echo \"$arg\"|egrep -c \"^-\"`                                 ### Determine if an option\n\n        if [ $CHECK -ne 0 ] && [ $CHECK2 -eq 0 ] ; then                    ### Added a condition\n            eval `echo args$i`=`cygpath --path --ignore --mixed \"$arg\"`\n        else\n            eval `echo args$i`=\"\\\"$arg\\\"\"\n        fi\n        i=$((i+1))\n    done\n    case $i in\n        (0) set -- ;;\n        (1) set -- \"$args0\" ;;\n        (2) set -- \"$args0\" \"$args1\" ;;\n        (3) set -- \"$args0\" \"$args1\" \"$args2\" ;;\n        (4) set -- \"$args0\" \"$args1\" \"$args2\" \"$args3\" ;;\n        (5) set -- \"$args0\" \"$args1\" \"$args2\" \"$args3\" \"$args4\" ;;\n        (6) set -- \"$args0\" \"$args1\" \"$args2\" \"$args3\" \"$args4\" \"$args5\" ;;\n        (7) set -- \"$args0\" \"$args1\" \"$args2\" \"$args3\" \"$args4\" \"$args5\" \"$args6\" ;;\n        (8) set -- \"$args0\" \"$args1\" \"$args2\" \"$args3\" \"$args4\" \"$args5\" \"$args6\" \"$args7\" ;;\n        (9) set -- \"$args0\" \"$args1\" \"$args2\" \"$args3\" \"$args4\" \"$args5\" \"$args6\" \"$args7\" \"$args8\" ;;\n    esac\nfi\n\n# Split up the JVM_OPTS And GRADLE_OPTS values into an array, following the shell quoting and substitution rules\nfunction splitJvmOpts() {\n    JVM_OPTS=(\"$@\")\n}\neval splitJvmOpts $DEFAULT_JVM_OPTS $JAVA_OPTS $GRADLE_OPTS\nJVM_OPTS[${#JVM_OPTS[*]}]=\"-Dorg.gradle.appname=$APP_BASE_NAME\"\n\nexec \"$JAVACMD\" \"${JVM_OPTS[@]}\" -classpath \"$CLASSPATH\" org.gradle.wrapper.GradleWrapperMain \"$@\"\n"
        },
        {
          "name": "gradlew.bat",
          "type": "blob",
          "size": 2.34765625,
          "content": "@if \"%DEBUG%\" == \"\" @echo off\r\n@rem ##########################################################################\r\n@rem\r\n@rem  Gradle startup script for Windows\r\n@rem\r\n@rem ##########################################################################\r\n\r\n@rem Set local scope for the variables with windows NT shell\r\nif \"%OS%\"==\"Windows_NT\" setlocal\r\n\r\nset DIRNAME=%~dp0\r\nif \"%DIRNAME%\" == \"\" set DIRNAME=.\r\nset APP_BASE_NAME=%~n0\r\nset APP_HOME=%DIRNAME%\r\n\r\n@rem Add default JVM options here. You can also use JAVA_OPTS and GRADLE_OPTS to pass JVM options to this script.\r\nset DEFAULT_JVM_OPTS=\r\n\r\n@rem Find java.exe\r\nif defined JAVA_HOME goto findJavaFromJavaHome\r\n\r\nset JAVA_EXE=java.exe\r\n%JAVA_EXE% -version >NUL 2>&1\r\nif \"%ERRORLEVEL%\" == \"0\" goto init\r\n\r\necho.\r\necho ERROR: JAVA_HOME is not set and no 'java' command could be found in your PATH.\r\necho.\r\necho Please set the JAVA_HOME variable in your environment to match the\r\necho location of your Java installation.\r\n\r\ngoto fail\r\n\r\n:findJavaFromJavaHome\r\nset JAVA_HOME=%JAVA_HOME:\"=%\r\nset JAVA_EXE=%JAVA_HOME%/bin/java.exe\r\n\r\nif exist \"%JAVA_EXE%\" goto init\r\n\r\necho.\r\necho ERROR: JAVA_HOME is set to an invalid directory: %JAVA_HOME%\r\necho.\r\necho Please set the JAVA_HOME variable in your environment to match the\r\necho location of your Java installation.\r\n\r\ngoto fail\r\n\r\n:init\r\n@rem Get command-line arguments, handling Windows variants\r\n\r\nif not \"%OS%\" == \"Windows_NT\" goto win9xME_args\r\nif \"%@eval[2+2]\" == \"4\" goto 4NT_args\r\n\r\n:win9xME_args\r\n@rem Slurp the command line arguments.\r\nset CMD_LINE_ARGS=\r\nset _SKIP=2\r\n\r\n:win9xME_args_slurp\r\nif \"x%~1\" == \"x\" goto execute\r\n\r\nset CMD_LINE_ARGS=%*\r\ngoto execute\r\n\r\n:4NT_args\r\n@rem Get arguments from the 4NT Shell from JP Software\r\nset CMD_LINE_ARGS=%$\r\n\r\n:execute\r\n@rem Setup the command line\r\n\r\nset CLASSPATH=%APP_HOME%\\gradle\\wrapper\\gradle-wrapper.jar\r\n\r\n@rem Execute Gradle\r\n\"%JAVA_EXE%\" %DEFAULT_JVM_OPTS% %JAVA_OPTS% %GRADLE_OPTS% \"-Dorg.gradle.appname=%APP_BASE_NAME%\" -classpath \"%CLASSPATH%\" org.gradle.wrapper.GradleWrapperMain %CMD_LINE_ARGS%\r\n\r\n:end\r\n@rem End local scope for the variables with windows NT shell\r\nif \"%ERRORLEVEL%\"==\"0\" goto mainEnd\r\n\r\n:fail\r\nrem Set variable GRADLE_EXIT_CONSOLE if you need the _script_ return code instead of\r\nrem the _cmd.exe /c_ return code!\r\nif  not \"\" == \"%GRADLE_EXIT_CONSOLE%\" exit 1\r\nexit /b 1\r\n\r\n:mainEnd\r\nif \"%OS%\"==\"Windows_NT\" endlocal\r\n\r\n:omega\r\n"
        },
        {
          "name": "notice.html",
          "type": "blob",
          "size": 9.013671875,
          "content": "<?xml version=\"1.0\" encoding=\"ISO-8859-1\" ?>\n<!DOCTYPE html PUBLIC \"-//W3C//DTD XHTML 1.0 Strict//EN\" \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd\">\n<html xmlns=\"http://www.w3.org/1999/xhtml\">\n<head>\n<meta http-equiv=\"Content-Type\" content=\"text/html; charset=ISO-8859-1\" />\n<title>Eclipse Foundation Software User Agreement</title>\n</head>\n\n<body lang=\"EN-US\">\n<h2>Eclipse Foundation Software User Agreement</h2>\n<p>February 1, 2011</p>\n\n<h3>Usage Of Content</h3>\n\n<p>THE ECLIPSE FOUNDATION MAKES AVAILABLE SOFTWARE, DOCUMENTATION, INFORMATION AND/OR OTHER MATERIALS FOR OPEN SOURCE PROJECTS\n   (COLLECTIVELY &quot;CONTENT&quot;).  USE OF THE CONTENT IS GOVERNED BY THE TERMS AND CONDITIONS OF THIS AGREEMENT AND/OR THE TERMS AND\n   CONDITIONS OF LICENSE AGREEMENTS OR NOTICES INDICATED OR REFERENCED BELOW.  BY USING THE CONTENT, YOU AGREE THAT YOUR USE\n   OF THE CONTENT IS GOVERNED BY THIS AGREEMENT AND/OR THE TERMS AND CONDITIONS OF ANY APPLICABLE LICENSE AGREEMENTS OR\n   NOTICES INDICATED OR REFERENCED BELOW.  IF YOU DO NOT AGREE TO THE TERMS AND CONDITIONS OF THIS AGREEMENT AND THE TERMS AND\n   CONDITIONS OF ANY APPLICABLE LICENSE AGREEMENTS OR NOTICES INDICATED OR REFERENCED BELOW, THEN YOU MAY NOT USE THE CONTENT.</p>\n\n<h3>Applicable Licenses</h3>\n\n<p>Unless otherwise indicated, all Content made available by the Eclipse Foundation is provided to you under the terms and conditions of the Eclipse Public License Version 1.0\n   (&quot;EPL&quot;).  A copy of the EPL is provided with this Content and is also available at <a href=\"http://www.eclipse.org/legal/epl-v10.html\">http://www.eclipse.org/legal/epl-v10.html</a>.\n   For purposes of the EPL, &quot;Program&quot; will mean the Content.</p>\n\n<p>Content includes, but is not limited to, source code, object code, documentation and other files maintained in the Eclipse Foundation source code\n   repository (&quot;Repository&quot;) in software modules (&quot;Modules&quot;) and made available as downloadable archives (&quot;Downloads&quot;).</p>\n\n<ul>\n       <li>Content may be structured and packaged into modules to facilitate delivering, extending, and upgrading the Content.  Typical modules may include plug-ins (&quot;Plug-ins&quot;), plug-in fragments (&quot;Fragments&quot;), and features (&quot;Features&quot;).</li>\n       <li>Each Plug-in or Fragment may be packaged as a sub-directory or JAR (Java&trade; ARchive) in a directory named &quot;plugins&quot;.</li>\n       <li>A Feature is a bundle of one or more Plug-ins and/or Fragments and associated material.  Each Feature may be packaged as a sub-directory in a directory named &quot;features&quot;.  Within a Feature, files named &quot;feature.xml&quot; may contain a list of the names and version numbers of the Plug-ins\n      and/or Fragments associated with that Feature.</li>\n       <li>Features may also include other Features (&quot;Included Features&quot;). Within a Feature, files named &quot;feature.xml&quot; may contain a list of the names and version numbers of Included Features.</li>\n</ul>\n\n<p>The terms and conditions governing Plug-ins and Fragments should be contained in files named &quot;about.html&quot; (&quot;Abouts&quot;). The terms and conditions governing Features and\nIncluded Features should be contained in files named &quot;license.html&quot; (&quot;Feature Licenses&quot;).  Abouts and Feature Licenses may be located in any directory of a Download or Module\nincluding, but not limited to the following locations:</p>\n\n<ul>\n       <li>The top-level (root) directory</li>\n       <li>Plug-in and Fragment directories</li>\n       <li>Inside Plug-ins and Fragments packaged as JARs</li>\n       <li>Sub-directories of the directory named &quot;src&quot; of certain Plug-ins</li>\n       <li>Feature directories</li>\n</ul>\n\n<p>Note: if a Feature made available by the Eclipse Foundation is installed using the Provisioning Technology (as defined below), you must agree to a license (&quot;Feature Update License&quot;) during the\ninstallation process.  If the Feature contains Included Features, the Feature Update License should either provide you with the terms and conditions governing the Included Features or\ninform you where you can locate them.  Feature Update Licenses may be found in the &quot;license&quot; property of files named &quot;feature.properties&quot; found within a Feature.\nSuch Abouts, Feature Licenses, and Feature Update Licenses contain the terms and conditions (or references to such terms and conditions) that govern your use of the associated Content in\nthat directory.</p>\n\n<p>THE ABOUTS, FEATURE LICENSES, AND FEATURE UPDATE LICENSES MAY REFER TO THE EPL OR OTHER LICENSE AGREEMENTS, NOTICES OR TERMS AND CONDITIONS.  SOME OF THESE\nOTHER LICENSE AGREEMENTS MAY INCLUDE (BUT ARE NOT LIMITED TO):</p>\n\n<ul>\n       <li>Eclipse Distribution License Version 1.0 (available at <a href=\"http://www.eclipse.org/licenses/edl-v10.html\">http://www.eclipse.org/licenses/edl-v1.0.html</a>)</li>\n       <li>Common Public License Version 1.0 (available at <a href=\"http://www.eclipse.org/legal/cpl-v10.html\">http://www.eclipse.org/legal/cpl-v10.html</a>)</li>\n       <li>Apache Software License 1.1 (available at <a href=\"http://www.apache.org/licenses/LICENSE\">http://www.apache.org/licenses/LICENSE</a>)</li>\n       <li>Apache Software License 2.0 (available at <a href=\"http://www.apache.org/licenses/LICENSE-2.0\">http://www.apache.org/licenses/LICENSE-2.0</a>)</li>\n       <li>Metro Link Public License 1.00 (available at <a href=\"http://www.opengroup.org/openmotif/supporters/metrolink/license.html\">http://www.opengroup.org/openmotif/supporters/metrolink/license.html</a>)</li>\n       <li>Mozilla Public License Version 1.1 (available at <a href=\"http://www.mozilla.org/MPL/MPL-1.1.html\">http://www.mozilla.org/MPL/MPL-1.1.html</a>)</li>\n</ul>\n\n<p>IT IS YOUR OBLIGATION TO READ AND ACCEPT ALL SUCH TERMS AND CONDITIONS PRIOR TO USE OF THE CONTENT.  If no About, Feature License, or Feature Update License is provided, please\ncontact the Eclipse Foundation to determine what terms and conditions govern that particular Content.</p>\n\n\n<h3>Use of Provisioning Technology</h3>\n\n<p>The Eclipse Foundation makes available provisioning software, examples of which include, but are not limited to, p2 and the Eclipse\n   Update Manager (&quot;Provisioning Technology&quot;) for the purpose of allowing users to install software, documentation, information and/or\n   other materials (collectively &quot;Installable Software&quot;). This capability is provided with the intent of allowing such users to\n   install, extend and update Eclipse-based products. Information about packaging Installable Software is available at <a\n       href=\"http://eclipse.org/equinox/p2/repository_packaging.html\">http://eclipse.org/equinox/p2/repository_packaging.html</a>\n   (&quot;Specification&quot;).</p>\n\n<p>You may use Provisioning Technology to allow other parties to install Installable Software. You shall be responsible for enabling the\n   applicable license agreements relating to the Installable Software to be presented to, and accepted by, the users of the Provisioning Technology\n   in accordance with the Specification. By using Provisioning Technology in such a manner and making it available in accordance with the\n   Specification, you further acknowledge your agreement to, and the acquisition of all necessary rights to permit the following:</p>\n\n<ol>\n       <li>A series of actions may occur (&quot;Provisioning Process&quot;) in which a user may execute the Provisioning Technology\n       on a machine (&quot;Target Machine&quot;) with the intent of installing, extending or updating the functionality of an Eclipse-based\n       product.</li>\n       <li>During the Provisioning Process, the Provisioning Technology may cause third party Installable Software or a portion thereof to be\n       accessed and copied to the Target Machine.</li>\n       <li>Pursuant to the Specification, you will provide to the user the terms and conditions that govern the use of the Installable\n       Software (&quot;Installable Software Agreement&quot;) and such Installable Software Agreement shall be accessed from the Target\n       Machine in accordance with the Specification. Such Installable Software Agreement must inform the user of the terms and conditions that govern\n       the Installable Software and must solicit acceptance by the end user in the manner prescribed in such Installable Software Agreement. Upon such\n       indication of agreement by the user, the provisioning Technology will complete installation of the Installable Software.</li>\n</ol>\n\n<h3>Cryptography</h3>\n\n<p>Content may contain encryption software. The country in which you are currently may have restrictions on the import, possession, and use, and/or re-export to\n   another country, of encryption software. BEFORE using any encryption software, please check the country's laws, regulations and policies concerning the import,\n   possession, or use, and re-export of encryption software, to see if this is permitted.</p>\n\n<p><small>Java and all Java-based trademarks are trademarks of Oracle Corporation in the United States, other countries, or both.</small></p>\n</body>\n</html>\n"
        },
        {
          "name": "org.eclipse.paho.android.iml",
          "type": "blob",
          "size": 0.9326171875,
          "content": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<module external.linked.project.id=\"org.eclipse.paho.android\" external.linked.project.path=\"$MODULE_DIR$\" external.root.project.path=\"$MODULE_DIR$\" external.system.id=\"GRADLE\" external.system.module.group=\"\" external.system.module.version=\"unspecified\" type=\"JAVA_MODULE\" version=\"4\">\n  <component name=\"FacetManager\">\n    <facet type=\"java-gradle\" name=\"Java-Gradle\">\n      <configuration>\n        <option name=\"BUILD_FOLDER_PATH\" value=\"$MODULE_DIR$/build\" />\n        <option name=\"BUILDABLE\" value=\"false\" />\n      </configuration>\n    </facet>\n  </component>\n  <component name=\"NewModuleRootManager\" LANGUAGE_LEVEL=\"JDK_1_6\" inherit-compiler-output=\"true\">\n    <exclude-output />\n    <content url=\"file://$MODULE_DIR$\">\n      <excludeFolder url=\"file://$MODULE_DIR$/.gradle\" />\n    </content>\n    <orderEntry type=\"inheritedJdk\" />\n    <orderEntry type=\"sourceFolder\" forTests=\"false\" />\n  </component>\n</module>"
        },
        {
          "name": "org.eclipse.paho.android.sample",
          "type": "tree",
          "content": null
        },
        {
          "name": "org.eclipse.paho.android.service",
          "type": "tree",
          "content": null
        },
        {
          "name": "paho.mqtt.android.example",
          "type": "tree",
          "content": null
        },
        {
          "name": "pom.xml",
          "type": "blob",
          "size": 8.59375,
          "content": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<project xmlns=\"http://maven.apache.org/POM/4.0.0\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xsi:schemaLocation=\"http://maven.apache.org/POM/4.0.0 http://maven.apache.org/maven-v4_0_0.xsd\">\n    <modelVersion>4.0.0</modelVersion>\n    <groupId>org.eclipse.paho</groupId>\n    <artifactId>org.eclipse.paho.android.service</artifactId>\n    <packaging>pom</packaging>\n    <version>1.1.1</version>\n\n    <properties>\n        <project.build.sourceEncoding>UTF-8</project.build.sourceEncoding>\n        <build.level>${maven.build.timestamp}</build.level>\n    </properties>\n\n    <name>Eclipse Paho Android Service</name>\n    <url>http://www.eclipse.org/paho</url>\n    <description>\n        The Paho project provides scalable open-source implementations of open and standard messaging protocols aimed at new, existing, and emerging applications for Machine to Machine (M2M) and Internet of Things (IoT).\n    </description>\n\n    <organization>\n        <name>Eclipse Paho</name>\n        <url>http://www.eclipse.org/paho</url>\n    </organization>\n\n    <developers>\n        <developer>\n            <id>jsutton</id>\n            <name>James Sutton</name>\n            <email>james.sutton@uk.ibm.com</email>\n            <organization>IBM</organization>\n            <organizationUrl>http://www.ibm.com</organizationUrl>\n            <roles>\n                <role>Developer</role>\n            </roles>\n        </developer>\n    </developers>\n\n    <licenses>\n        <license>\n            <name>Eclipse Public License - Version 1.0</name>\n            <url>http://www.eclipse.org/org/documents/epl-v10.php</url>\n        </license>\n    </licenses>\n\n    <scm>\n        <url>https://github.com/eclipse/paho.mqtt.android.git</url>\n        <connection>scm:https://github.com/eclipse/paho.mqtt.android.git</connection>\n    </scm>\n\t\n    <distributionManagement>\n        <snapshotRepository>\n            <id>ossrh</id>\n            <url>https://oss.sonatype.org/content/repositories/snapshots</url>\n        </snapshotRepository>\n        <repository>\n            <id>ossrh</id>\n            <url>https://oss.sonatype.org/service/local/staging/deploy/maven2/</url>\n        </repository>\n    </distributionManagement>\n\n    <repositories>\n        <repository>\n            <id>repo.eclipse.org</id>\n            <name>Paho Repository - Releases</name>\n            <url>https://repo.eclipse.org/content/repositories/paho-releases/</url>\n        </repository>\n    </repositories>\n\n    <dependencies>\n        <dependency>\n            <groupId>org.eclipse.paho</groupId>\n            <artifactId>org.eclipse.paho.android.service</artifactId>\n            <version>1.1.1</version>\n        </dependency>\n    </dependencies>\n\n    <build>\n        <plugins>\n            <plugin>\n                <groupId>org.apache.maven.plugins</groupId>\n                <artifactId>maven-dependency-plugin</artifactId>\n                <version>3.0.0</version>\n                <executions>\n                    <execution>\n                        <id>jar</id>\n                        <phase>package</phase>\n                        <goals>\n                            <goal>copy-dependencies</goal>\n                        </goals>\n                        <configuration>\n                            <outputDirectory>${project.build.directory}/</outputDirectory>\n                            <type>jar</type>\n                            <overWriteReleases>true</overWriteReleases>\n                        </configuration>\n                    </execution>\n                    <execution>\n                        <id>sources</id>\n                        <phase>package</phase>\n                        <goals>\n                            <goal>copy-dependencies</goal>\n                        </goals>\n                        <configuration>\n                            <outputDirectory>${project.build.directory}/</outputDirectory>\n                            <copyPom>true</copyPom>\n                            <classifier>sources</classifier>\n                            <overWriteReleases>true</overWriteReleases>\n                        </configuration>\n                    </execution>\n                    <execution>\n                        <id>javadocs</id>\n                        <phase>package</phase>\n                        <goals>\n                            <goal>copy-dependencies</goal>\n                        </goals>\n                        <configuration>\n                            <outputDirectory>${project.build.directory}/</outputDirectory>\n                            <classifier>javadoc</classifier>\n                            <overWriteReleases>true</overWriteReleases>\n                        </configuration>\n                    </execution>\n                </executions>\n            </plugin>\n            <plugin>\n                <!--\n\t\t\t\t\tUse the Nexus Staging plugin as a full replacement for the standard\n\t\t\t\t\tMaven Deploy plugin.\n\t\t\t\t\tSee https://github.com/sonatype/nexus-maven-plugins/tree/master/staging/maven-plugin\n\t\t\t\t\twhy this makes sense :-)\n\t\t\t\t\tWe can control whether we want to deploy to the Eclipse repo or Maven Central\n\t\t\t\t\tby a combination of the version being a SNAPHOT or release version and property\n\t\t\t\t\tskipStaging=true/false.\n\t\t\t\t\tIn any case we can take advantage of the plugin's \"deferred deploy\" feature which\n\t\t\t\t\tmakes sure that all artifacts of a multi-module project are deployed as a whole\n\t\t\t\t\tat the end of the build process instead of deploying each module's artifacts\n\t\t\t\t\tindividually as part of building the module.\n\t\t\t\t -->\n                <groupId>org.sonatype.plugins</groupId>\n                <artifactId>nexus-staging-maven-plugin</artifactId>\n                <version>1.6.5</version>\n                <extensions>true</extensions>\n                <configuration>\n                    <serverId>ossrh</serverId>\n                    <nexusUrl>https://oss.sonatype.org/</nexusUrl>\n                    <autoReleaseAfterClose>false</autoReleaseAfterClose>\n                </configuration>\n            </plugin>\n            <plugin>\n                <groupId>org.codehaus.mojo</groupId>\n                <artifactId>build-helper-maven-plugin</artifactId>\n                <version>1.12</version>\n                <executions>\n                    <execution>\n                        <id>attach-artifacts</id>\n                        <phase>package</phase>\n                        <goals>\n                            <goal>attach-artifact</goal>\n                        </goals>\n                        <configuration>\n                            <artifacts>\n                                <artifact>\n                                    <file>target/org.eclipse.paho.android.service-1.1.1.jar</file>\n                                    <type>jar</type>\n                                </artifact>\n                                <artifact>\n                                    <file>target/org.eclipse.paho.android.service-1.1.1-sources.jar</file>\n                                    <type>jar</type>\n                                    <classifier>sources</classifier>\n                                </artifact>\n                                <artifact>\n                                    <file>target/org.eclipse.paho.android.service-1.1.1-javadoc.jar</file>\n                                    <type>jar</type>\n                                    <classifier>javadoc</classifier>\n                                </artifact>\n                            </artifacts>\n                        </configuration>\n                    </execution>\n                </executions>\n            </plugin>\n        </plugins>\n    </build>\n\n    <profiles>\n        <profile>\n            <!-- this profile generates GPG signatures -->\n            <id>create_gpg_signature</id>\n            <activation>\n                <activeByDefault>false</activeByDefault>\n                <property>\n                    <name>createGPGSignature</name>\n                </property>\n            </activation>\n            <build>\n                <plugins>\n                    <plugin>\n                        <groupId>org.apache.maven.plugins</groupId>\n                        <artifactId>maven-gpg-plugin</artifactId>\n                        <version>1.6</version>\n                        <executions>\n                            <execution>\n                                <id>sign-artifacts</id>\n                                <phase>verify</phase>\n                                <goals>\n                                    <goal>sign</goal>\n                                </goals>\n                            </execution>\n                        </executions>\n                    </plugin>\n                </plugins>\n            </build>\n        </profile>\n    </profiles>\n\n</project>\n"
        },
        {
          "name": "settings.gradle",
          "type": "blob",
          "size": 0.408203125,
          "content": "include ':org.eclipse.paho.android.service'\ninclude ':org.eclipse.paho.android.sample'\ninclude ':paho.mqtt.android.example'\n\nproject(':org.eclipse.paho.android.service').projectDir = new File('org.eclipse.paho.android.service')\nproject(':paho.mqtt.android.example').projectDir = new File('paho.mqtt.android.example')\nproject(':org.eclipse.paho.android.sample').projectDir = new File('org.eclipse.paho.android.sample')\n"
        },
        {
          "name": "waitForEmulator.sh",
          "type": "blob",
          "size": 0.2802734375,
          "content": "echo Android Home is: $ANDROID_HOME\necho Waiting for Emulator to Boot.\nwhile true; do\n  str=`$ANDROID_HOME/platform-tools/adb shell getprop init.svc.bootanim 2>&1`\n  echo -n .\n  if [[ $str =~ 'stopped' ]]; then\n    break\n  fi\n  sleep 5\ndone\necho Finished: $str\necho Emulator has booted.\n"
        }
      ]
    }
  ]
}