{
  "metadata": {
    "timestamp": 1736708115052,
    "page": 524,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjUzMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "infinilabs/analysis-pinyin",
      "stars": 2978,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.103515625,
          "content": "/data\n/work\n/logs\n/.idea\n/target\n.DS_Store\n*.iml\n/.project\n/.settings\n/.classpath\n/*.ipr\n/*.iws\n/*/target\n"
        },
        {
          "name": ".travis.yml",
          "type": "blob",
          "size": 0.1826171875,
          "content": "sudo: required\njdk:\n  - oraclejdk8\ninstall: true\nscript:\n  - sudo apt-get update && sudo apt-get install oracle-java8-installer\n  - java -version\nlanguage: java\nscript: mvn clean package\n"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 3.1396484375,
          "content": "# Contributor Covenant Code of Conduct\n\n## Our Pledge\n\nIn the interest of fostering an open and welcoming environment, we as contributors and maintainers pledge to making participation in our project and our community a harassment-free experience for everyone, regardless of age, body size, disability, ethnicity, gender identity and expression, level of experience, nationality, personal appearance, race, religion, or sexual identity and orientation.\n\n## Our Standards\n\nExamples of behavior that contributes to creating a positive environment include:\n\n* Using welcoming and inclusive language\n* Being respectful of differing viewpoints and experiences\n* Gracefully accepting constructive criticism\n* Focusing on what is best for the community\n* Showing empathy towards other community members\n\nExamples of unacceptable behavior by participants include:\n\n* The use of sexualized language or imagery and unwelcome sexual attention or advances\n* Trolling, insulting/derogatory comments, and personal or political attacks\n* Public or private harassment\n* Publishing others' private information, such as a physical or electronic address, without explicit permission\n* Other conduct which could reasonably be considered inappropriate in a professional setting\n\n## Our Responsibilities\n\nProject maintainers are responsible for clarifying the standards of acceptable behavior and are expected to take appropriate and fair corrective action in response to any instances of unacceptable behavior.\n\nProject maintainers have the right and responsibility to remove, edit, or reject comments, commits, code, wiki edits, issues, and other contributions that are not aligned to this Code of Conduct, or to ban temporarily or permanently any contributor for other behaviors that they deem inappropriate, threatening, offensive, or harmful.\n\n## Scope\n\nThis Code of Conduct applies both within project spaces and in public spaces when an individual is representing the project or its community. Examples of representing a project or community include using an official project e-mail address, posting via an official social media account, or acting as an appointed representative at an online or offline event. Representation of a project may be further defined and clarified by project maintainers.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be reported by contacting the project team at contact@infini.ltd. The project team will review and investigate all complaints, and will respond in a way that it deems appropriate to the circumstances. The project team is obligated to maintain confidentiality with regard to the reporter of an incident. Further details of specific enforcement policies may be posted separately.\n\nProject maintainers who do not follow or enforce the Code of Conduct in good faith may face temporary or permanent repercussions as determined by other members of the project's leadership.\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant][homepage], version 1.4, available at [http://contributor-covenant.org/version/1/4][version]\n\n[homepage]: http://contributor-covenant.org\n[version]: http://contributor-covenant.org/version/1/4/\n"
        },
        {
          "name": "LICENSE.txt",
          "type": "blob",
          "size": 11.0908203125,
          "content": "\n                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright [yyyy] [name of copyright owner]\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License."
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 10.7119140625,
          "content": "Pinyin Analysis for Elasticsearch and OpenSearch\n==================================\n\n![](./assets/banner.png)\n\nThis Pinyin Analysis plugin facilitates the conversion between Chinese characters and Pinyin. It supports major versions of Elasticsearch and OpenSearch. Maintained and supported with ❤️ by [INFINI Labs](https://infinilabs.com).\n\nThe plugin comprises an analyzer named `pinyin`, a tokenizer named `pinyin`, and a token filter named `pinyin`.\n\n# Optional Parameters\n\n- `keep_first_letter`: When enabled, retains only the first letter of each Chinese character. For example, `刘德华` becomes `ldh`. Default: true.\n\n- `keep_separate_first_letter`: When enabled, keeps the first letters of each Chinese character separately. For example, `刘德华` becomes `l`,`d`,`h`. Default: false. Note: This may increase query fuzziness due to term frequency.\n\n- `limit_first_letter_length`: Sets the maximum length of the first letter result. Default: 16.\n\n- `keep_full_pinyin`: When enabled, preserves the full Pinyin of each Chinese character. For example, `刘德华` becomes [`liu`,`de`,`hua`]. Default: true.\n\n- `keep_joined_full_pinyin`: When enabled, joins the full Pinyin of each Chinese character. For example, `刘德华` becomes [`liudehua`]. Default: false.\n\n- `keep_none_chinese`: Keeps non-Chinese letters or numbers in the result. Default: true.\n\n- `keep_none_chinese_together`: Keeps non-Chinese letters together. Default: true. For example, `DJ音乐家` becomes `DJ`,`yin`,`yue`,`jia`. When set to `false`, `DJ音乐家` becomes `D`,`J`,`yin`,`yue`,`jia`. Note: `keep_none_chinese` should be enabled first.\n\n- `keep_none_chinese_in_first_letter`: Keeps non-Chinese letters in the first letter. For example, `刘德华AT2016` becomes `ldhat2016`. Default: true.\n\n- `keep_none_chinese_in_joined_full_pinyin`: Keeps non-Chinese letters in joined full Pinyin. For example, `刘德华2016` becomes `liudehua2016`. Default: false.\n\n- `none_chinese_pinyin_tokenize`: Breaks non-Chinese letters into separate Pinyin terms if they are Pinyin. Default: true. For example, `liudehuaalibaba13zhuanghan` becomes `liu`,`de`,`hua`,`a`,`li`,`ba`,`ba`,`13`,`zhuang`,`han`. Note: `keep_none_chinese` and `keep_none_chinese_together` should be enabled first.\n\n- `keep_original`: When enabled, keeps the original input as well. Default: false.\n\n- `lowercase`: Lowercases non-Chinese letters. Default: true.\n\n- `trim_whitespace`: Default: true.\n\n- `remove_duplicated_term`: When enabled, removes duplicated terms to save index space. For example, `de的` becomes `de`. Default: false. Note: Position-related queries may be influenced.\n\n- `ignore_pinyin_offset`: After version 6.0, offsets are strictly constrained, and overlapped tokens are not allowed. With this parameter, overlapped tokens will be allowed by ignoring the offset. Please note, all position-related queries or highlights will become incorrect. You should use multi-fields and specify different settings for different query purposes. If you need offsets, please set it to false. Default: true.\n\n\n# How to Install\n\nYou can download the packaged plugins from here: `https://release.infinilabs.com/`, \n\nor you can use the `plugin` cli to install the plugin like this:\n\nFor Elasticsearch\n\n```\nbin/elasticsearch-plugin install https://get.infini.cloud/elasticsearch/analysis-pinyin/8.4.1\n```\n\nFor OpenSearch\n\n```\nbin/opensearch-plugin install https://get.infini.cloud/opensearch/analysis-pinyin/2.12.0\n```\n\n\nTips: replace your own version number related to your elasticsearch or opensearch.\n\n\n# Getting Started\n\n1.Create a index with custom pinyin analyzer\n<pre>\nPUT /medcl/ \n{\n    \"settings\" : {\n        \"analysis\" : {\n            \"analyzer\" : {\n                \"pinyin_analyzer\" : {\n                    \"tokenizer\" : \"my_pinyin\"\n                    }\n            },\n            \"tokenizer\" : {\n                \"my_pinyin\" : {\n                    \"type\" : \"pinyin\",\n                    \"keep_separate_first_letter\" : false,\n                    \"keep_full_pinyin\" : true,\n                    \"keep_original\" : true,\n                    \"limit_first_letter_length\" : 16,\n                    \"lowercase\" : true,\n                    \"remove_duplicated_term\" : true\n                }\n            }\n        }\n    }\n}\n</pre>\n\n2.Test Analyzer, analyzing a chinese name, such as 刘德华\n<pre>\nGET /medcl/_analyze\n{\n  \"text\": [\"刘德华\"],\n  \"analyzer\": \"pinyin_analyzer\"\n}</pre>\n<pre>\n{\n  \"tokens\" : [\n    {\n      \"token\" : \"liu\",\n      \"start_offset\" : 0,\n      \"end_offset\" : 1,\n      \"type\" : \"word\",\n      \"position\" : 0\n    },\n    {\n      \"token\" : \"de\",\n      \"start_offset\" : 1,\n      \"end_offset\" : 2,\n      \"type\" : \"word\",\n      \"position\" : 1\n    },\n    {\n      \"token\" : \"hua\",\n      \"start_offset\" : 2,\n      \"end_offset\" : 3,\n      \"type\" : \"word\",\n      \"position\" : 2\n    },\n    {\n      \"token\" : \"刘德华\",\n      \"start_offset\" : 0,\n      \"end_offset\" : 3,\n      \"type\" : \"word\",\n      \"position\" : 3\n    },\n    {\n      \"token\" : \"ldh\",\n      \"start_offset\" : 0,\n      \"end_offset\" : 3,\n      \"type\" : \"word\",\n      \"position\" : 4\n    }\n  ]\n}\n</pre>\n\n3.Create mapping\n<pre>\nPOST /medcl/_mapping \n{\n        \"properties\": {\n            \"name\": {\n                \"type\": \"keyword\",\n                \"fields\": {\n                    \"pinyin\": {\n                        \"type\": \"text\",\n                        \"store\": false,\n                        \"term_vector\": \"with_offsets\",\n                        \"analyzer\": \"pinyin_analyzer\",\n                        \"boost\": 10\n                    }\n                }\n            }\n        }\n    \n}\n</pre>\n\n4.Indexing\n<pre>\nPOST /medcl/_create/andy\n{\"name\":\"刘德华\"}\n</pre>\n\n5.Let's search\n\n<pre>\n\ncurl http://localhost:9200/medcl/_search?q=name:%E5%88%98%E5%BE%B7%E5%8D%8E\ncurl http://localhost:9200/medcl/_search?q=name.pinyin:%e5%88%98%e5%be%b7\ncurl http://localhost:9200/medcl/_search?q=name.pinyin:liu\ncurl http://localhost:9200/medcl/_search?q=name.pinyin:ldh\ncurl http://localhost:9200/medcl/_search?q=name.pinyin:de+hua\n\n</pre>\n\n6.Using Pinyin-TokenFilter\n<pre>\nPUT /medcl1/ \n{\n    \"settings\" : {\n        \"analysis\" : {\n            \"analyzer\" : {\n                \"user_name_analyzer\" : {\n                    \"tokenizer\" : \"whitespace\",\n                    \"filter\" : \"pinyin_first_letter_and_full_pinyin_filter\"\n                }\n            },\n            \"filter\" : {\n                \"pinyin_first_letter_and_full_pinyin_filter\" : {\n                    \"type\" : \"pinyin\",\n                    \"keep_first_letter\" : true,\n                    \"keep_full_pinyin\" : false,\n                    \"keep_none_chinese\" : true,\n                    \"keep_original\" : false,\n                    \"limit_first_letter_length\" : 16,\n                    \"lowercase\" : true,\n                    \"trim_whitespace\" : true,\n                    \"keep_none_chinese_in_first_letter\" : true\n                }\n            }\n        }\n    }\n}\n</pre>\n\nToken Test:刘德华 张学友 郭富城 黎明 四大天王\n<pre>\nGET /medcl1/_analyze\n{\n  \"text\": [\"刘德华 张学友 郭富城 黎明 四大天王\"],\n  \"analyzer\": \"user_name_analyzer\"\n}\n</pre>\n<pre>\n{\n  \"tokens\" : [\n    {\n      \"token\" : \"ldh\",\n      \"start_offset\" : 0,\n      \"end_offset\" : 3,\n      \"type\" : \"word\",\n      \"position\" : 0\n    },\n    {\n      \"token\" : \"zxy\",\n      \"start_offset\" : 4,\n      \"end_offset\" : 7,\n      \"type\" : \"word\",\n      \"position\" : 1\n    },\n    {\n      \"token\" : \"gfc\",\n      \"start_offset\" : 8,\n      \"end_offset\" : 11,\n      \"type\" : \"word\",\n      \"position\" : 2\n    },\n    {\n      \"token\" : \"lm\",\n      \"start_offset\" : 12,\n      \"end_offset\" : 14,\n      \"type\" : \"word\",\n      \"position\" : 3\n    },\n    {\n      \"token\" : \"sdtw\",\n      \"start_offset\" : 15,\n      \"end_offset\" : 19,\n      \"type\" : \"word\",\n      \"position\" : 4\n    }\n  ]\n}\n</pre>\n\n\n7.Used in phrase query\n\n- option 1\n\n<pre>\nPUT /medcl2/\n{\n    \"settings\" : {\n        \"analysis\" : {\n            \"analyzer\" : {\n                \"pinyin_analyzer\" : {\n                    \"tokenizer\" : \"my_pinyin\"\n                    }\n            },\n            \"tokenizer\" : {\n                \"my_pinyin\" : {\n                    \"type\" : \"pinyin\",\n                    \"keep_first_letter\":false,\n                    \"keep_separate_first_letter\" : false,\n                    \"keep_full_pinyin\" : true,\n                    \"keep_original\" : false,\n                    \"limit_first_letter_length\" : 16,\n                    \"lowercase\" : true\n                }\n            }\n        }\n    }\n}\nGET /medcl2/_search\n{\n  \"query\": {\"match_phrase\": {\n    \"name.pinyin\": \"刘德华\"\n  }}\n}\n\n</pre>\n\n- option 2\n\n<pre>\n \nPUT /medcl3/\n{\n   \"settings\" : {\n       \"analysis\" : {\n           \"analyzer\" : {\n               \"pinyin_analyzer\" : {\n                   \"tokenizer\" : \"my_pinyin\"\n                   }\n           },\n           \"tokenizer\" : {\n               \"my_pinyin\" : {\n                   \"type\" : \"pinyin\",\n                   \"keep_first_letter\":true,\n                   \"keep_separate_first_letter\" : true,\n                   \"keep_full_pinyin\" : true,\n                   \"keep_original\" : false,\n                   \"limit_first_letter_length\" : 16,\n                   \"lowercase\" : true\n               }\n           }\n       }\n   }\n}\n   \nPOST /medcl3/_mapping \n{\n  \"properties\": {\n      \"name\": {\n          \"type\": \"keyword\",\n          \"fields\": {\n              \"pinyin\": {\n                  \"type\": \"text\",\n                  \"store\": false,\n                  \"term_vector\": \"with_offsets\",\n                  \"analyzer\": \"pinyin_analyzer\",\n                  \"boost\": 10\n              }\n          }\n      }\n  }\n}\n  \n   \nGET /medcl3/_analyze\n{\n   \"text\": [\"刘德华\"],\n   \"analyzer\": \"pinyin_analyzer\"\n}\n \nPOST /medcl3/_create/andy\n{\"name\":\"刘德华\"}\n\nGET /medcl3/_search\n{\n \"query\": {\"match_phrase\": {\n   \"name.pinyin\": \"刘德h\"\n }}\n}\n\nGET /medcl3/_search\n{\n \"query\": {\"match_phrase\": {\n   \"name.pinyin\": \"刘dh\"\n }}\n}\n\nGET /medcl3/_search\n{\n \"query\": {\"match_phrase\": {\n   \"name.pinyin\": \"liudh\"\n }}\n}\n\nGET /medcl3/_search\n{\n \"query\": {\"match_phrase\": {\n   \"name.pinyin\": \"liudeh\"\n }}\n}\n\nGET /medcl3/_search\n{\n \"query\": {\"match_phrase\": {\n   \"name.pinyin\": \"liude华\"\n }}\n}\n\n</pre>\n\n8.That's all, have fun.\n\n\n# Community\n\nFell free to join the Discord server to discuss anything around this project: \n\n[https://discord.gg/4tKTMkkvVX](https://discord.gg/4tKTMkkvVX)\n\n# License\n\nCopyright ©️ INFINI Labs.\n\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\n\n    http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.\n"
        },
        {
          "name": "assets",
          "type": "tree",
          "content": null
        },
        {
          "name": "elasticsearch",
          "type": "tree",
          "content": null
        },
        {
          "name": "opensearch",
          "type": "tree",
          "content": null
        },
        {
          "name": "pinyin-core",
          "type": "tree",
          "content": null
        },
        {
          "name": "pom.xml",
          "type": "blob",
          "size": 9.685546875,
          "content": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\r\n<project xmlns=\"http://maven.apache.org/POM/4.0.0\"\r\n         xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\r\n         xsi:schemaLocation=\"http://maven.apache.org/POM/4.0.0 http://maven.apache.org/xsd/maven-4.0.0.xsd\">\r\n    <name>analysis-pinyin</name>\r\n    <modules>\r\n        <module>pinyin-core</module>\r\n        <module>elasticsearch</module>\r\n        <module>opensearch</module>\r\n    </modules>\r\n    <modelVersion>4.0.0</modelVersion>\r\n    <groupId>com.infinilabs</groupId>\r\n    <artifactId>analysis-pinyin</artifactId>\r\n    <version>1.0</version>\r\n    <packaging>pom</packaging>\r\n    <inceptionYear>2012</inceptionYear>\r\n\r\n    <properties>\r\n        <lucene.version>9.3.0</lucene.version>\r\n        \r\n        <opensearch.version>2.0.1</opensearch.version>\r\n        \r\n        <tests.rest.load_packaged>false</tests.rest.load_packaged>\r\n        <skip.unit.tests>true</skip.unit.tests>\r\n        <gpg.keyname>4E899B30</gpg.keyname>\r\n        <gpg.useagent>true</gpg.useagent>\r\n    </properties>\r\n\r\n    <licenses>\r\n        <license>\r\n            <name>The Apache Software License, Version 2.0</name>\r\n            <url>http://www.apache.org/licenses/LICENSE-2.0.txt</url>\r\n            <distribution>repo</distribution>\r\n        </license>\r\n    </licenses>\r\n\r\n    <developers>\r\n        <developer>\r\n            <name>INFINI Labs</name>\r\n            <email>hello@infini.ltd</email>\r\n            <organization>INFINI Labs</organization>\r\n            <organizationUrl>https://infinilabs.com</organizationUrl>\r\n        </developer>\r\n    </developers>\r\n\r\n    <scm>\r\n        <connection>scm:git:git@github.com:infinilabs/analysis-pinyin.git</connection>\r\n        <developerConnection>scm:git:git@github.com:infinilabs/analysis-pinyin.git\r\n        </developerConnection>\r\n        <url>http://github.com/infinilabs/analysis-pinyin</url>\r\n    </scm>\r\n\r\n    <parent>\r\n        <groupId>org.sonatype.oss</groupId>\r\n        <artifactId>oss-parent</artifactId>\r\n        <version>9</version>\r\n    </parent>\r\n\r\n    <distributionManagement>\r\n        <snapshotRepository>\r\n            <id>oss.sonatype.org</id>\r\n            <url>https://oss.sonatype.org/content/repositories/snapshots</url>\r\n        </snapshotRepository>\r\n        <repository>\r\n            <id>oss.sonatype.org</id>\r\n            <url>https://oss.sonatype.org/service/local/staging/deploy/maven2/</url>\r\n        </repository>\r\n    </distributionManagement>\r\n\r\n    <repositories>\r\n        <repository>\r\n            <id>oss.sonatype.org</id>\r\n            <name>OSS Sonatype</name>\r\n            <releases>\r\n                <enabled>true</enabled>\r\n            </releases>\r\n            <snapshots>\r\n                <enabled>true</enabled>\r\n            </snapshots>\r\n            <url>https://oss.sonatype.org/content/repositories/releases/</url>\r\n        </repository>\r\n    </repositories>\r\n\r\n    <dependencies>\r\n        <dependency>\r\n            <groupId>org.apache.logging.log4j</groupId>\r\n            <artifactId>log4j-api</artifactId>\r\n            <version>2.17.1</version>\r\n            <scope>provided</scope>\r\n        </dependency>\r\n\r\n\r\n        <dependency>\r\n            <groupId>org.hamcrest</groupId>\r\n            <artifactId>hamcrest-core</artifactId>\r\n            <version>1.3.RC2</version>\r\n            <scope>test</scope>\r\n        </dependency>\r\n\r\n        <dependency>\r\n            <groupId>org.hamcrest</groupId>\r\n            <artifactId>hamcrest-library</artifactId>\r\n            <version>1.3.RC2</version>\r\n            <scope>test</scope>\r\n        </dependency>\r\n\r\n        <dependency>\r\n            <groupId>org.powermock</groupId>\r\n            <artifactId>powermock-module-junit4</artifactId>\r\n            <version>1.6.2</version>\r\n            <scope>test</scope>\r\n        </dependency>\r\n\r\n        <dependency>\r\n            <groupId>org.powermock</groupId>\r\n            <artifactId>powermock-api-mockito</artifactId>\r\n            <version>1.6.2</version>\r\n            <scope>test</scope>\r\n        </dependency>\r\n\r\n        <dependency>\r\n            <groupId>nl.jqno.equalsverifier</groupId>\r\n            <artifactId>equalsverifier</artifactId>\r\n            <version>1.7.5</version>\r\n            <scope>test</scope>\r\n        </dependency>\r\n\r\n        <dependency>\r\n            <groupId>com.openpojo</groupId>\r\n            <artifactId>openpojo</artifactId>\r\n            <version>0.8.1</version>\r\n            <scope>test</scope>\r\n        </dependency>\r\n\r\n        <dependency>\r\n            <groupId>junit</groupId>\r\n            <artifactId>junit</artifactId>\r\n            <version>4.9</version>\r\n            <scope>test</scope>\r\n        </dependency>\r\n    </dependencies>\r\n\r\n    <build>\r\n        <plugins>\r\n            <plugin>\r\n                <groupId>org.apache.maven.plugins</groupId>\r\n                <artifactId>maven-compiler-plugin</artifactId>\r\n                <version>3.5.1</version>\r\n                <configuration>\r\n                    <source>${maven.compiler.target}</source>\r\n                    <target>${maven.compiler.target}</target>\r\n                </configuration>\r\n            </plugin>\r\n            <plugin>\r\n                <groupId>org.apache.maven.plugins</groupId>\r\n                <artifactId>maven-surefire-plugin</artifactId>\r\n                <version>2.19.1</version>\r\n            </plugin>\r\n            <plugin>\r\n                <groupId>org.apache.maven.plugins</groupId>\r\n                <artifactId>maven-source-plugin</artifactId>\r\n                <version>2.1.2</version>\r\n                <executions>\r\n                    <execution>\r\n                        <id>attach-sources</id>\r\n                        <goals>\r\n                            <goal>jar</goal>\r\n                        </goals>\r\n                    </execution>\r\n                </executions>\r\n            </plugin>\r\n        </plugins>\r\n    </build>\r\n\r\n    <profiles>\r\n        <profile>\r\n            <id>disable-java8-doclint</id>\r\n            <activation>\r\n                <jdk>[1.8,)</jdk>\r\n            </activation>\r\n            <properties>\r\n                <additionalparam>-Xdoclint:none</additionalparam>\r\n            </properties>\r\n        </profile>\r\n        <profile>\r\n            <id>release</id>\r\n            <build>\r\n                <plugins>\r\n                    <plugin>\r\n                        <groupId>org.sonatype.plugins</groupId>\r\n                        <artifactId>nexus-staging-maven-plugin</artifactId>\r\n                        <version>1.6.3</version>\r\n                        <extensions>true</extensions>\r\n                        <configuration>\r\n                            <serverId>oss</serverId>\r\n                            <nexusUrl>https://oss.sonatype.org/</nexusUrl>\r\n                            <autoReleaseAfterClose>true</autoReleaseAfterClose>\r\n                        </configuration>\r\n                    </plugin>\r\n                    <plugin>\r\n                        <groupId>org.apache.maven.plugins</groupId>\r\n                        <artifactId>maven-release-plugin</artifactId>\r\n                        <version>2.1</version>\r\n                        <configuration>\r\n                            <autoVersionSubmodules>true</autoVersionSubmodules>\r\n                            <useReleaseProfile>false</useReleaseProfile>\r\n                            <releaseProfiles>release</releaseProfiles>\r\n                            <goals>deploy</goals>\r\n                        </configuration>\r\n                    </plugin>\r\n                    <plugin>\r\n                        <groupId>org.apache.maven.plugins</groupId>\r\n                        <artifactId>maven-compiler-plugin</artifactId>\r\n                        <version>3.5.1</version>\r\n                        <configuration>\r\n                            <source>${maven.compiler.target}</source>\r\n                            <target>${maven.compiler.target}</target>\r\n                        </configuration>\r\n                    </plugin>\r\n                    <plugin>\r\n                        <groupId>org.apache.maven.plugins</groupId>\r\n                        <artifactId>maven-gpg-plugin</artifactId>\r\n                        <version>1.5</version>\r\n                        <executions>\r\n                            <execution>\r\n                                <id>sign-artifacts</id>\r\n                                <phase>verify</phase>\r\n                                <goals>\r\n                                    <goal>sign</goal>\r\n                                </goals>\r\n                            </execution>\r\n                        </executions>\r\n                    </plugin>\r\n                    <plugin>\r\n                        <groupId>org.apache.maven.plugins</groupId>\r\n                        <artifactId>maven-source-plugin</artifactId>\r\n                        <version>2.2.1</version>\r\n                        <executions>\r\n                            <execution>\r\n                                <id>attach-sources</id>\r\n                                <goals>\r\n                                    <goal>jar-no-fork</goal>\r\n                                </goals>\r\n                            </execution>\r\n                        </executions>\r\n                    </plugin>\r\n                    <plugin>\r\n                        <groupId>org.apache.maven.plugins</groupId>\r\n                        <artifactId>maven-javadoc-plugin</artifactId>\r\n                        <version>2.9</version>\r\n                        <executions>\r\n                            <execution>\r\n                                <id>attach-javadocs</id>\r\n                                <goals>\r\n                                    <goal>jar</goal>\r\n                                </goals>\r\n                            </execution>\r\n                        </executions>\r\n                    </plugin>\r\n                </plugins>\r\n            </build>\r\n        </profile>\r\n    </profiles>\r\n</project>\r\n"
        }
      ]
    }
  ]
}