{
  "metadata": {
    "timestamp": 1736708154709,
    "page": 596,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjYxMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "jprante/elasticsearch-jdbc",
      "stars": 2837,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.09765625,
          "content": "/data\n/work\n/logs\n/.idea\n/target\n.DS_Store\n*.iml\n/.settings\n/.classpath\n/.project\n*~\n/.gradle\n/build"
        },
        {
          "name": ".travis.yml",
          "type": "blob",
          "size": 0.0458984375,
          "content": "sudo: false\nlanguage: java\njdk:\n  - oraclejdk8\n"
        },
        {
          "name": "LICENSE.derby",
          "type": "blob",
          "size": 11.0908203125,
          "content": "\n                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright [yyyy] [name of copyright owner]\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License."
        },
        {
          "name": "LICENSE.h2",
          "type": "blob",
          "size": 27.8935546875,
          "content": "H2 is dual licensed and available under the MPL 2.0 (Mozilla Public License Version 2.0) or under the EPL 1.0 (Eclipse Public License). There is a license FAQ for both the MPL and the EPL.\n\nYou can use H2 for free.\nYou can integrate it into your applications (including in commercial applications) and distribute it.\nFiles containing only your code are not covered by this license (it is 'commercial friendly').\nModifications to the H2 source code must be published.\nYou don't need to provide the source code of H2 if you did not modify anything.\nIf you distribute a binary that includes H2, you need to add a disclaimer of liability - see the example below.\nHowever, nobody is allowed to rename H2, modify it a little, and sell it as a database engine without telling the customers it is in fact H2. This happened to HSQLDB: a company called 'bungisoft' copied HSQLDB, renamed it to 'RedBase', and tried to sell it, hiding the fact that it was in fact just HSQLDB. It seems 'bungisoft' does not exist any more, but you can use the Wayback Machine and visit old web pages of http://www.bungisoft.com.\n\nAbout porting the source code to another language (for example C# or C++): converted source code (even if done manually) stays under the same copyright and license as the original code. The copyright of the ported source code does not (automatically) go to the person who ported the code.\n\nIf you distribute a binary that includes H2, you need to add the license and a disclaimer of liability (as you should do for your own code). You should add a disclaimer for each open source library you use. For example, add a file 3rdparty_license.txt in the directory where the jar files are, and list all open source libraries, each one with its license and disclaimer. For H2, a simple solution is to copy the following text below. You may also include a copy of the complete license.\n\nThis software contains unmodified binary redistributions for\nH2 database engine (http://www.h2database.com/),\nwhich is dual licensed and available under the MPL 2.0\n(Mozilla Public License) or under the EPL 1.0 (Eclipse Public License).\nAn original copy of the license agreement can be found at:\nhttp://www.h2database.com/html/license.html\nMozilla Public License Version 2.0\n1. Definitions\n\n1.1. \"Contributor\" means each individual or legal entity that creates, contributes to the creation of, or owns Covered Software.\n\n1.2. \"Contributor Version\" means the combination of the Contributions of others (if any) used by a Contributor and that particular Contributor's Contribution.\n\n1.3. \"Contribution\" means Covered Software of a particular Contributor.\n\n1.4. \"Covered Software\" means Source Code Form to which the initial Contributor has attached the notice in Exhibit A, the Executable Form of such Source Code Form, and Modifications of such Source Code Form, in each case including portions thereof.\n\n1.5. \"Incompatible With Secondary Licenses\" means\n\na. that the initial Contributor has attached the notice described in Exhibit B to the Covered Software; or\n\nb. that the Covered Software was made available under the terms of version 1.1 or earlier of the License, but not also under the terms of a Secondary License.\n\n1.6. \"Executable Form\" means any form of the work other than Source Code Form.\n\n1.7. \"Larger Work\" means a work that combines Covered Software with other material, in a separate file or files, that is not Covered Software.\n\n1.8. \"License\" means this document.\n\n1.9. \"Licensable\" means having the right to grant, to the maximum extent possible, whether at the time of the initial grant or subsequently, any and all of the rights conveyed by this License.\n\n1.10. \"Modifications\" means any of the following:\n\na. any file in Source Code Form that results from an addition to, deletion from, or modification of the contents of Covered Software; or\n\nb. any new file in Source Code Form that contains any Covered Software.\n\n1.11. \"Patent Claims\" of a Contributor means any patent claim(s), including without limitation, method, process, and apparatus claims, in any patent Licensable by such Contributor that would be infringed, but for the grant of the License, by the making, using, selling, offering for sale, having made, import, or transfer of either its Contributions or its Contributor Version.\n\n1.12. \"Secondary License\" means either the GNU General Public License, Version 2.0, the GNU Lesser General Public License, Version 2.1, the GNU Affero General Public License, Version 3.0, or any later versions of those licenses.\n\n1.13. \"Source Code Form\" means the form of the work preferred for making modifications.\n\n1.14. \"You\" (or \"Your\") means an individual or a legal entity exercising rights under this License. For legal entities, \"You\" includes any entity that controls, is controlled by, or is under common control with You. For purposes of this definition, \"control\" means (a) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or (b) ownership of more than fifty percent (50%) of the outstanding shares or beneficial ownership of such entity.\n\n2. License Grants and Conditions\n\n2.1. Grants\nEach Contributor hereby grants You a world-wide, royalty-free, non-exclusive license:\n\nunder intellectual property rights (other than patent or trademark) Licensable by such Contributor to use, reproduce, make available, modify, display, perform, distribute, and otherwise exploit its Contributions, either on an unmodified basis, with Modifications, or as part of a Larger Work; and\n\nunder Patent Claims of such Contributor to make, use, sell, offer for sale, have made, import, and otherwise transfer either its Contributions or its Contributor Version.\n\n2.2. Effective Date\nThe licenses granted in Section 2.1 with respect to any Contribution become effective for each Contribution on the date the Contributor first distributes such Contribution.\n\n2.3. Limitations on Grant Scope\nThe licenses granted in this Section 2 are the only rights granted under this License. No additional rights or licenses will be implied from the distribution or licensing of Covered Software under this License. Notwithstanding Section 2.1(b) above, no patent license is granted by a Contributor:\n\nfor any code that a Contributor has removed from Covered Software; or\n\nfor infringements caused by: (i) Your and any other third party's modifications of Covered Software, or (ii) the combination of its Contributions with other software (except as part of its Contributor Version); or\n\nunder Patent Claims infringed by Covered Software in the absence of its Contributions.\n\nThis License does not grant any rights in the trademarks, service marks, or logos of any Contributor (except as may be necessary to comply with the notice requirements in Section 3.4).\n\n2.4. Subsequent Licenses\nNo Contributor makes additional grants as a result of Your choice to distribute the Covered Software under a subsequent version of this License (see Section 10.2) or under the terms of a Secondary License (if permitted under the terms of Section 3.3).\n\n2.5. Representation\nEach Contributor represents that the Contributor believes its Contributions are its original creation(s) or it has sufficient rights to grant the rights to its Contributions conveyed by this License.\n\n2.6. Fair Use\nThis License is not intended to limit any rights You have under applicable copyright doctrines of fair use, fair dealing, or other equivalents.\n\n2.7. Conditions\nSections 3.1, 3.2, 3.3, and 3.4 are conditions of the licenses granted in Section 2.1.\n\n3. Responsibilities\n\n3.1. Distribution of Source Form\nAll distribution of Covered Software in Source Code Form, including any Modifications that You create or to which You contribute, must be under the terms of this License. You must inform recipients that the Source Code Form of the Covered Software is governed by the terms of this License, and how they can obtain a copy of this License. You may not attempt to alter or restrict the recipients' rights in the Source Code Form.\n\n3.2. Distribution of Executable Form\nIf You distribute Covered Software in Executable Form then:\n\nsuch Covered Software must also be made available in Source Code Form, as described in Section 3.1, and You must inform recipients of the Executable Form how they can obtain a copy of such Source Code Form by reasonable means in a timely manner, at a charge no more than the cost of distribution to the recipient; and\n\nYou may distribute such Executable Form under the terms of this License, or sublicense it under different terms, provided that the license for the Executable Form does not attempt to limit or alter the recipients' rights in the Source Code Form under this License.\n\n3.3. Distribution of a Larger Work\nYou may create and distribute a Larger Work under terms of Your choice, provided that You also comply with the requirements of this License for the Covered Software. If the Larger Work is a combination of Covered Software with a work governed by one or more Secondary Licenses, and the Covered Software is not Incompatible With Secondary Licenses, this License permits You to additionally distribute such Covered Software under the terms of such Secondary License(s), so that the recipient of the Larger Work may, at their option, further distribute the Covered Software under the terms of either this License or such Secondary License(s).\n\n3.4. Notices\nYou may not remove or alter the substance of any license notices (including copyright notices, patent notices, disclaimers of warranty, or limitations of liability) contained within the Source Code Form of the Covered Software, except that You may alter any license notices to the extent required to remedy known factual inaccuracies.\n\n3.5. Application of Additional Terms\nYou may choose to offer, and to charge a fee for, warranty, support, indemnity or liability obligations to one or more recipients of Covered Software. However, You may do so only on Your own behalf, and not on behalf of any Contributor. You must make it absolutely clear that any such warranty, support, indemnity, or liability obligation is offered by You alone, and You hereby agree to indemnify every Contributor for any liability incurred by such Contributor as a result of warranty, support, indemnity or liability terms You offer. You may include additional disclaimers of warranty and limitations of liability specific to any jurisdiction.\n\n4. Inability to Comply Due to Statute or Regulation\n\nIf it is impossible for You to comply with any of the terms of this License with respect to some or all of the Covered Software due to statute, judicial order, or regulation then You must: (a) comply with the terms of this License to the maximum extent possible; and (b) describe the limitations and the code they affect. Such description must be placed in a text file included with all distributions of the Covered Software under this License. Except to the extent prohibited by statute or regulation, such description must be sufficiently detailed for a recipient of ordinary skill to be able to understand it.\n\n5. Termination\n\n5.1. The rights granted under this License will terminate automatically if You fail to comply with any of its terms. However, if You become compliant, then the rights granted under this License from a particular Contributor are reinstated (a) provisionally, unless and until such Contributor explicitly and finally terminates Your grants, and (b) on an ongoing basis, if such Contributor fails to notify You of the non-compliance by some reasonable means prior to 60 days after You have come back into compliance. Moreover, Your grants from a particular Contributor are reinstated on an ongoing basis if such Contributor notifies You of the non-compliance by some reasonable means, this is the first time You have received notice of non-compliance with this License from such Contributor, and You become compliant prior to 30 days after Your receipt of the notice.\n\n5.2. If You initiate litigation against any entity by asserting a patent infringement claim (excluding declaratory judgment actions, counter-claims, and cross-claims) alleging that a Contributor Version directly or indirectly infringes any patent, then the rights granted to You by any and all Contributors for the Covered Software under Section 2.1 of this License shall terminate.\n\n5.3. In the event of termination under Sections 5.1 or 5.2 above, all end user license agreements (excluding distributors and resellers) which have been validly granted by You or Your distributors under this License prior to termination shall survive termination.\n\n6. Disclaimer of Warranty\n\nCovered Software is provided under this License on an \"as is\" basis, without warranty of any kind, either expressed, implied, or statutory, including, without limitation, warranties that the Covered Software is free of defects, merchantable, fit for a particular purpose or non-infringing. The entire risk as to the quality and performance of the Covered Software is with You. Should any Covered Software prove defective in any respect, You (not any Contributor) assume the cost of any necessary servicing, repair, or correction. This disclaimer of warranty constitutes an essential part of this License. No use of any Covered Software is authorized under this License except under this disclaimer.\n\n7. Limitation of Liability\n\nUnder no circumstances and under no legal theory, whether tort (including negligence), contract, or otherwise, shall any Contributor, or anyone who distributes Covered Software as permitted above, be liable to You for any direct, indirect, special, incidental, or consequential damages of any character including, without limitation, damages for lost profits, loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses, even if such party shall have been informed of the possibility of such damages. This limitation of liability shall not apply to liability for death or personal injury resulting from such party's negligence to the extent applicable law prohibits such limitation. Some jurisdictions do not allow the exclusion or limitation of incidental or consequential damages, so this exclusion and limitation may not apply to You.\n\n8. Litigation\n\nAny litigation relating to this License may be brought only in the courts of a jurisdiction where the defendant maintains its principal place of business and such litigation shall be governed by laws of that jurisdiction, without reference to its conflict-of-law provisions. Nothing in this Section shall prevent a party's ability to bring cross-claims or counter-claims.\n\n9. Miscellaneous\n\nThis License represents the complete agreement concerning the subject matter hereof. If any provision of this License is held to be unenforceable, such provision shall be reformed only to the extent necessary to make it enforceable. Any law or regulation which provides that the language of a contract shall be construed against the drafter shall not be used to construe this License against a Contributor.\n\n10. Versions of the License\n\n10.1. New Versions\nMozilla Foundation is the license steward. Except as provided in Section 10.3, no one other than the license steward has the right to modify or publish new versions of this License. Each version will be given a distinguishing version number.\n\n10.2. Effect of New Versions\nYou may distribute the Covered Software under the terms of the version of the License under which You originally received the Covered Software, or under the terms of any subsequent version published by the license steward.\n\n10.3. Modified Versions\nIf you create software not governed by this License, and you want to create a new license for such software, you may create and use a modified version of this License if you rename the license and remove any references to the name of the license steward (except to note that such modified license differs from this License).\n\n10.4. Distributing Source Code Form that is Incompatible With Secondary Licenses\nIf You choose to distribute Source Code Form that is Incompatible With Secondary Licenses under the terms of this version of the License, the notice described in Exhibit B of this License must be attached.\n\nExhibit A - Source Code Form License Notice\n\nThis Source Code Form is subject to the terms of the Mozilla\nPublic License, v. 2.0. If a copy of the MPL was not distributed\nwith this file, you can obtain one at http://mozilla.org/MPL/2.0\nIf it is not possible or desirable to put the notice in a particular file, then You may include the notice in a location (such as a LICENSE file in a relevant directory) where a recipient would be likely to look for such a notice.\n\nYou may add additional accurate notices of copyright ownership.\n\nExhibit B - \"Incompatible With Secondary Licenses\" Notice\n\nThis Source Code Form is \"Incompatible With Secondary Licenses\",\nas defined by the Mozilla Public License, v. 2.0.\nEclipse Public License - Version 1.0\nTHE ACCOMPANYING PROGRAM IS PROVIDED UNDER THE TERMS OF THIS ECLIPSE PUBLIC LICENSE (\"AGREEMENT\"). ANY USE, REPRODUCTION OR DISTRIBUTION OF THE PROGRAM CONSTITUTES RECIPIENT'S ACCEPTANCE OF THIS AGREEMENT.\n\n1. DEFINITIONS\n\n\"Contribution\" means:\n\na) in the case of the initial Contributor, the initial code and documentation distributed under this Agreement, and\n\nb) in the case of each subsequent Contributor:\n\ni) changes to the Program, and\n\nii) additions to the Program;\n\nwhere such changes and/or additions to the Program originate from and are distributed by that particular Contributor. A Contribution 'originates' from a Contributor if it was added to the Program by such Contributor itself or anyone acting on such Contributor's behalf. Contributions do not include additions to the Program which: (i) are separate modules of software distributed in conjunction with the Program under their own license agreement, and (ii) are not derivative works of the Program.\n\n\"Contributor\" means any person or entity that distributes the Program.\n\n\"Licensed Patents \" mean patent claims licensable by a Contributor which are necessarily infringed by the use or sale of its Contribution alone or when combined with the Program.\n\n\"Program\" means the Contributions distributed in accordance with this Agreement.\n\n\"Recipient\" means anyone who receives the Program under this Agreement, including all Contributors.\n\n2. GRANT OF RIGHTS\n\na) Subject to the terms of this Agreement, each Contributor hereby grants Recipient a non-exclusive, worldwide, royalty-free copyright license to reproduce, prepare derivative works of, publicly display, publicly perform, distribute and sublicense the Contribution of such Contributor, if any, and such derivative works, in source code and object code form.\n\nb) Subject to the terms of this Agreement, each Contributor hereby grants Recipient a non-exclusive, worldwide, royalty-free patent license under Licensed Patents to make, use, sell, offer to sell, import and otherwise transfer the Contribution of such Contributor, if any, in source code and object code form. This patent license shall apply to the combination of the Contribution and the Program if, at the time the Contribution is added by the Contributor, such addition of the Contribution causes such combination to be covered by the Licensed Patents. The patent license shall not apply to any other combinations which include the Contribution. No hardware per se is licensed hereunder.\n\nc) Recipient understands that although each Contributor grants the licenses to its Contributions set forth herein, no assurances are provided by any Contributor that the Program does not infringe the patent or other intellectual property rights of any other entity. Each Contributor disclaims any liability to Recipient for claims brought by any other entity based on infringement of intellectual property rights or otherwise. As a condition to exercising the rights and licenses granted hereunder, each Recipient hereby assumes sole responsibility to secure any other intellectual property rights needed, if any. For example, if a third party patent license is required to allow Recipient to distribute the Program, it is Recipient's responsibility to acquire that license before distributing the Program.\n\nd) Each Contributor represents that to its knowledge it has sufficient copyright rights in its Contribution, if any, to grant the copyright license set forth in this Agreement.\n\n3. REQUIREMENTS\n\nA Contributor may choose to distribute the Program in object code form under its own license agreement, provided that:\n\na) it complies with the terms and conditions of this Agreement; and\n\nb) its license agreement:\n\ni) effectively disclaims on behalf of all Contributors all warranties and conditions, express and implied, including warranties or conditions of title and non-infringement, and implied warranties or conditions of merchantability and fitness for a particular purpose;\n\nii) effectively excludes on behalf of all Contributors all liability for damages, including direct, indirect, special, incidental and consequential damages, such as lost profits;\n\niii) states that any provisions which differ from this Agreement are offered by that Contributor alone and not by any other party; and\n\niv) states that source code for the Program is available from such Contributor, and informs licensees how to obtain it in a reasonable manner on or through a medium customarily used for software exchange.\n\nWhen the Program is made available in source code form:\n\na) it must be made available under this Agreement; and\n\nb) a copy of this Agreement must be included with each copy of the Program.\n\nContributors may not remove or alter any copyright notices contained within the Program.\n\nEach Contributor must identify itself as the originator of its Contribution, if any, in a manner that reasonably allows subsequent Recipients to identify the originator of the Contribution.\n\n4. COMMERCIAL DISTRIBUTION\n\nCommercial distributors of software may accept certain responsibilities with respect to end users, business partners and the like. While this license is intended to facilitate the commercial use of the Program, the Contributor who includes the Program in a commercial product offering should do so in a manner which does not create potential liability for other Contributors. Therefore, if a Contributor includes the Program in a commercial product offering, such Contributor (\"Commercial Contributor\") hereby agrees to defend and indemnify every other Contributor (\"Indemnified Contributor\") against any losses, damages and costs (collectively \"Losses\") arising from claims, lawsuits and other legal actions brought by a third party against the Indemnified Contributor to the extent caused by the acts or omissions of such Commercial Contributor in connection with its distribution of the Program in a commercial product offering. The obligations in this section do not apply to any claims or Losses relating to any actual or alleged intellectual property infringement. In order to qualify, an Indemnified Contributor must: a) promptly notify the Commercial Contributor in writing of such claim, and b) allow the Commercial Contributor to control, and cooperate with the Commercial Contributor in, the defense and any related settlement negotiations. The Indemnified Contributor may participate in any such claim at its own expense.\n\nFor example, a Contributor might include the Program in a commercial product offering, Product X. That Contributor is then a Commercial Contributor. If that Commercial Contributor then makes performance claims, or offers warranties related to Product X, those performance claims and warranties are such Commercial Contributor's responsibility alone. Under this section, the Commercial Contributor would have to defend claims against the other Contributors related to those performance claims and warranties, and if a court requires any other Contributor to pay any damages as a result, the Commercial Contributor must pay those damages.\n\n5. NO WARRANTY\n\nEXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, THE PROGRAM IS PROVIDED ON AN \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED INCLUDING, WITHOUT LIMITATION, ANY WARRANTIES OR CONDITIONS OF TITLE, NON-INFRINGEMENT, MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE. Each Recipient is solely responsible for determining the appropriateness of using and distributing the Program and assumes all risks associated with its exercise of rights under this Agreement, including but not limited to the risks and costs of program errors, compliance with applicable laws, damage to or loss of data, programs or equipment, and unavailability or interruption of operations.\n\n6. DISCLAIMER OF LIABILITY\n\nEXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, NEITHER RECIPIENT NOR ANY CONTRIBUTORS SHALL HAVE ANY LIABILITY FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING WITHOUT LIMITATION LOST PROFITS), HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OR DISTRIBUTION OF THE PROGRAM OR THE EXERCISE OF ANY RIGHTS GRANTED HEREUNDER, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n7. GENERAL\n\nIf any provision of this Agreement is invalid or unenforceable under applicable law, it shall not affect the validity or enforceability of the remainder of the terms of this Agreement, and without further action by the parties hereto, such provision shall be reformed to the minimum extent necessary to make such provision valid and enforceable.\n\nIf Recipient institutes patent litigation against any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the Program itself (excluding combinations of the Program with other software or hardware) infringes such Recipient's patent(s), then such Recipient's rights granted under Section 2(b) shall terminate as of the date such litigation is filed.\n\nAll Recipient's rights under this Agreement shall terminate if it fails to comply with any of the material terms or conditions of this Agreement and does not cure such failure in a reasonable period of time after becoming aware of such noncompliance. If all Recipient's rights under this Agreement terminate, Recipient agrees to cease use and distribution of the Program as soon as reasonably practicable. However, Recipient's obligations under this Agreement and any licenses granted by Recipient relating to the Program shall continue and survive.\n\nEveryone is permitted to copy and distribute copies of this Agreement, but in order to avoid inconsistency the Agreement is copyrighted and may only be modified in the following manner. The Agreement Steward reserves the right to publish new versions (including revisions) of this Agreement from time to time. No one other than the Agreement Steward has the right to modify this Agreement. The Eclipse Foundation is the initial Agreement Steward. The Eclipse Foundation may assign the responsibility to serve as the Agreement Steward to a suitable separate entity. Each new version of the Agreement will be given a distinguishing version number. The Program (including Contributions) may always be distributed subject to the version of the Agreement under which it was received. In addition, after a new version of the Agreement is published, Contributor may elect to distribute the Program (including its Contributions) under the new version. Except as expressly stated in Sections 2(a) and 2(b) above, Recipient receives no rights or licenses to the intellectual property of any Contributor under this Agreement, whether expressly, by implication, estoppel or otherwise. All rights in the Program not expressly granted under this Agreement are reserved.\n\nThis Agreement is governed by the laws of the State of New York and the intellectual property laws of the United States of America. No party to this Agreement will bring a legal action under this Agreement more than one year after the cause of action arose. Each party waives its rights to a jury trial in any resulting litigation.\n\nExport Control Classification Number (ECCN)\nAs far as we know, the U.S. Export Control Classification Number (ECCN) for this software is 5D002. However, for legal reasons, we can make no warranty that this information is correct. For details, see also the Apache Software Foundation Export Classifications page."
        },
        {
          "name": "LICENSE.hsqldb",
          "type": "blob",
          "size": 3.2138671875,
          "content": "COPYRIGHTS AND LICENSES (based on BSD License)\n\nFor work developed by the HSQL Development Group:\n\nCopyright (c) 2001-2010, The HSQL Development Group\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are met:\n\nRedistributions of source code must retain the above copyright notice, this\nlist of conditions and the following disclaimer.\n\nRedistributions in binary form must reproduce the above copyright notice,\nthis list of conditions and the following disclaimer in the documentation\nand/or other materials provided with the distribution.\n\nNeither the name of the HSQL Development Group nor the names of its\ncontributors may be used to endorse or promote products derived from this\nsoftware without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\nAND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\nARE DISCLAIMED. IN NO EVENT SHALL HSQL DEVELOPMENT GROUP, HSQLDB.ORG,\nOR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\nEXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,\nPROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\nLOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND\nON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n\nFor work originally developed by the Hypersonic SQL Group:\n\nCopyright (c) 1995-2000 by the Hypersonic SQL Group.\nAll rights reserved.\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are met:\n\nRedistributions of source code must retain the above copyright notice, this\nlist of conditions and the following disclaimer.\n\nRedistributions in binary form must reproduce the above copyright notice,\nthis list of conditions and the following disclaimer in the documentation\nand/or other materials provided with the distribution.\n\nNeither the name of the Hypersonic SQL Group nor the names of its\ncontributors may be used to endorse or promote products derived from this\nsoftware without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\nAND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\nARE DISCLAIMED. IN NO EVENT SHALL THE HYPERSONIC SQL GROUP,\nOR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\nEXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,\nPROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\nLOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND\nON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nThis software consists of voluntary contributions made by many individuals on behalf of the\nHypersonic SQL Group."
        },
        {
          "name": "LICENSE.mysql",
          "type": "blob",
          "size": 17.6669921875,
          "content": "                    GNU GENERAL PUBLIC LICENSE\n                       Version 2, June 1991\n\n Copyright (C) 1989, 1991 Free Software Foundation, Inc.,\n 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n                            Preamble\n\n  The licenses for most software are designed to take away your\nfreedom to share and change it.  By contrast, the GNU General Public\nLicense is intended to guarantee your freedom to share and change free\nsoftware--to make sure the software is free for all its users.  This\nGeneral Public License applies to most of the Free Software\nFoundation's software and to any other program whose authors commit to\nusing it.  (Some other Free Software Foundation software is covered by\nthe GNU Lesser General Public License instead.)  You can apply it to\nyour programs, too.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthis service if you wish), that you receive source code or can get it\nif you want it, that you can change the software or use pieces of it\nin new free programs; and that you know you can do these things.\n\n  To protect your rights, we need to make restrictions that forbid\nanyone to deny you these rights or to ask you to surrender the rights.\nThese restrictions translate to certain responsibilities for you if you\ndistribute copies of the software, or if you modify it.\n\n  For example, if you distribute copies of such a program, whether\ngratis or for a fee, you must give the recipients all the rights that\nyou have.  You must make sure that they, too, receive or can get the\nsource code.  And you must show them these terms so they know their\nrights.\n\n  We protect your rights with two steps: (1) copyright the software, and\n(2) offer you this license which gives you legal permission to copy,\ndistribute and/or modify the software.\n\n  Also, for each author's protection and ours, we want to make certain\nthat everyone understands that there is no warranty for this free\nsoftware.  If the software is modified by someone else and passed on, we\nwant its recipients to know that what they have is not the original, so\nthat any problems introduced by others will not reflect on the original\nauthors' reputations.\n\n  Finally, any free program is threatened constantly by software\npatents.  We wish to avoid the danger that redistributors of a free\nprogram will individually obtain patent licenses, in effect making the\nprogram proprietary.  To prevent this, we have made it clear that any\npatent must be licensed for everyone's free use or not licensed at all.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\n                    GNU GENERAL PUBLIC LICENSE\n   TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n\n  0. This License applies to any program or other work which contains\na notice placed by the copyright holder saying it may be distributed\nunder the terms of this General Public License.  The \"Program\", below,\nrefers to any such program or work, and a \"work based on the Program\"\nmeans either the Program or any derivative work under copyright law:\nthat is to say, a work containing the Program or a portion of it,\neither verbatim or with modifications and/or translated into another\nlanguage.  (Hereinafter, translation is included without limitation in\nthe term \"modification\".)  Each licensee is addressed as \"you\".\n\nActivities other than copying, distribution and modification are not\ncovered by this License; they are outside its scope.  The act of\nrunning the Program is not restricted, and the output from the Program\nis covered only if its contents constitute a work based on the\nProgram (independent of having been made by running the Program).\nWhether that is true depends on what the Program does.\n\n  1. You may copy and distribute verbatim copies of the Program's\nsource code as you receive it, in any medium, provided that you\nconspicuously and appropriately publish on each copy an appropriate\ncopyright notice and disclaimer of warranty; keep intact all the\nnotices that refer to this License and to the absence of any warranty;\nand give any other recipients of the Program a copy of this License\nalong with the Program.\n\nYou may charge a fee for the physical act of transferring a copy, and\nyou may at your option offer warranty protection in exchange for a fee.\n\n  2. You may modify your copy or copies of the Program or any portion\nof it, thus forming a work based on the Program, and copy and\ndistribute such modifications or work under the terms of Section 1\nabove, provided that you also meet all of these conditions:\n\n    a) You must cause the modified files to carry prominent notices\n    stating that you changed the files and the date of any change.\n\n    b) You must cause any work that you distribute or publish, that in\n    whole or in part contains or is derived from the Program or any\n    part thereof, to be licensed as a whole at no charge to all third\n    parties under the terms of this License.\n\n    c) If the modified program normally reads commands interactively\n    when run, you must cause it, when started running for such\n    interactive use in the most ordinary way, to print or display an\n    announcement including an appropriate copyright notice and a\n    notice that there is no warranty (or else, saying that you provide\n    a warranty) and that users may redistribute the program under\n    these conditions, and telling the user how to view a copy of this\n    License.  (Exception: if the Program itself is interactive but\n    does not normally print such an announcement, your work based on\n    the Program is not required to print an announcement.)\n\nThese requirements apply to the modified work as a whole.  If\nidentifiable sections of that work are not derived from the Program,\nand can be reasonably considered independent and separate works in\nthemselves, then this License, and its terms, do not apply to those\nsections when you distribute them as separate works.  But when you\ndistribute the same sections as part of a whole which is a work based\non the Program, the distribution of the whole must be on the terms of\nthis License, whose permissions for other licensees extend to the\nentire whole, and thus to each and every part regardless of who wrote it.\n\nThus, it is not the intent of this section to claim rights or contest\nyour rights to work written entirely by you; rather, the intent is to\nexercise the right to control the distribution of derivative or\ncollective works based on the Program.\n\nIn addition, mere aggregation of another work not based on the Program\nwith the Program (or with a work based on the Program) on a volume of\na storage or distribution medium does not bring the other work under\nthe scope of this License.\n\n  3. You may copy and distribute the Program (or a work based on it,\nunder Section 2) in object code or executable form under the terms of\nSections 1 and 2 above provided that you also do one of the following:\n\n    a) Accompany it with the complete corresponding machine-readable\n    source code, which must be distributed under the terms of Sections\n    1 and 2 above on a medium customarily used for software interchange; or,\n\n    b) Accompany it with a written offer, valid for at least three\n    years, to give any third party, for a charge no more than your\n    cost of physically performing source distribution, a complete\n    machine-readable copy of the corresponding source code, to be\n    distributed under the terms of Sections 1 and 2 above on a medium\n    customarily used for software interchange; or,\n\n    c) Accompany it with the information you received as to the offer\n    to distribute corresponding source code.  (This alternative is\n    allowed only for noncommercial distribution and only if you\n    received the program in object code or executable form with such\n    an offer, in accord with Subsection b above.)\n\nThe source code for a work means the preferred form of the work for\nmaking modifications to it.  For an executable work, complete source\ncode means all the source code for all modules it contains, plus any\nassociated interface definition files, plus the scripts used to\ncontrol compilation and installation of the executable.  However, as a\nspecial exception, the source code distributed need not include\nanything that is normally distributed (in either source or binary\nform) with the major components (compiler, kernel, and so on) of the\noperating system on which the executable runs, unless that component\nitself accompanies the executable.\n\nIf distribution of executable or object code is made by offering\naccess to copy from a designated place, then offering equivalent\naccess to copy the source code from the same place counts as\ndistribution of the source code, even though third parties are not\ncompelled to copy the source along with the object code.\n\n  4. You may not copy, modify, sublicense, or distribute the Program\nexcept as expressly provided under this License.  Any attempt\notherwise to copy, modify, sublicense or distribute the Program is\nvoid, and will automatically terminate your rights under this License.\nHowever, parties who have received copies, or rights, from you under\nthis License will not have their licenses terminated so long as such\nparties remain in full compliance.\n\n  5. You are not required to accept this License, since you have not\nsigned it.  However, nothing else grants you permission to modify or\ndistribute the Program or its derivative works.  These actions are\nprohibited by law if you do not accept this License.  Therefore, by\nmodifying or distributing the Program (or any work based on the\nProgram), you indicate your acceptance of this License to do so, and\nall its terms and conditions for copying, distributing or modifying\nthe Program or works based on it.\n\n  6. Each time you redistribute the Program (or any work based on the\nProgram), the recipient automatically receives a license from the\noriginal licensor to copy, distribute or modify the Program subject to\nthese terms and conditions.  You may not impose any further\nrestrictions on the recipients' exercise of the rights granted herein.\nYou are not responsible for enforcing compliance by third parties to\nthis License.\n\n  7. If, as a consequence of a court judgment or allegation of patent\ninfringement or for any other reason (not limited to patent issues),\nconditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot\ndistribute so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you\nmay not distribute the Program at all.  For example, if a patent\nlicense would not permit royalty-free redistribution of the Program by\nall those who receive copies directly or indirectly through you, then\nthe only way you could satisfy both it and this License would be to\nrefrain entirely from distribution of the Program.\n\nIf any portion of this section is held invalid or unenforceable under\nany particular circumstance, the balance of the section is intended to\napply and the section as a whole is intended to apply in other\ncircumstances.\n\nIt is not the purpose of this section to induce you to infringe any\npatents or other property right claims or to contest validity of any\nsuch claims; this section has the sole purpose of protecting the\nintegrity of the free software distribution system, which is\nimplemented by public license practices.  Many people have made\ngenerous contributions to the wide range of software distributed\nthrough that system in reliance on consistent application of that\nsystem; it is up to the author/donor to decide if he or she is willing\nto distribute software through any other system and a licensee cannot\nimpose that choice.\n\nThis section is intended to make thoroughly clear what is believed to\nbe a consequence of the rest of this License.\n\n  8. If the distribution and/or use of the Program is restricted in\ncertain countries either by patents or by copyrighted interfaces, the\noriginal copyright holder who places the Program under this License\nmay add an explicit geographical distribution limitation excluding\nthose countries, so that distribution is permitted only in or among\ncountries not thus excluded.  In such case, this License incorporates\nthe limitation as if written in the body of this License.\n\n  9. The Free Software Foundation may publish revised and/or new versions\nof the General Public License from time to time.  Such new versions will\nbe similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\nEach version is given a distinguishing version number.  If the Program\nspecifies a version number of this License which applies to it and \"any\nlater version\", you have the option of following the terms and conditions\neither of that version or of any later version published by the Free\nSoftware Foundation.  If the Program does not specify a version number of\nthis License, you may choose any version ever published by the Free Software\nFoundation.\n\n  10. If you wish to incorporate parts of the Program into other free\nprograms whose distribution conditions are different, write to the author\nto ask for permission.  For software which is copyrighted by the Free\nSoftware Foundation, write to the Free Software Foundation; we sometimes\nmake exceptions for this.  Our decision will be guided by the two goals\nof preserving the free status of all derivatives of our free software and\nof promoting the sharing and reuse of software generally.\n\n                            NO WARRANTY\n\n  11. BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY\nFOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.  EXCEPT WHEN\nOTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES\nPROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED\nOR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.  THE ENTIRE RISK AS\nTO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU.  SHOULD THE\nPROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING,\nREPAIR OR CORRECTION.\n\n  12. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR\nREDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,\nINCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING\nOUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED\nTO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY\nYOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER\nPROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGES.\n\n                     END OF TERMS AND CONDITIONS\n\n            How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nconvey the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the program's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This program is free software; you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation; either version 2 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License along\n    with this program; if not, write to the Free Software Foundation, Inc.,\n    51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.\n\nAlso add information on how to contact you by electronic and paper mail.\n\nIf the program is interactive, make it output a short notice like this\nwhen it starts in an interactive mode:\n\n    Gnomovision version 69, Copyright (C) year name of author\n    Gnomovision comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n    This is free software, and you are welcome to redistribute it\n    under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate\nparts of the General Public License.  Of course, the commands you use may\nbe called something other than `show w' and `show c'; they could even be\nmouse-clicks or menu items--whatever suits your program.\n\nYou should also get your employer (if you work as a programmer) or your\nschool, if any, to sign a \"copyright disclaimer\" for the program, if\nnecessary.  Here is a sample; alter the names:\n\n  Yoyodyne, Inc., hereby disclaims all copyright interest in the program\n  `Gnomovision' (which makes passes at compilers) written by James Hacker.\n\n  <signature of Ty Coon>, 1 April 1989\n  Ty Coon, President of Vice\n\nThis General Public License does not permit incorporating your program into\nproprietary programs.  If your program is a subroutine library, you may\nconsider it more useful to permit linking proprietary applications with the\nlibrary.  If this is what you want to do, use the GNU Lesser General\nPublic License instead of this License."
        },
        {
          "name": "LICENSE.postgresql",
          "type": "blob",
          "size": 1.8212890625,
          "content": "BSD License\nThe PostgreSQL JDBC driver is distributed under the BSD license, same as the server. The simplest explanation of the licensing terms is that you can do whatever you want with the product and source code as long as you don't claim you wrote it or sue us. You should give it a read though, it's only half a page.\n\nCopyright (c) 1997-2011, PostgreSQL Global Development Group\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are met:\n\n1. Redistributions of source code must retain the above copyright notice,\n   this list of conditions and the following disclaimer.\n2. Redistributions in binary form must reproduce the above copyright notice,\n   this list of conditions and the following disclaimer in the documentation\n   and/or other materials provided with the distribution.\n3. Neither the name of the PostgreSQL Global Development Group nor the names\n   of its contributors may be used to endorse or promote products derived\n   from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\nAND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\nARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE\nLIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\nCONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF\nSUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS\nINTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN\nCONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\nARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGE."
        },
        {
          "name": "LICENSE.txt",
          "type": "blob",
          "size": 11.091796875,
          "content": "\n                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright [yyyy] [name of copyright owner]\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 49.0654296875,
          "content": "![JDBC](https://github.com/jprante/elasticsearch-jdbc/raw/master/src/site/resources/database-128.png)\n\nImage by [icons8](http://www.iconsdb.com/icons8/?icon=database) Creative Commons Attribution-NoDerivs 3.0 Unported.\n\n# JDBC importer for Elasticsearch\n\n![Travis](https://api.travis-ci.org/jprante/elasticsearch-jdbc.png)\n\nThe Java Database Connection (JDBC) importer allows to fetch data from JDBC sources for\nindexing into [Elasticsearch](http://www.elasticsearch.org).\n\nThe JDBC importer was designed for tabular data. If you have tables with many joins, the JDBC importer\nis limited in the way to reconstruct deeply nested objects to JSON and process object semantics like object identity.\nThough it would be possible to extend the JDBC importer with a mapping feature where all the object properties\ncould be specified, the current solution is focused on rather simple tabular data streams.\n\nAssuming you have a table of name `orders` with a primary key in column `id`, \nyou can issue this from the command line\n\n    bin=$JDBC_IMPORTER_HOME/bin\n    lib=$JDBC_IMPORTER_HOME/lib\n    echo '{\n        \"type\" : \"jdbc\",\n        \"jdbc\" : {\n            \"url\" : \"jdbc:mysql://localhost:3306/test\",\n            \"user\" : \"\",\n            \"password\" : \"\",\n            \"sql\" : \"select *, id as _id from orders\"\n        }\n    }' | java \\\n           -cp \"${lib}/*\" \\\n           -Dlog4j.configurationFile=${bin}/log4j2.xml \\\n           org.xbib.tools.Runner \\\n           org.xbib.tools.JDBCImporter\n\nAnd that's it. Now you can check your Elasticsearch cluster for the index `jdbc` or your Elasticsearch logs\nabout what happened.\n\n## Compatiblity matrix\n\n| Release date | JDBC Importer version | Elasticsearch version |\n| -------------| ----------------------| ----------------------|\n| Aug 28 2016  | 2.3.4.1               | 2.3.4                 |\n| Aug  1 2016  | 2.3.4.0               | 2.3.4                 |\n| Jul  6 2016  | 2.3.3.1               | 2.3.3                 |\n| May 28 2016  | 2.3.3.0               | 2.3.3                 |\n| May 27 2016  | 2.3.2.0               | 2.3.2                 |\n| Apr  9 2016  | 2.3.1.0               | 2.3.1                 |\n| Apr  9 2016  | 2.2.1.0               | 2.2.1                 |\n| Feb  5 2016  | 2.2.0.0               | 2.2.0                 |\n| Dec 23 2015  | 2.1.1.2               | 2.1.1                 |\n| Nov 29 2015  | 2.1.0.0               | 2.1.0                 |\n| Oct 29 2015  | 2.0.0.1               | 2.0.0                 |\n| Oct 28 2015  | 2.0.0.0               | 2.0.0                 |\n| Oct 23 2015  | 1.7.3.0               | 1.7.3                 |\n| Sep 29 2015  | 1.7.2.1               | 1.7.2                 |\n| Jul 24 2015  | 1.7.0.1               | 1.7.0                 |\n| Jul 24 2015  | 1.6.0.1               | 1.6.0                 |\n| Jun    2015  | 1.5.2.0               | 1.5.2                 |\n\n## Quick links\n\nJDBC importer 2.3.4.0\n\n`http://xbib.org/repository/org/xbib/elasticsearch/importer/elasticsearch-jdbc/2.3.4.0/elasticsearch-jdbc-2.3.4.0-dist.zip`\n\n## Installation\n\n- in the following steps replace `<version>` by one of the versions above, e.g. `1.7.0.0`\n\n- download the JDBC importer distribution\n\n  `wget http://xbib.org/repository/org/xbib/elasticsearch/importer/elasticsearch-jdbc/<version>/elasticsearch-jdbc-<version>-dist.zip`\n\n- unpack     \n    `unzip elasticsearch-jdbc-<version>-dist.zip`\n\n- go to the unpacked directory (we call it $JDBC_IMPORTER_HOME)\n    `cd elasticsearch-jdbc-<version>`\n\n- if you do not find the JDBC driver jar in the `lib` directory, download it from your vendor's site \n    and put the driver jar into the `lib` folder\n\n- modify script in the `bin` directory to your needs (Elasticsearch cluster address) \n\n- run script with a command that starts `org.xbib.tools.JDBCImporter` with the `lib` directory on the classpath\n\n## Bundled drivers\n\nThe JDBC importer comes with open source JDBC drivers bundled for your convenience. \nThey are not part of the JDBC importer, hence, there is no support and no guarantee the bundled drivers will work.\nPlease read the JDBC driver license files attached in the distribution.\nJDBC importer does not link against the code of the drivers. If you do not want the drivers jars,\nthey can be safely removed or replaced by other JDBC drivers at your choice.\n\n## Project docs\n\nThe Maven project site is available at [Github](http://jprante.github.io/elasticsearch-jdbc)\n\n## Issues\n\nAll feedback is welcome! If you find issues, please post them at\n[Github](https://github.com/jprante/elasticsearch-jdbc/issues)\n\n# Contact\n\n[Follow me on twitter](https://twitter.com/xbib)\n\nYou find this software useful and want to honor me for my work? Please donate. \nDonations will also help to keep up the development of open source Elasticsearch add-ons.\n\n[![PayPal](https://www.paypalobjects.com/en_US/i/btn/btn_donateCC_LG.gif)](https://www.paypal.com/cgi-bin/webscr?cmd=_s-xclick&hosted_button_id=GVHFQYZ9WZ8HG)\n\n# Documentation\n\nThe relational data is internally transformed into structured JSON objects for the schema-less\nindexing model of Elasticsearch documents.\n\nThe importer can fetch data from RDBMS while multithreaded bulk mode ensures high throughput when \nindexing to Elasticsearch.\n\n## JDBC importer definition file\n\nThe general form of a JDBC import specification is a JSON object.\n\n\t{\n\t    \"type\" : \"jdbc\",\n\t    \"jdbc\" : {\n\t         <definition>\n\t    }\n\t}\n\t\nExample:\n\t\n\t{\n\t    \"type\" : \"jdbc\",\n\t    \"jdbc\" : {\n            \"url\" : \"jdbc:mysql://localhost:3306/test\",\n            \"user\" : \"\",\n            \"password\" : \"\",\n            \"sql\" : \"select * from orders\",\n            \"index\" : \"myindex\",\n            \"type\" : \"mytype\",\n            ...\t         \n\t    }\n\t}\n\nThe importer can either be executed via stdin (for example with echo)\n\n    bin=$JDBC_IMPORTER_HOME/bin\n    lib=$JDBC_IMPORTER_HOME/lib\n    echo '{\n      ...\n    }' | java \\\n\t\t-cp \"${lib}/*\" \\\n\t\t-Dlog4j.configurationFile=${bin}/log4j2.xml \\\n\t\torg.xbib.tools.Runner \\\n\t\torg.xbib.tools.JDBCImporter\n\nor with explicit file name parameter from command line. Here is an example\nwhere `statefile.json` is a file which is loaded before execution.\n\n\tjava \\\n\t\t-cp \"${lib}/*\" \\\n\t\t-Dlog4j.configurationFile=${bin}/log4j2.xml \\\n\t\torg.xbib.tools.Runner \\\n\t\torg.xbib.tools.JDBCImporter \\\n\t\tstatefile.json\n\nThis style is convenient for subsequent execution controlled by the `statefile` parameter\nif `statefile` is set to `statefile.json`.\n\n### Parameters\n\nHere is the list of parameters for the `jdbc` block in the definition.\n\n`strategy` - the strategy of the JDBC importer, currently implemented: `\"standard\"`, `\"column\"`\n\n`url` - the JDBC driver URL\n\n`user` - the JDBC database user\n\n`password` - the JDBC database password\n\n`sql`  - SQL statement(s), either a string or a list. If a statement ends with .sql, the statement is looked up in the file system. Example for a list of SQL statements:\n\n\t\"sql\" : [\n\t    {\n\t        \"statement\" : \"select ... from ... where a = ?, b = ?, c = ?\",\n\t        \"parameter\" : [ \"value for a\", \"value for b\", \"value for c\" ]\n\t    },\n\t    {\n\t        \"statement\" : \"insert into  ... where a = ?, b = ?, c = ?\",\n\t        \"parameter\" : [ \"value for a\", \"value for b\", \"value for c\" ],\n\t        \"write\" : \"true\"\n\t    },\n\t    {\n\t        \"statement\" : ...\n\t    }\n\t]\n\n`sql.statement` - the SQL statement\n\n`sql.write` - boolean flag, if true, the SQL statement is interpreted as an insert/update statement that needs write access (default: false).\n\n`sql.callable` - boolean flag, if true, the SQL statement is interpreted as a JDBC `CallableStatement` for stored procedures (default: false).\n\n`sql.parameter` - bind parameters for the SQL statement (in order). Some special values can be used with the following meanings:\n\n   * `$now` - the current timestamp\n   * `$state` - the state, one of: BEFORE_FETCH, FETCH, AFTER_FETCH, IDLE, EXCEPTION\n   * `$metrics.counter` - a counter\n   * `$lastrowcount` - number of rows from last statement\n   * `$lastexceptiondate` - SQL timestamp of last exception\n   * `$lastexception` - full stack trace of last exception\n   * `$metrics.lastexecutionstart` - SQL timestamp of the time when last execution started\n   * `$metrics.lastexecutionend` - SQL timestamp of the time when last execution ended\n   * `$metrics.totalrows` - total number of rows fetched\n   * `$metrics.totalbytes` - total number of bytes fetched\n   * `$metrics.failed` - total number of failed SQL executions\n   * `$metrics.succeeded` - total number of succeeded SQL executions\n   \n`locale` - the default locale (used for parsing numerical values, floating point character. Recommended values is \"en_US\")\n\n`timezone` - the timezone for JDBC setTimestamp() calls when binding parameters with timestamp values\n\n`rounding` -  rounding mode for parsing numeric values. Possible values  \"ceiling\", \"down\", \"floor\", \"halfdown\", \"halfeven\", \"halfup\", \"unnecessary\", \"up\"\n\n`scale` -  the precision of parsing numeric values\n\n`autocommit` - `true` if each statement should be automatically executed. Default is `false`\n\n`fetchsize` - the fetchsize for large result sets, most drivers use this to control the amount of rows in the buffer while iterating through the result set\n\n`max_rows` - limit the number of rows fetches by a statement, the rest of the rows is ignored\n\n`max_retries` - the number of retries to (re)connect to a database\n\n`max_retries_wait` - a time value for the time that should be waited between retries. Default is \"30s\"\n\n`resultset_type` - the JDBC result set type, can be TYPE_FORWARD_ONLY, TYPE_SCROLL_SENSITIVE, TYPE_SCROLL_INSENSITIVE. Default is TYPE_FORWARD_ONLY\n\n`resultset_concurrency` - the JDBC result set concurrency, can be CONCUR_READ_ONLY, CONCUR_UPDATABLE. Default is CONCUR_UPDATABLE\n\n`ignore_null_values` - if NULL values should be ignored when constructing JSON documents. Default is `false`\n\n`detect_geo` - if geo polygons / points in SQL columns should be parsed when constructing JSON documents. Default is `true`\n\n`detect_json` - if json structures in SQL columns should be parsed when constructing JSON documents. Default is `true`\n\n`prepare_database_metadata` - if the driver metadata should be prepared as parameters.  Default is `false`\n\n`prepare_resultset_metadata` - if the result set metadata should be prepared as parameters.  Default is `false`\n\n`column_name_map` - a map of aliases that should be used as a replacement for column names of the database. Useful for Oracle 30 char column name limit. Default is `null`\n\n`query_timeout` - a second value for how long an SQL statement is allowed to be executed before it is considered as lost. Default is `1800`\n\n`connection_properties` - a map for the connection properties for driver connection creation. Default is `null`\n\n`schedule` - a single or a list of cron expressions for scheduled execution. Syntax is equivalent to the\nQuartz cron expression format (see below for syntax)\n\n`threadpoolsize` - a thread pool size for the scheduled executions for `schedule` parameter. If set to `1`, all jobs will be executed serially. Default is `4`.\n\n`interval` - a time value for the delay between two runs (default: not set)\n\n`elasticsearch.cluster` - Elasticsearch cluster name\n\n`elasticsearch.host` - array of Elasticsearch host specifications (host name or `host:port`)\n\n`elasticsearch.port` -  port of Elasticsearch host\n\n`elasticsearch.autodiscover` - if `true`, JDBC importer will try to connect to all cluster nodes. Default is `false`\n\n`max_bulk_actions` - the length of each bulk index request submitted (default: 10000)\n\n`max_concurrent_bulk_requests` - the maximum number of concurrent bulk requests (default: 2 * number of CPU cores)\n\n`max_bulk_volume` - a byte size parameter for the maximum volume allowed for a bulk request (default: \"10m\")\n\n`max_request_wait` - a time value for the maximum wait time for a response of a bulk request (default: \"60s\")\n\n`flush_interval` - a time value for the interval period of flushing index docs to a bulk action (default: \"5s\")\n\n`index` - the Elasticsearch index used for indexing\n\n`type` - the Elasticsearch type of the index used for indexing\n\n`index_settings` - optional settings for the Elasticsearch index\n\n`type_mapping` - optional mapping for the Elasticsearch index type\n\n`statefile` - name of a file where the JDBC importer reads or writes state information \n\n`metrics.lastexecutionstart` - the UTC date/time of the begin of the last execution of a single fetch\n\n`metrics.lastexecutionend` - the UTC date/time of the end of the last execution of a single fetch\n\n`metrics.counter` - a counter for metrics, will be incremented after each single fetch\n\n`metrics.enabled` - if `true`, metrics logging is enabled. Default is `false`\n\n`metrics.interval` - the interval between metrics logging. Default is 30 seconds.\n\n`metrics.logger.plain` - if `true`, write metrics log messages in plain text format. Default is `false`\n\n`metrics.logger.json` - if `true`, write metric log messages in JSON format. Default is `false`\n\n## Overview about the default parameter settings\n\n\t{\n\t    \"jdbc\" : {\n\t\t\t\"strategy\" : \"standard\",\n\t        \"url\" : null,\n\t        \"user\" : null,\n\t        \"password\" : null,\n\t        \"sql\" : null,\n\t        \"locale\" : /* equivalent to Locale.getDefault().toLanguageTag() */,\n\t        \"timezone\" : /* equivalent to TimeZone.getDefault() */,\n\t        \"rounding\" : null,\n\t        \"scale\" : 2,\n\t        \"autocommit\" : false,\n\t        \"fetchsize\" : 10, /* if URL contains MySQL JDBC driver URL, this is Integer.MIN */\n\t        \"max_rows\" : 0,\n\t        \"max_retries\" : 3,\n\t        \"max_retries_wait\" : \"30s\",\n\t        \"resultset_type\" : \"TYPE_FORWARD_ONLY\",\n\t        \"resultset_concurreny\" : \"CONCUR_UPDATABLE\",\n\t        \"ignore_null_values\" : false,\n\t        \"prepare_database_metadata\" : false,\n\t        \"prepare_resultset_metadata\" : false,\n\t        \"column_name_map\" : null,\n\t        \"query_timeout\" : 1800,\n\t        \"connection_properties\" : null,\n\t\t\t\"schedule\" : null,\n\t\t\t\"interval\" : 0L,\n\t\t\t\"threadpoolsize\" : 1,\n\t        \"index\" : \"jdbc\",\n\t        \"type\" : \"jdbc\",\n\t        \"index_settings\" : null,\n\t        \"type_mapping\" : null,\n\t\t\t\"max_bulk_actions\" : 10000,\n\t\t\t\"max_concurrent_bulk_requests\" : 2 * available CPU cores,\n\t\t\t\"max_bulk_volume\" : \"10m\",\n\t\t\t\"max_request_wait\" : \"60s\",\n\t\t\t\"flush_interval\" : \"5s\"\n\t    }\n\t}\n\n## Time scheduled execution\n\nSetting a cron expression in the parameter `schedule` enables repeated (or time scheduled) runs.\n\nYou can also define a list of cron expressions (in a JSON array) to schedule for many\ndifferent time schedules.\n\nExample of a `schedule` parameter:\n\n        \"schedule\" : \"0 0-59 0-23 ? * *\"\n\nThis executes JDBC importer every minute, every hour, all the days in the week/month/year.\n\nThe following documentation about the syntax of the cron expression is copied from the Quartz \nscheduler javadoc page.\n\nCron expressions provide the ability to specify complex time combinations such as\n\"At 8:00am every Monday through Friday\" or \"At 1:30am every last Friday of the month\".\n\nCron expressions are comprised of 6 required fields and one optional field separated by\nwhite space. The fields respectively are described as follows:\n\n| Field Name      | Allowed Values      | Allowed Special Characters  |\n| --------------- | ------------------- | ----------------------------|\n| Seconds         | 0-59                | , - * / |\n| Minutes         | 0-59                | , - * / |\n| Hours           | 0-23                | , - * / |\n| Day-of-month    | 1-31                | , - * ? / L W |\n| Month           | 1-12 or JAN-DEC     | , - * / |\n| Day-of-Week     | 1-7 or SUN-SAT      | , - * ? / L # |\n| Year (Optional) | empty, 1970-2199    | , - * / |\n\nThe '*' character is used to specify all values. For example, \"*\" in the minute field means \"every minute\".\n\nThe '?' character is allowed for the day-of-month and day-of-week fields.\nIt is used to specify 'no specific value'.\nThis is useful when you need to specify something in one of the two fields, but not the other.\n\nThe '-' character is used to specify ranges For example \"10-12\" in the hour field means\n\"the hours 10, 11 and 12\".\n\nThe ',' character is used to specify additional values. For example \"MON,WED,FRI\" in the\nday-of-week field means \"the days Monday, Wednesday, and Friday\".\n\nThe '/' character is used to specify increments. For example \"0/15\" in the seconds field means\n\"the seconds 0, 15, 30, and 45\". And \"5/15\" in the seconds field means \"the seconds 5, 20, 35, and 50\".\nSpecifying '*' before the '/' is equivalent to specifying 0 is the value to start with.\nEssentially, for each field in the expression, there is a set of numbers that can be turned on or off.\nFor seconds and minutes, the numbers range from 0 to 59.\nFor hours 0 to 23, for days of the month 0 to 31, and for months 1 to 12.\nThe \"/\" character simply helps you turn on every \"nth\" value in the given set.\nThus \"7/6\" in the month field only turns on month \"7\", it does NOT mean every 6th month,\nplease note that subtlety.\n\nThe 'L' character is allowed for the day-of-month and day-of-week fields.\nThis character is short-hand for \"last\", but it has different meaning in each of the two fields.\nFor example, the value \"L\" in the day-of-month field means \"the last day of the month\" - day\n31 for January, day 28 for February on non-leap years. If used in the day-of-week field by itself,\nit simply means \"7\" or \"SAT\". But if used in the day-of-week field after another value,\nit means \"the last xxx day of the month\" - for example \"6L\" means \"the last friday of the month\".\nYou can also specify an offset from the last day of the month, such as \"L-3\" which would mean\nthe third-to-last day of the calendar month. When using the 'L' option, it is important not\nto specify lists, or ranges of values, as you'll get confusing/unexpected results.\n\nThe 'W' character is allowed for the day-of-month field. This character is used to specify\nthe weekday (Monday-Friday) nearest the given day. As an example, if you were to specify \"15W\"\nas the value for the day-of-month field, the meaning is: \"the nearest weekday to the 15th of the month\".\nSo if the 15th is a Saturday, the trigger will fire on Friday the 14th.\nIf the 15th is a Sunday, the trigger will fire on Monday the 16th.\nIf the 15th is a Tuesday, then it will fire on Tuesday the 15th.\nHowever if you specify \"1W\" as the value for day-of-month, and the 1st is a Saturday,\nthe trigger will fire on Monday the 3rd, as it will not 'jump' over the boundary of a month's days.\nThe 'W' character can only be specified when the day-of-month is a single day,\nnot a range or list of days.\n\nThe 'L' and 'W' characters can also be combined for the day-of-month expression to yield 'LW',\nwhich translates to \"last weekday of the month\".\n\nThe '#' character is allowed for the day-of-week field. This character is used to specify\n\"the nth\" XXX day of the month. For example, the value of \"6#3\" in the day-of-week field means\nthe third Friday of the month (day 6 = Friday and \"#3\" = the 3rd one in the month).\nOther examples: \"2#1\" = the first Monday of the month and \"4#5\" = the fifth Wednesday of the month.\nNote that if you specify \"#5\" and there is not 5 of the given day-of-week in the month,\nthen no firing will occur that month. If the '#' character is used, there can only be\none expression in the day-of-week field (\"3#1,6#3\" is not valid, since there are two expressions).\n\nThe legal characters and the names of months and days of the week are not case sensitive.\n\nNote: Support for specifying both a day-of-week and a day-of-month value is not complete\n(you'll need to use the '?' character in one of these fields).\nOverflowing ranges is supported - that is, having a larger number on the left hand side than the right.\nYou might do 22-2 to catch 10 o'clock at night until 2 o'clock in the morning, or you might have NOV-FEB.\nIt is very important to note that overuse of overflowing ranges creates ranges that don't make sense\nand no effort has been made to determine which interpretation CronExpression chooses.\nAn example would be \"0 0 14-6 ? * FRI-MON\".\n\n## Structured objects\n\nOne of the advantage of SQL queries is the join operation. From many tables, new tuples can be formed.\n\n\t{\n\t    \"type\" : \"jdbc\",\n\t    \"jdbc\" : {\n\t        \"url\" : \"jdbc:mysql://localhost:3306/test\",\n\t        \"user\" : \"\",\n\t        \"password\" : \"\",\n\t        \"sql\" : \"select \\\"relations\\\" as \\\"_index\\\", orders.customer as \\\"_id\\\", orders.customer as \\\"contact.customer\\\", employees.name as \\\"contact.employee\\\" from orders left join employees on employees.department = orders.department order by _id\"\n\t    }\n\t}\n\nFor example, these rows from SQL\n\n\tmysql> select \"relations\" as \"_index\", orders.customer as \"_id\", orders.customer as \"contact.customer\", employees.name as \"contact.employee\"  from orders left join employees on employees.department = orders.department order by _id;\n\t+-----------+-------+------------------+------------------+\n\t| _index    | _id   | contact.customer | contact.employee |\n\t+-----------+-------+------------------+------------------+\n\t| relations | Big   | Big              | Smith            |\n\t| relations | Large | Large            | Mller           |\n\t| relations | Large | Large            | Meier            |\n\t| relations | Large | Large            | Schulze          |\n\t| relations | Huge  | Huge             | Mller           |\n\t| relations | Huge  | Huge             | Meier            |\n\t| relations | Huge  | Huge             | Schulze          |\n\t| relations | Good  | Good             | Mller           |\n\t| relations | Good  | Good             | Meier            |\n\t| relations | Good  | Good             | Schulze          |\n\t| relations | Bad   | Bad              | Jones            |\n\t+-----------+-------+------------------+------------------+\n\t11 rows in set (0.00 sec)\n\nwill generate fewer JSON objects for the index `relations`.\n\n\tindex=relations id=Big {\"contact\":{\"employee\":\"Smith\",\"customer\":\"Big\"}}\n\tindex=relations id=Large {\"contact\":{\"employee\":[\"Mller\",\"Meier\",\"Schulze\"],\"customer\":\"Large\"}}\n\tindex=relations id=Huge {\"contact\":{\"employee\":[\"Mller\",\"Meier\",\"Schulze\"],\"customer\":\"Huge\"}}\n\tindex=relations id=Good {\"contact\":{\"employee\":[\"Mller\",\"Meier\",\"Schulze\"],\"customer\":\"Good\"}}\n\tindex=relations id=Bad {\"contact\":{\"employee\":\"Jones\",\"customer\":\"Bad\"}}\n\nNote how the `employee` column is collapsed into a JSON array. The repeated occurrence of the `_id` column\ncontrols how values are folded into arrays for making use of the Elasticsearch JSON data model. Make sure your SQL query is ordered by `_id`.\n\n\n## Column names for JSON document construction\n\nIn SQL, each column may be labeled. This label is used by the JDBC importer for JSON document\nconstruction. The dot is the path separator for the document strcuture.\n\nFor example\n\n\t{\n\t    \"type\" : \"jdbc\",\n\t    \"jdbc\" : {\n\t        \"url\" : \"jdbc:mysql://localhost:3306/test\",\n\t        \"user\" : \"\",\n\t        \"password\" : \"\",\n\t        \"sql\" : \"select products.name as \\\"product.name\\\", orders.customer as \\\"product.customer.name\\\", orders.quantity * products.price as \\\"product.customer.bill\\\" from products, orders where products.name = orders.product\"\n\t    }\n\t}\n\nthe labeled columns are `product.name`, `product.customer.name`, and `product.customer.bill`.\n\nA data example:\n\n\tmysql> select products.name as \"product.name\", orders.customer as \"product.customer\", orders.quantity * products.price as \"product.customer.bill\" from products, orders where products.name = orders.product ;\n\t+--------------+------------------+-----------------------+\n\t| product.name | product.customer | product.customer.bill |\n\t+--------------+------------------+-----------------------+\n\t| Apples       | Big              |                     1 |\n\t| Bananas      | Large            |                     2 |\n\t| Oranges      | Huge             |                     6 |\n\t| Apples       | Good             |                     2 |\n\t| Oranges      | Bad              |                     9 |\n\t+--------------+------------------+-----------------------+\n\t5 rows in set, 5 warnings (0.00 sec)\n\nThe structured objects constructed from these columns are\n\n\tid=0 {\"product\":{\"name\":\"Apples\",\"customer\":{\"bill\":1.0,\"name\":\"Big\"}}}\n\tid=1 {\"product\":{\"name\":\"Bananas\",\"customer\":{\"bill\":2.0,\"name\":\"Large\"}}}\n\tid=2 {\"product\":{\"name\":\"Oranges\",\"customer\":{\"bill\":6.0,\"name\":\"Huge\"}}}\n\tid=3 {\"product\":{\"name\":\"Apples\",\"customer\":{\"bill\":2.0,\"name\":\"Good\"}}}\n\tid=4 {\"product\":{\"name\":\"Oranges\",\"customer\":{\"bill\":9.0,\"name\":\"Bad\"}}}\n\nThere are column labels with an underscore as prefix that are mapped to special Elasticsearch document parameters for indexing:\n\n\t_index     the index this object should be indexed into\n\t_type      the type this object should be indexed into\n\t_id        the id of this object\n\t_version   the version of this object\n\t_parent    the parent of this object\n\t_ttl       the time-to-live of this object\n\t_routing   the routing of this object\n\nSee also\n\nhttp://www.elasticsearch.org/guide/reference/mapping/parent-field.html\n\nhttp://www.elasticsearch.org/guide/reference/mapping/ttl-field.html\n\nhttp://www.elasticsearch.org/guide/reference/mapping/routing-field.html\n\n\n## Bracket notation for JSON array construction\n\nWhen construction JSON documents, it is often the case you want to group SQL columns into a JSON object and\nline them up into JSON arrays. For allowing this, a bracket notation is used to identify children\nelements that repeat in each child.\n\nNote, because of limitations in identifying SQL column groups, nested document structures may lead to\nrepetitions of the same group. Fortunately, this is harmless to Elasticsearch queries.\n\nExample:\n\n| _id  | blog.name | blog.published      | blog.association[id] | blog.association[name] | blog.attachment[id]   | blog.attachment[name]    |\n| ---- | ----------| --------------------| -------------------- | ---------------------- | --------------------- | ------------------------ |\n| 4679 | Joe       | 2014-01-06 00:00:00 | 3917                 | John                   | 9450                  | /web/q/g/h/57436356.jpg  |\n| 4679 | Joe       | 2014-01-06 00:00:00 | 3917                 | John                   | 9965                  | /web/i/s/q/GS3193626.jpg |\n| 4679 | Joe       | 2014-01-06 00:00:00 | 3917                 | John                   | 9451                  | /web/i/s/q/GS3193626.jpg |\n\nResult:\n\n    {\n        \"blog\" : {\n            \"attachment\": [\n                {\n                    \"name\" : \"/web/q/g/h/57436356.jpg\",\n                    \"id\" : \"9450\"\n                },\n                {\n                    \"name\" : \"/web/i/s/q/GS3193626.jpg\",\n                    \"id\" : \"9965\"\n                },\n                {\n                    \"name\" : \"/web/i/s/q/GS3193626.jpg\",\n                    \"id\" : \"9451\"\n                }\n            ],\n            \"name\" : \"Joe\",\n            \"association\" : [\n                {\n                    \"name\" : \"John\",\n                    \"id\" : \"3917\"\n                },\n                {\n                    \"name\" : \"John\",\n                    \"id\" : \"3917\"\n                },\n                {\n                    \"name\" : \"John\",\n                    \"id\" : \"3917\"\n                }\n             ],\n             \"published\":\"2014-01-06 00:00:00\"\n         }\n    }\n\n## How to fetch a table?\n\nFor fetching a table, a \"select \\*\" (star) query can be used.\nStar queries are the simplest variant of selecting data from a database.\nThey dump tables into Elasticsearch row-by-row. If no `_id` column name is given, IDs will be automatically generated.\n\nFor example\n\n\t{\n\t    \"type\" : \"jdbc\",\n\t    \"jdbc\" : {\n\t        \"url\" : \"jdbc:mysql://localhost:3306/test\",\n\t        \"user\" : \"\",\n\t        \"password\" : \"\",\n\t        \"sql\" : \"select * from orders\"\n\t    }\n\t}\n\nand this table\n\n\tmysql> select * from orders;\n\t+----------+-----------------+---------+----------+---------------------+\n\t| customer | department      | product | quantity | created             |\n\t+----------+-----------------+---------+----------+---------------------+\n\t| Big      | American Fruits | Apples  |        1 | 0000-00-00 00:00:00 |\n\t| Large    | German Fruits   | Bananas |        1 | 0000-00-00 00:00:00 |\n\t| Huge     | German Fruits   | Oranges |        2 | 0000-00-00 00:00:00 |\n\t| Good     | German Fruits   | Apples  |        2 | 2012-06-01 00:00:00 |\n\t| Bad      | English Fruits  | Oranges |        3 | 2012-06-01 00:00:00 |\n\t+----------+-----------------+---------+----------+---------------------+\n\t5 rows in set (0.00 sec)\n\nwill result into the following JSON documents\n\n\tid=<random> {\"product\":\"Apples\",\"created\":null,\"department\":\"American Fruits\",\"quantity\":1,\"customer\":\"Big\"}\n\tid=<random> {\"product\":\"Bananas\",\"created\":null,\"department\":\"German Fruits\",\"quantity\":1,\"customer\":\"Large\"}\n\tid=<random> {\"product\":\"Oranges\",\"created\":null,\"department\":\"German Fruits\",\"quantity\":2,\"customer\":\"Huge\"}\n\tid=<random> {\"product\":\"Apples\",\"created\":1338501600000,\"department\":\"German Fruits\",\"quantity\":2,\"customer\":\"Good\"}\n\tid=<random> {\"product\":\"Oranges\",\"created\":1338501600000,\"department\":\"English Fruits\",\"quantity\":3,\"customer\":\"Bad\"}\n\n## How to update a table?\n\nThe JDBC importer allows to write data into the database for maintenance purpose. \n\nWriting back data into the database makes sense for acknowledging fetched data. \n\nExample:\n\n    {\n        \"type\" : \"jdbc\",\n        \"jdbc\" : {\n\t        \"url\" : \"jdbc:mysql://localhost:3306/test\",\n\t        \"user\" : \"\",\n\t        \"password\" : \"\",\n            \"sql\" : [\n                {\n                    \"statement\" : \"select * from \\\"products\\\"\"\n                },\n                {\n                    \"statement\" : \"delete from \\\"products\\\" where \\\"_job\\\" = ?\",\n                    \"parameter\" : [ \"$job\" ]\n                }\n            ],\n            \"index\" : \"my_jdbc_index\",\n            \"type\" : \"my_jdbc_type\"\n        }\n    }\n\nIn this example, the DB administrator has prepared product rows and attached a `_job` column to it\nto enumerate the product updates incrementally. The assertion is that Elasticsearch should \ndelete all products from the database after they are indexed successfully. The parameter `$job`\nis a counter. The importer state is saved in a file, so the counter is persisted.\n\n## How to select incremental data from a table?\n\nIt is recommended to use timestamps in UTC for synchronization. This example fetches\nall product rows which has added since the last run, using a millisecond resolution\ncolumn `mytimestamp`:\n\n    {\n        \"type\" : \"jdbc\",\n        \"jdbc\" : {\n\t        \"url\" : \"jdbc:mysql://localhost:3306/test\",\n            \"statefile\" : \"statefile.json\",\n\t        \"user\" : \"\",\n\t        \"password\" : \"\",\n            \"sql\" : [\n                {\n                    \"statement\" : \"select * from products where mytimestamp > ?\",\n                    \"parameter\" : [ \"$metrics.lastexecutionstart\" ]\n                }\n            ],\n            \"index\" : \"my_jdbc_index\",\n            \"type\" : \"my_jdbc_type\"\n        }\n    }\n\nthe first time you run the script, it will generate the statefile.json file like this\n```\n{\n  \"type\" : \"jdbc\",\n  \"jdbc\" : { \n    \"password\" : \"\",\n    \"index\" : \"my_jdbc_index\",\n    \"statefile\" : \"statefile.json\",\n    \"metrics\" : { \n      \"lastexecutionstart\" : \"2016-03-27T06:37:09.165Z\",\n      \"lastexecutionend\" : \"2016-03-27T06:37:09.501Z\",\n      \"counter\" : \"1\" \n    },  \n    \"type\" : \"my_jdbc_type\",\n    \"user\" : \"\",\n    \"url\" : \"jdbc:mysql://localhost:3306/test\",\n    \"sql\" : [ { \n      \"statement\" : \"select * from products where mytimestamp > ?\", \n      \"parameter\" : [ \"$metrics.lastexecutionstart\" ]\n    } ] \n  }\n}\n```\nafter this, you can select incremental data from table.\n\n## Stored procedures or callable statements\n\nStored procedures can also be used for fetchng data, like this example fo MySQL illustrates. \nSee also [Using Stored Procedures](http://docs.oracle.com/javase/tutorial/jdbc/basics/storedprocedures.html)\nfrom where the example is taken.\n\n    create procedure GET_SUPPLIER_OF_COFFEE(\n        IN coffeeName varchar(32), \n        OUT supplierName varchar(40)) \n        begin \n            select SUPPLIERS.SUP_NAME into supplierName \n            from SUPPLIERS, COFFEES \n            where SUPPLIERS.SUP_ID = COFFEES.SUP_ID \n            and coffeeName = COFFEES.COF_NAME; \n            select supplierName; \n        end\n\nNow it is possible to call the procedure from the JDBC importer and index the result in Elasticsearch.\n\n    {\n        \"jdbc\" : {\n            \"url\" : \"jdbc:mysql://localhost:3306/test\",\n            \"user\" : \"\",\n            \"password\" : \"\",\n            \"sql\" : [\n                {\n                    \"callable\" : true,\n                    \"statement\" : \"{call GET_SUPPLIER_OF_COFFEE(?,?)}\",\n                    \"parameter\" : [\n                         \"Colombian\"\n                    ],\n                    \"register\" : {\n                         \"mySupplierName\" : { \"pos\" : 2, \"type\" : \"varchar\" }\n                    }\n                }\n            ],\n            \"index\" : \"my_jdbc_index\",\n            \"type\" : \"my_jdbc_type\"\n        }\n    }\n\nNote, the `parameter` lists the input parameters in the order they should be applied, like in an\nordinary statement. The `register` declares a list of output parameters in the particular order\nthe `pos` number indicates. It is required to declare the JDBC type in the `type` attribute.\n`mySupplierName`, the key of the output parameter, is used as the Elasticsearch field name specification,\nlike the column name specification in an ordinary SQL statement, because column names are not available\nin callable statement result sets.\n\nIf there is more than one result sets returned by a callable statement,\nthe JDBC importer enters a loop and iterates through all result sets.\n\n# How to import from a CSV file?\n\nImporting from a CSV is easy because a CSV JDBC driver is included.\n\nTry something like this\n\n\t{\n\t\t\"type\" : \"jdbc\",\n\t\t\"jdbc\" : {\n\t\t\t\"driver\" : \"org.xbib.jdbc.csv.CsvDriver\",\n\t\t\t\"url\" : \"jdbc:xbib:csv:mydatadir?columnTypes=&separator=,\",\n\t\t\t\"user\" : \"\",\n\t\t\t\"password\" : \"\",\n\t\t\t\"sql\" : \"select * from mycsvfile\"\n\t\t}\n\t}\n\nwhere\n\n`mydatadir` - path to the directory where the CSV file exists\n\n`mycsvfile` - the name of the file\n\n`columnTypes` - column types will be inferred. Default is `String`, where column types will be all set to  string\n\n`separator` - the column separator\n\nFor a full list of the CSV JDBC driver options, see\nhttps://github.com/jprante/jdbc-driver-csv\n\n# Persisted state\n\nThe JDBC importer writes the state after each execution step into a state file which can be set by the\nparameter `statefile`, see above in the parameter documentation. Default setting is not writing \nto state file.\n\nExample:\n\n    \"sql\" : ...,\n    \"statefile\" : \"statefile.json\",\n    ...\n\nYou can use the `statefile` as input for a next JDBC importer invocation, once it is saved. \nThis is useful if you have to restart the JDBC importer. Because the statefile is written\nin prettified JSON, it is also possible to adjust the \nsettings in the statefile if you need to synchronize with the JDBC source.\n\nNote: there must be enough space on disk to write the state file. If disk is full,\nJDBC importer will write zero length files and give error messages in the importer log.\n\n# Monitoring the JDBC importer\n\nMetrics logging can be enabled to watch for the current transfer statistics. \n\nExample:\n\n    \"sql\" : ...,\n    \"schedule\" : ...,\n    \"statefile\" : \"statefile.json\",\n    \"metrics\" : {\n        \"enabled\" : true,\n        \"interval\" : \"1m\",\n        \"logger\" : {\n            \"plain\" : false,\n            \"json\" : true\n        }\n    }\n\nThis configuration enables metrics logging, sets the metrics logging interval to one minute,\nand switches form plain loggin to JSON logging.\n\nIn the `log4j2.xml` configuration file, you can set up how to log. The loggers used for metrics logging are\n\n`metrics.source.plain` - for plain format logging of the source\n\n`metrics.sink.plain` - for plain format logging of the sink\n\n`metrics.source.json` - for JSON format logging of the source\n\n`metrics.sink.json` - for JSON format logging of the sink\n\nSee also the parameter documentation above.\n\n# Developer notes\n\n## Source, Sink, Context\n\nThe JDBC importer consists of three conceptual interfaces than can be implemented separately.\n\nWhen you use the ``strategy`` parameter, the JDBC importer tries to load additional classes before\nfalling back to the ``standard`` strategy.\n\nYou can implement your own strategy by adding your implementation jars to the lib folder and\ndeclaring the implementing classes in the ``META-INF/services`` directory. \n\nSo, it is easy to reuse or replace existing code, or adapt your own JDBC retrieval strategy\nto the unmodified JDBC importer jar.\n\n### Source\n\nThe `Source` models the data producing side. Beside defining the JDBC connect parameters, \nit manages a dual-channel connection to the data producer for reading and for writing.\nThe reading channel is used for fetching data, while the writing channel can update the source.\n\nThe `Source` API can be inspected at \nhttp://jprante.github.io/elasticsearch-jdbc/apidocs/org/xbib/elasticsearch/jdbc/strategy/Source.html\n\n### Sink\n\nThe `Sink` is the abstraction of the destination where all the data is flowing from the source. \nIt controls the resource usage of the bulk indexing method of Elasticsearch. T\nhrottling is possible by limiting the number of bulk actions per request or by the \nmaximum number of concurrent request.\n\nThe `Sink` API can be inspected at \nhttp://jprante.github.io/elasticsearch-jdbc/apidocs/org/xbib/elasticsearch/jdbc/strategy/Sink.html\n\n### Context\n\nThe `Context` is the abstraction to the thread which performs data fetching from the source \nand transports it to the mouth. A 'move' is considered a single step in the execution cycle. \n\nThe `Context` API can be inspected at \nhttp://jprante.github.io/elasticsearch-jdbc/apidocs/org/xbib/elasticsearch/jdbc/strategy/Context.html\n\n## Strategies\n\nThe JDBC importer can be configured for different methods of data transport.\nSuch methods of data transports are called a 'strategy'.\n\nBy default, the JDBC importer implements a ``standard`` strategy.\n\n## Standard strategy\n\nThe standard strategy contains the following steps of processing:\n\n1. fetch data from the JDBC connection\n2. build structured objects and move them to Elasticsearch for indexing or deleting\n\nIn the ``sql`` parameter, a series of SQL statements can be defined which are executed to fetch the data.\n\n## Your custom strategy\n\nIf you want to extend the JDBC importer, for example by your custom password authentication, you could\nextend `org.xbib.elasticsearch.jdbc.strategy.standard.StandardSource`. \nThen, declare your strategy classes in `META-INF/services`. Add your\njar to the classpath and add the `strategy` parameter to the specifications.\n\n# Examples\n\n## PostgreSQL\n\n1. Install PostgreSQL\n\n   Example: PostgreSQL .dmg (Version 9.1.5) for Mac OS X from http://www.enterprisedb.com/products-services-training/pgdownload\n\n   Filename: postgresql-9.1.5-1-osx.dmg\n\n2. Install Elasticsearch\n\n   Follow instructions on https://www.elastic.co/products/elasticsearch\n\n3. Install JDBC importer\n\n    `wget http://xbib.org/repository/org/xbib/elasticsearch/importer/elasticsearch-jdbc/<version>/elasticsearch-jdbc-<version>-dist.zip`\n    \n   (update version respectively)\n\n4. Download PostgreSQL JDBC driver\n\n   Check http://jdbc.postgresql.org/download.html\n\n   Current version is JDBC4 Postgresql Driver, Version 9.1-902\n\n   Filname postgresql-9.1-902.jdbc4.jar\n\n5. Copy driver into lib folder\n\n\t    cp postgresql-9.1-902.jdbc4.jar $JDBC_IMPORTER_HOME/lib\n\n6. Start Elasticsearch\n\n7. Start JDBC importer\n\n   This is just a basic example to a database `test` with user `fred` and password `secret`.\n   Use the port configured during PostgreSQL installation. The default is `5432`.\n   ```\n   bin=$JDBC_IMPORTER_HOME/bin\n   lib=$JDBC_IMPORTER_HOME/lib\n   echo '{\n        \"type\" : \"jdbc\",\n        \"jdbc\" : {\n            \"url\" : \"jdbc:postgresql://localhost:5432/test\",\n            \"user\" : \"fred\",\n            \"password\" : \"secret\",\n            \"sql\" : \"select * from orders\",\n            \"index\" : \"myindex\",\n            \"type\" : \"mytype\"\n        }\n    }' | java \\\n           -cp \"${lib}/*\" \\\n           -Dlog4j.configurationFile=${bin}/log4j2.xml \\\n           org.xbib.tools.Runner \\\n           org.xbib.tools.JDBCImporter\n   ```\n\n8. Check log messages\n\n   In case the user does not exist, Elasticsearch will log a message.\n\n\n## MS SQL Server\n\n1. Download Elasticsearch\n\n2. Install Elasticsearch\n\n   Follow instructions on https://www.elastic.co/products/elasticsearch\n\n3. Install JDBC importer\n\n    `wget http://xbib.org/repository/org/xbib/elasticsearch/importer/elasticsearch-jdbc/<version>/elasticsearch-jdbc-<version>-dist.zip`\n    \n   (update version respectively)\n\n4. Download SQL Server JDBC driver from [the vendor](http://msdn.microsoft.com/en-us/sqlserver/aa937724.aspx)\n\n5. Copy driver into lib folder\n\n     cp SQLJDBC4.jar $JDBC_IMPORTER_HOME/lib\n\n6. Set up the database you want to be indexed.\n   [This includes allowing TCP/IP connections](http://stackoverflow.com/questions/2388042/connect-to-sql-server-2008-with-tcp-ip)\n\n7. Start Elasticsearch\n    ```\n    ./elasticsearch.bat\n    ```\n\n8. Start JDBC importer\n    ```\n    bin=$JDBC_IMPORTER_HOME/bin\n    lib=$JDBC_IMPORTER_HOME/lib\n    echo '{\n        \"type\" : \"jdbc\",\n        \"jdbc\": {\n            \"url\":\"jdbc:sqlserver://localhost:1433;databaseName=ICFV\",\n            \"user\":\"elasticsearch\",\n            \"password\":\"elasticsearch\",\n            \"sql\":\"select * from ScoreCards\",\n            \"index\" : \"myindex\",\n            \"type\" : \"mytype\"\n        }\n    }' | java \\\n           -cp \"${lib}/*\" \\\n           -Dlog4j.configurationFile=${bin}/log4j2.xml \\\n           org.xbib.tools.Runner \\\n           org.xbib.tools.JDBCImporter\n    ```\n\n8. You should see messages from the importer in the logfile.\n\n## Index simple geo coordinates from MySQL in Elasticsearch\n\n1. install MySQL e.g. in /usr/local/mysql\n\n2. start MySQL on localhost:3306 (default)\n\n3. prepare a 'test' database in MySQL\n\n4. create empty user '' with empty password '' (this user should exist as default user, otherwise set up a password and adapt the example)\n\n5. execute SQL in \"geo.dump\" /usr/local/mysql/bin/mysql test < src/test/resources/geo.dump\n\n6. then run this script\n   ```\n   curl -XDELETE 'localhost:9200/myjdbc'\n   bin=$JDBC_IMPORTER_HOME/bin\n   lib=$JDBC_IMPORTER_HOME/lib\n   echo '\n   {\n        \"type\" : \"jdbc\",\n        \"jdbc\" : {\n            \"url\" : \"jdbc:mysql://localhost:3306/test\",\n            \"user\" : \"\",\n            \"password\" : \"\",\n            \"locale\" : \"en_US\",\n            \"sql\" : [\n                {\n                    \"statement\" : \"select \\\"myjdbc\\\" as _index, \\\"mytype\\\" as _type, name as _id, city, zip, address, lat as \\\"location.lat\\\", lon as \\\"location.lon\\\" from geo\"\n                }\n            ],\n            \"index\" : \"myjdbc\",\n            \"type\" : \"mytype\",\n            \"index_settings\" : {\n                \"index\" : {\n                    \"number_of_shards\" : 1\n                }\n            },\n            \"type_mapping\": {\n                \"mytype\" : {\n                    \"properties\" : {\n                        \"location\" : {\n                            \"type\" : \"geo_point\"\n                        }\n                    }\n                }\n            }\n        }\n   }'  | java \\\n                  -cp \"${lib}/*\" \\\n                  -Dlog4j.configurationFile=${bin}/log4j2.xml \\\n                  org.xbib.tools.Runner \\\n                  org.xbib.tools.JDBCImporter\n   echo \"sleeping while importer should run...\"\n   sleep 10\n   curl -XGET 'localhost:9200/myjdbc/_refresh'\n   curl -XPOST 'localhost:9200/myjdbc/_search?pretty' -d '\n   {\n      \"query\": {\n         \"filtered\": {\n           \"query\": {\n              \"match_all\": {\n               }\n           },\n           \"filter\": {\n               \"geo_distance\" : {\n                   \"distance\" : \"20km\",\n                   \"location\" : {\n                        \"lat\" : 51.0,\n                        \"lon\" : 7.0\n                    }\n                }\n            }\n         }\n       }\n   }'\n   ```\n   \n## Index simple geo coordinates from Postgres/PostGIS geometry field in Elasticsearch\n\n1. install Postgres and PostGIS\n\n2. start Postgres on localhost:5432 (default)\n\n3. prepare a 'test' database in Postgres, connect to the database using psql and create the PostGIS extension `CREATE EXTENSION POSTGIS`\n\n4. create user 'test' with password 'test', quit psql\n\n5. import geo table (includes geom field of type geometry) from \"geo.sql\" psql -U test -d test < src/test/resources/geo.sql\n\n6. then run this script. IMPORTANT: note the use of explicit rounding and scale parameter, by default PostGIS will output floats, these will cause you problems in your geom_point in Elasticsearch unless you use specific casts, you have been warned!\n   ```\n   curl -XDELETE 'localhost:9200/myjdbc'\n   bin=$JDBC_IMPORTER_HOME/bin\n   lib=$JDBC_IMPORTER_HOME/lib\n   echo '\n   {\n        \"type\" : \"jdbc\",\n        \"jdbc\" : {\n            \"url\" : \"jdbc:postgres://localhost:5432/test\",\n            \"user\" : \"test\",\n            \"password\" : \"test\",\n            \"locale\" : \"en_GB\",\n            \"sql\" : \"select geonameid as _id, name, admin1_code, admin2_code, admin3_code, round(ST_Y(geom)::numeric,8) as \\\"location.lat\\\", round(ST_X(geom)::numeric,8) as \\\"location.lon\\\" from geo\",\n            \"index\" : \"myjdbc\",\n            \"type\" : \"mytype\",\n            \"scale\" : 8,\n            \"index_settings\" : {\n                \"index\" : {\n                    \"number_of_shards\" : 1\n                }\n            },\n            \"type_mapping\": {\n                \"mytype\" : {\n                    \"properties\" : {\n                        \"location\" : {\n                            \"type\" : \"geo_point\"\n                        }\n                    }\n                }\n            }\n        }\n   }'  | java \\\n                  -cp \"${lib}/*\" \\\n                  -Dlog4j.configurationFile=${bin}/log4j2.xml \\\n                  org.xbib.tools.Runner \\\n                  org.xbib.tools.JDBCImporter\n   echo \"sleeping while importer should run...\"\n   sleep 10\n   curl -XGET 'localhost:9200/myjdbc/_refresh'\n   curl -XPOST 'localhost:9200/myjdbc/_search?pretty' -d '\n   {\n      \"query\": {\n         \"filtered\": {\n           \"query\": {\n              \"match_all\": {\n               }\n           },\n           \"filter\": {\n               \"geo_distance\" : {\n                   \"distance\" : \"20km\",\n                   \"location\" : {\n                        \"lat\" : 51.477347,\n                        \"lon\" : -0.000850\n                    }\n                }\n            }\n         }\n       }\n   }'\n   ```\n\n\n## Geo shapes\n\nThe JDBC importer understands WKT http://en.wikipedia.org/wiki/Well-known_text \n\"POINT\" and \"POLYGON\" formats and converts them to GeoJSON.\n\nWith MySQL, the `astext` function can format WKT from columns of type `geometry`.\n\nExample:\n\t\n\tmysql -u root test <<EOT\n\tdrop table if exists test.geom;\n\tcreate table test.geom (\n\t\tid integer,\n\t\tg geometry\n\t);\n\tset @g = 'POLYGON((0 0,10 0,10 10,0 10,0 0),(5 5,7 5,7 7,5 7, 5 5))';\n\tinsert into test.geom values (0, GeomFromText(@g));\n\tEOT\n\t\n\tcurl -XDELETE 'localhost:9200/myjdbc'\n\techo '\n\t{\n\t\t\"type\" : \"jdbc\",\n\t\t\"jdbc\" : {\n\t\t\t\"url\" : \"jdbc:mysql://localhost:3306/test\",\n\t\t\t\"user\" : \"\",\n\t\t\t\"password\" : \"\",\n\t\t\t\"locale\" : \"en_US\",\n\t\t\t\"sql\" : \"select \\\"myjdbc\\\" as _index, \\\"mytype\\\" as _type, id as _id, astext(g) as polygon from geom\",\n\t\t\t\"elasticsearch\" : {\n\t\t\t\t \"cluster\" : \"elasticsearch\",\n\t\t\t\t \"host\" : \"localhost\",\n\t\t\t\t \"port\" : 9300\n\t\t\t},\n\t\t\t\"index\" : \"myjdbc\",\n\t\t\t\"type\" : \"mytype\",\n\t\t\t\"index_settings\" : {\n\t\t\t\t\"index\" : {\n\t\t\t\t\t\"number_of_shards\" : 1\n\t\t\t\t}\n\t\t\t},\n\t\t\t\"type_mapping\": {\n\t\t\t\t\"mytype\" : {\n\t\t\t\t\t\"properties\" : {\n\t\t\t\t\t\t\"polygon\" : {\n\t\t\t\t\t\t\t\"type\" : \"geo_shape\",\n\t\t\t\t\t\t\t\"tree\" : \"quadtree\"\n\t\t\t\t\t\t}\n\t\t\t\t\t}\n\t\t\t\t}\n\t\t\t}\n\t\t}\n\t}\n\t' | java \\\n\t\t-cp \"${lib}/*\" \\\n\t\t-Dlog4j.configurationFile=${bin}/log4j2.xml \\\n\t\torg.xbib.tools.Runner \\\n\t\torg.xbib.tools.JDBCImporter\n\n## Oracle column name 30 character limit\n\nOracle imposes a 30 character limit on column name aliases. This makes it sometimes hard to define columns names for\nElasticsearch field names. For this, a column name map can be used like this:\n\n    {\n        \"type\" : \"jdbc\",\n        \"jdbc\" : {\n            \"url\" : \"jdbc:oracle:thin:@//localhost/sid\",\n            \"user\" : \"user\",\n            \"password\" : \"password\",\n            \"sql\" : \"select or_id as \\\"_id\\\", or_tan as \\\"o.t\\\", or_status as \\\"o.s\\\", stages.* from orders, stages where or_id = st_or_id and or_seqno = st_seqno\",\n            \"column_name_map\" : {\n               \"o\" : \"order\",\n               \"t\" : \"transaction_id\",\n               \"s\" : \"status\"\n            }\n        }\n    }\n\n## Connection properties for JDBC driver\n\nFor some JDBC drivers, advanced parameters can be passed that are not specified in the driver URL, \nbut in the JDBC connection properties. You can specifiy connection properties like this:\n\n    {\n        \"type\" : \"jdbc\",\n        \"jdbc\" : {\n            \"url\" : \"jdbc:oracle:thin:@//localhost:1521/sid\",\n            \"user\" : \"user\",\n            \"password\" : \"password\",\n            \"sql\" : \"select ... from ...\",\n            \"connection_properties\" : {\n                \"oracle.jdbc.TcpNoDelay\" : false,\n                \"useFetchSizeWithLongColumn\" : false,\n                \"oracle.net.CONNECT_TIMEOUT\" : 10000,\n                \"oracle.jdbc.ReadTimeout\" : 50000\n            }\n        }\n    }\n\n\n# License\n\nElasticsearch JDBC Importer\n\nCopyright (C) 2012-2015 Jrg Prante\n\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\n\n    http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.\n"
        },
        {
          "name": "bin",
          "type": "tree",
          "content": null
        },
        {
          "name": "build.gradle",
          "type": "blob",
          "size": 6.62109375,
          "content": "plugins {\n    id 'java'\n    id 'com.github.johnrengelman.shadow' version '1.2.3'\n}\n\ngroup = 'org.xbib.elasticsearch.importer'\nversion = '2.3.4.1'\n\nprintln \"Host: \" + java.net.InetAddress.getLocalHost()\nprintln \"Gradle: \" + gradle.gradleVersion + \" JVM: \" + org.gradle.internal.jvm.Jvm.current() + \" Groovy: \" + GroovySystem.getVersion()\nprintln \"Build: group: '${project.group}', name: '${project.name}', version: '${project.version}'\"\n\next {\n    pluginName = 'elasticsearch-jdbc'\n    pluginClassname  = 'org.xbib.elasticsearch.plugin.jdbc.JDBCPlugin'\n    pluginDescription = 'JDBC importer service for Elasticsearch'\n    user = 'jprante'\n    name = 'elasticsearch-jdbc'\n    description = 'JDBC importer for Elasticsearch'\n    scmUrl = 'https://github.com/' + user + '/' + name\n    scmConnection = 'scm:git:git://github.com/' + user + '/' + name + '.git'\n    scmDeveloperConnection = 'scm:git:git://github.com/' + user + '/' + name + '.git'\n    versions = [\n      'elasticsearch' : '2.3.4',\n      'elasticsearch-helper' : '2.3.4.0',\n      'log4j': '2.5',\n      'wagon' : '2.10',\n      'jsr166e': '1.1.0',\n      'jna' : '4.1.0',\n      'spatial4j': '0.5',\n      'jts' : '1.13',\n      'jdbc-driver-csv': '1.0.0',\n      'junit' : '4.12',\n      'testng':  '6.9.10',\n      'derby' : '10.12.1.1',\n      'h2' : '1.4.191',\n      'hsqldb' : '2.3.3',\n      'mysql' : '5.1.38',\n      'postgresql' : '9.4.1208.jre7'\n    ]\n    databases = ['derby', 'h2', 'hsqldb']\n}\n\napply plugin: 'java'\napply plugin: 'maven'\napply plugin: 'signing'\napply plugin: 'com.github.johnrengelman.shadow'\n\nrepositories {\n    mavenLocal()\n    mavenCentral()\n    jcenter()\n    maven {\n        url \"http://xbib.org/repository\"\n    }\n}\n\nsourceSets {\n    integrationTest {\n        java {\n            compileClasspath += main.output + test.output\n            runtimeClasspath += main.output + test.output\n            srcDir file('src/integration-test/java')\n        }\n        resources {\n            srcDir file('src/integration-test/resources')\n        }\n    }\n}\n\nconfigurations.all {\n    resolutionStrategy.cacheDynamicVersionsFor 0, 'seconds'\n    resolutionStrategy.cacheChangingModulesFor 0, 'seconds'\n}\n\nconfigurations {\n    wagon\n    integrationTestCompile.extendsFrom testCompile\n    integrationTestRuntime.extendsFrom testRuntime\n    driverJars\n}\n\ndependencies {\n    compile 'org.elasticsearch:elasticsearch:' + versions.elasticsearch\n    compile 'org.xbib.elasticsearch.plugin:elasticsearch-helper:' + versions.'elasticsearch-helper'\n    compile 'org.apache.logging.log4j:log4j-slf4j-impl:' + versions.log4j\n    compile 'org.apache.logging.log4j:log4j-core:'+ versions.log4j\n    compile('com.vividsolutions:jts:' + versions.jts) {\n        exclude group: 'xerces'\n    }\n    testCompile 'org.testng:testng:' + versions.testng\n    testCompile 'net.java.dev.jna:jna:' + versions.jna\n    // Workaround for a known issue with TestNG 6.x: explicitly add Guice (Gradle will fail to run tests otherwise)\n    testCompile 'com.google.inject:guice:3.0'\n    testCompile 'org.uncommons:reportng:1.1.4'\n    testCompile 'org.apache.logging.log4j:log4j-slf4j-impl:' + versions.log4j\n    testCompile 'org.apache.logging.log4j:log4j-core:'+ versions.log4j\n    integrationTestCompile 'org.testng:testng:' + versions.testng\n    integrationTestCompile 'org.elasticsearch:elasticsearch:' + versions.elasticsearch\n    integrationTestCompile 'net.java.dev.jna:jna:' + versions.jna\n    // for distribution\n    driverJars('org.xbib.jdbc:jdbc-driver-csv:' + versions.'jdbc-driver-csv') {\n        exclude group: 'org.apache.logging.log4j'\n    }\n    driverJars 'org.apache.derby:derby:' + versions.derby\n    driverJars 'com.h2database:h2:' + versions.h2\n    driverJars 'org.hsqldb:hsqldb:' + versions.hsqldb\n    driverJars 'mysql:mysql-connector-java:' + versions.mysql\n    driverJars 'org.postgresql:postgresql:' + versions.postgresql\n    // download from Oracle JDBC download site (needs registration)\n    // http://www.oracle.com/technetwork/database/features/jdbc/jdbc-drivers-12c-download-1958347.html\n    // driverJars 'com.oracle:ojdbc7:12.1.0.1'\n    wagon 'org.apache.maven.wagon:wagon-ssh-external:' + versions.wagon\n}\n\ntask integrationTest(type: Test, dependsOn: [':unpackPlugin']) {\n    testClassesDir = sourceSets.integrationTest.output.classesDir\n    classpath = configurations.integrationTestCompile\n    classpath += fileTree('plugins/' + pluginName).include('*.jar')\n    classpath += sourceSets.integrationTest.output\n    // remove identical jars from classpath, otherwise Elasticsearch will complain a \"jar hell\"\n    //classpath -= configurations.releaseJars\n    outputs.upToDateWhen { false }\n    systemProperty 'log4j.configurationFile', projectDir.absolutePath + '/src/test/resources/log4j2.xml'\n    systemProperty 'path.home', projectDir.absolutePath\n}\n\ntasks.withType(Test) {\n    reports.html.destination = file(\"${reporting.baseDir}/${name}\")\n}\n\ntest {\n    useTestNG() {\n        testLogging.showStandardStreams = false\n        suiteXmlBuilder().suite(name: 'gradle-testng-jdbc', verbose: '1') {\n            test(name : 'Support Tests') {\n                classes([:]) {\n                    'class'(name: 'org.xbib.elasticsearch.common.util.ValuesTests')\n                    'class'(name: 'org.xbib.elasticsearch.common.util.ValueListenerTests')\n                    'class'(name: 'org.xbib.elasticsearch.common.util.SQLCommandTests')\n                }\n            }\n        }\n    }\n    options {\n        listeners << 'org.xbib.elasticsearch.util.TestListener'\n        listeners << 'org.uncommons.reportng.HTMLReporter'\n        listeners << 'org.uncommons.reportng.JUnitXMLReporter'\n    }\n    ext.useDefaultListeners = true\n    ext.workingDirectory = 'build/'\n}\n\ndatabases.each { database ->\n    apply from: rootProject.file(\"gradle/${database}.gradle\")\n}\n\ncheck {\n    databases.each { database ->\n        dependsOn \"${database}IntegrationTest\"\n    }\n}\n\ntask sourcesJar(type: Jar, dependsOn: classes) {\n    from sourceSets.main.allSource\n    into 'build/tmp/sources'\n    classifier 'sources'\n}\n\ntask buildDistZip(type: Zip, dependsOn: jar) {\n    into(project.name + '-' + project.version + '/lib') {\n        from configurations.runtime.allArtifacts.files\n        from configurations.runtime\n        from configurations.driverJars\n    }\n    into(project.name + '-' + project.version + '/bin') {\n        from 'bin'\n    }\n    classifier = 'dist'\n}\n\nshadowJar {\n    baseName =  project.name\n    version = project.version\n    classifier = 'all'\n    manifest {\n        attributes 'Main-Class': 'org.xbib.tools.Runner'\n    }\n}\n\nartifacts {\n    archives sourcesJar, shadowJar, buildDistZip\n}\n\nif (project.hasProperty('signing.keyId')) {\n    signing {\n        sign configurations.archives\n    }\n}\n\napply from: 'gradle/publish.gradle'"
        },
        {
          "name": "docker-example",
          "type": "tree",
          "content": null
        },
        {
          "name": "gradle",
          "type": "tree",
          "content": null
        },
        {
          "name": "gradlew",
          "type": "blob",
          "size": 5.119140625,
          "content": "#!/usr/bin/env bash\n\n##############################################################################\n##\n##  Gradle start up script for UN*X\n##\n##############################################################################\n\n# Attempt to set APP_HOME\n# Resolve links: $0 may be a link\nPRG=\"$0\"\n# Need this for relative symlinks.\nwhile [ -h \"$PRG\" ] ; do\n    ls=`ls -ld \"$PRG\"`\n    link=`expr \"$ls\" : '.*-> \\(.*\\)$'`\n    if expr \"$link\" : '/.*' > /dev/null; then\n        PRG=\"$link\"\n    else\n        PRG=`dirname \"$PRG\"`\"/$link\"\n    fi\ndone\nSAVED=\"`pwd`\"\ncd \"`dirname \\\"$PRG\\\"`/\" >/dev/null\nAPP_HOME=\"`pwd -P`\"\ncd \"$SAVED\" >/dev/null\n\nAPP_NAME=\"Gradle\"\nAPP_BASE_NAME=`basename \"$0\"`\n\n# Add default JVM options here. You can also use JAVA_OPTS and GRADLE_OPTS to pass JVM options to this script.\nDEFAULT_JVM_OPTS=\"\"\n\n# Use the maximum available, or set MAX_FD != -1 to use that value.\nMAX_FD=\"maximum\"\n\nwarn ( ) {\n    echo \"$*\"\n}\n\ndie ( ) {\n    echo\n    echo \"$*\"\n    echo\n    exit 1\n}\n\n# OS specific support (must be 'true' or 'false').\ncygwin=false\nmsys=false\ndarwin=false\nnonstop=false\ncase \"`uname`\" in\n  CYGWIN* )\n    cygwin=true\n    ;;\n  Darwin* )\n    darwin=true\n    ;;\n  MINGW* )\n    msys=true\n    ;;\n  NONSTOP* )\n    nonstop=true\n    ;;\nesac\n\nCLASSPATH=$APP_HOME/gradle/wrapper/gradle-wrapper.jar\n\n# Determine the Java command to use to start the JVM.\nif [ -n \"$JAVA_HOME\" ] ; then\n    if [ -x \"$JAVA_HOME/jre/sh/java\" ] ; then\n        # IBM's JDK on AIX uses strange locations for the executables\n        JAVACMD=\"$JAVA_HOME/jre/sh/java\"\n    else\n        JAVACMD=\"$JAVA_HOME/bin/java\"\n    fi\n    if [ ! -x \"$JAVACMD\" ] ; then\n        die \"ERROR: JAVA_HOME is set to an invalid directory: $JAVA_HOME\n\nPlease set the JAVA_HOME variable in your environment to match the\nlocation of your Java installation.\"\n    fi\nelse\n    JAVACMD=\"java\"\n    which java >/dev/null 2>&1 || die \"ERROR: JAVA_HOME is not set and no 'java' command could be found in your PATH.\n\nPlease set the JAVA_HOME variable in your environment to match the\nlocation of your Java installation.\"\nfi\n\n# Increase the maximum file descriptors if we can.\nif [ \"$cygwin\" = \"false\" -a \"$darwin\" = \"false\" -a \"$nonstop\" = \"false\" ] ; then\n    MAX_FD_LIMIT=`ulimit -H -n`\n    if [ $? -eq 0 ] ; then\n        if [ \"$MAX_FD\" = \"maximum\" -o \"$MAX_FD\" = \"max\" ] ; then\n            MAX_FD=\"$MAX_FD_LIMIT\"\n        fi\n        ulimit -n $MAX_FD\n        if [ $? -ne 0 ] ; then\n            warn \"Could not set maximum file descriptor limit: $MAX_FD\"\n        fi\n    else\n        warn \"Could not query maximum file descriptor limit: $MAX_FD_LIMIT\"\n    fi\nfi\n\n# For Darwin, add options to specify how the application appears in the dock\nif $darwin; then\n    GRADLE_OPTS=\"$GRADLE_OPTS \\\"-Xdock:name=$APP_NAME\\\" \\\"-Xdock:icon=$APP_HOME/media/gradle.icns\\\"\"\nfi\n\n# For Cygwin, switch paths to Windows format before running java\nif $cygwin ; then\n    APP_HOME=`cygpath --path --mixed \"$APP_HOME\"`\n    CLASSPATH=`cygpath --path --mixed \"$CLASSPATH\"`\n    JAVACMD=`cygpath --unix \"$JAVACMD\"`\n\n    # We build the pattern for arguments to be converted via cygpath\n    ROOTDIRSRAW=`find -L / -maxdepth 1 -mindepth 1 -type d 2>/dev/null`\n    SEP=\"\"\n    for dir in $ROOTDIRSRAW ; do\n        ROOTDIRS=\"$ROOTDIRS$SEP$dir\"\n        SEP=\"|\"\n    done\n    OURCYGPATTERN=\"(^($ROOTDIRS))\"\n    # Add a user-defined pattern to the cygpath arguments\n    if [ \"$GRADLE_CYGPATTERN\" != \"\" ] ; then\n        OURCYGPATTERN=\"$OURCYGPATTERN|($GRADLE_CYGPATTERN)\"\n    fi\n    # Now convert the arguments - kludge to limit ourselves to /bin/sh\n    i=0\n    for arg in \"$@\" ; do\n        CHECK=`echo \"$arg\"|egrep -c \"$OURCYGPATTERN\" -`\n        CHECK2=`echo \"$arg\"|egrep -c \"^-\"`                                 ### Determine if an option\n\n        if [ $CHECK -ne 0 ] && [ $CHECK2 -eq 0 ] ; then                    ### Added a condition\n            eval `echo args$i`=`cygpath --path --ignore --mixed \"$arg\"`\n        else\n            eval `echo args$i`=\"\\\"$arg\\\"\"\n        fi\n        i=$((i+1))\n    done\n    case $i in\n        (0) set -- ;;\n        (1) set -- \"$args0\" ;;\n        (2) set -- \"$args0\" \"$args1\" ;;\n        (3) set -- \"$args0\" \"$args1\" \"$args2\" ;;\n        (4) set -- \"$args0\" \"$args1\" \"$args2\" \"$args3\" ;;\n        (5) set -- \"$args0\" \"$args1\" \"$args2\" \"$args3\" \"$args4\" ;;\n        (6) set -- \"$args0\" \"$args1\" \"$args2\" \"$args3\" \"$args4\" \"$args5\" ;;\n        (7) set -- \"$args0\" \"$args1\" \"$args2\" \"$args3\" \"$args4\" \"$args5\" \"$args6\" ;;\n        (8) set -- \"$args0\" \"$args1\" \"$args2\" \"$args3\" \"$args4\" \"$args5\" \"$args6\" \"$args7\" ;;\n        (9) set -- \"$args0\" \"$args1\" \"$args2\" \"$args3\" \"$args4\" \"$args5\" \"$args6\" \"$args7\" \"$args8\" ;;\n    esac\nfi\n\n# Split up the JVM_OPTS And GRADLE_OPTS values into an array, following the shell quoting and substitution rules\nfunction splitJvmOpts() {\n    JVM_OPTS=(\"$@\")\n}\neval splitJvmOpts $DEFAULT_JVM_OPTS $JAVA_OPTS $GRADLE_OPTS\nJVM_OPTS[${#JVM_OPTS[*]}]=\"-Dorg.gradle.appname=$APP_BASE_NAME\"\n\n# by default we should be in the correct project dir, but when run from Finder on Mac, the cwd is wrong\nif [[ \"$(uname)\" == \"Darwin\" ]] && [[ \"$HOME\" == \"$PWD\" ]]; then\n  cd \"$(dirname \"$0\")\"\nfi\n\nexec \"$JAVACMD\" \"${JVM_OPTS[@]}\" -classpath \"$CLASSPATH\" org.gradle.wrapper.GradleWrapperMain \"$@\"\n"
        },
        {
          "name": "gradlew.bat",
          "type": "blob",
          "size": 2.20703125,
          "content": "@if \"%DEBUG%\" == \"\" @echo off\r\n@rem ##########################################################################\r\n@rem\r\n@rem  Gradle startup script for Windows\r\n@rem\r\n@rem ##########################################################################\r\n\r\n@rem Set local scope for the variables with windows NT shell\r\nif \"%OS%\"==\"Windows_NT\" setlocal\r\n\r\nset DIRNAME=%~dp0\r\nif \"%DIRNAME%\" == \"\" set DIRNAME=.\r\nset APP_BASE_NAME=%~n0\r\nset APP_HOME=%DIRNAME%\r\n\r\n@rem Add default JVM options here. You can also use JAVA_OPTS and GRADLE_OPTS to pass JVM options to this script.\r\nset DEFAULT_JVM_OPTS=\r\n\r\n@rem Find java.exe\r\nif defined JAVA_HOME goto findJavaFromJavaHome\r\n\r\nset JAVA_EXE=java.exe\r\n%JAVA_EXE% -version >NUL 2>&1\r\nif \"%ERRORLEVEL%\" == \"0\" goto init\r\n\r\necho.\r\necho ERROR: JAVA_HOME is not set and no 'java' command could be found in your PATH.\r\necho.\r\necho Please set the JAVA_HOME variable in your environment to match the\r\necho location of your Java installation.\r\n\r\ngoto fail\r\n\r\n:findJavaFromJavaHome\r\nset JAVA_HOME=%JAVA_HOME:\"=%\r\nset JAVA_EXE=%JAVA_HOME%/bin/java.exe\r\n\r\nif exist \"%JAVA_EXE%\" goto init\r\n\r\necho.\r\necho ERROR: JAVA_HOME is set to an invalid directory: %JAVA_HOME%\r\necho.\r\necho Please set the JAVA_HOME variable in your environment to match the\r\necho location of your Java installation.\r\n\r\ngoto fail\r\n\r\n:init\r\n@rem Get command-line arguments, handling Windows variants\r\n\r\nif not \"%OS%\" == \"Windows_NT\" goto win9xME_args\r\n\r\n:win9xME_args\r\n@rem Slurp the command line arguments.\r\nset CMD_LINE_ARGS=\r\nset _SKIP=2\r\n\r\n:win9xME_args_slurp\r\nif \"x%~1\" == \"x\" goto execute\r\n\r\nset CMD_LINE_ARGS=%*\r\n\r\n:execute\r\n@rem Setup the command line\r\n\r\nset CLASSPATH=%APP_HOME%\\gradle\\wrapper\\gradle-wrapper.jar\r\n\r\n@rem Execute Gradle\r\n\"%JAVA_EXE%\" %DEFAULT_JVM_OPTS% %JAVA_OPTS% %GRADLE_OPTS% \"-Dorg.gradle.appname=%APP_BASE_NAME%\" -classpath \"%CLASSPATH%\" org.gradle.wrapper.GradleWrapperMain %CMD_LINE_ARGS%\r\n\r\n:end\r\n@rem End local scope for the variables with windows NT shell\r\nif \"%ERRORLEVEL%\"==\"0\" goto mainEnd\r\n\r\n:fail\r\nrem Set variable GRADLE_EXIT_CONSOLE if you need the _script_ return code instead of\r\nrem the _cmd.exe /c_ return code!\r\nif  not \"\" == \"%GRADLE_EXIT_CONSOLE%\" exit 1\r\nexit /b 1\r\n\r\n:mainEnd\r\nif \"%OS%\"==\"Windows_NT\" endlocal\r\n\r\n:omega\r\n"
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}