{
  "metadata": {
    "timestamp": 1736608851854,
    "page": 15,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjIw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "Devlight/NavigationTabBar",
      "stars": 4949,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.0634765625,
          "content": "*.iml\n.gradle\n/local.properties\n.idea\n.DS_Store\n/build\n/captures\n"
        },
        {
          "name": "LICENSE.txt",
          "type": "blob",
          "size": 12.16015625,
          "content": "Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"{}\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright {2016} {Basil Miller}\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n\nMIT License (MIT)\n\n    Copyright (c) 2016 Basil Miller\n\n    Permission is hereby granted, free of charge, to any person obtaining a copy\n    of this software and associated documentation files (the \"Software\"), to deal\n    in the Software without restriction, including without limitation the rights\n    to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\n    copies of the Software, and to permit persons to whom the Software is\n    furnished to do so, subject to the following conditions:\n\n    The above copyright notice and this permission notice shall be included in\n    all copies or substantial portions of the Software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\n    AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n    OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN\n    THE SOFTWARE."
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 14.6806640625,
          "content": "<br/>\n<p align=\"center\">\n  <a href=\"http://devlight.io\">\n      <img src =\"https://drive.google.com/uc?export=download&id=0BxPO_UeS7wScLVBKck51Z1Rzb0E\" alt=\"Devlight\"/>\n  </a>\n</p>\n<br/>\n\nNavigationTabBar\n================\n\nNavigation tab bar with colorful interactions.\n\n[![Android Arsenal](https://drive.google.com/uc?export=download&id=0BxPO_UeS7wScbFFTYko2dlc2d28)](http://android-arsenal.com/details/1/3382)\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\n[![Android](https://drive.google.com/uc?export=download&id=0BxPO_UeS7wSccEZaclNGN0R5OWc)](https://github.com/DevLight-Mobile-Agency)\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\n[![Download](https://drive.google.com/uc?export=download&id=0BxPO_UeS7wScZE8wb0xKbC1RT0U)](https://bintray.com/gigamole/maven/navigationtabbar/_latestVersion)\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\n[![License](https://drive.google.com/uc?export=download&id=0BxPO_UeS7wScU0tmeFpGMHVWNWs)](https://github.com/DevLight-Mobile-Agency/NavigationTabBar/blob/master/LICENSE.txt)\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\n[![Codacy](https://drive.google.com/uc?export=download&id=0BxPO_UeS7wScSHhmckZyeGJDcXc)](https://www.codacy.com/app/gigamole53/NavigationTabBar?utm_source=github.com&amp;utm_medium=referral&amp;utm_content=DevLight-Mobile-Agency/NavigationTabBar&amp;utm_campaign=Badge_Grade)\n\n<table align=\"center\">\n    <tr>\n        <td><img src=\"https://drive.google.com/uc?export=download&id=0BxPO_UeS7wScTEVDQXJLOGZLZFU\"/></td>\n        <td><img src=\"https://drive.google.com/uc?export=download&id=0BxPO_UeS7wScTmhyQl9RYVIyUFE\"/></td>\n        <td><img src=\"https://drive.google.com/uc?export=download&id=0BxPO_UeS7wScTmhyQl9RYVIyUFE\"/></td>\n        <td><img src=\"https://drive.google.com/uc?export=download&id=0BxPO_UeS7wScTDVwbm1qclB1MmM\"/></td>\n        <td><img src=\"https://drive.google.com/uc?export=download&id=0BxPO_UeS7wScVWp3eGV4dEJTN2M\"/></td>\n        <td><img src=\"https://drive.google.com/uc?export=download&id=0BxPO_UeS7wScdmloRFNKV3hfS0U\"/></td>\n        <td><img src=\"https://drive.google.com/uc?export=download&id=0BxPO_UeS7wScclZSSlU2ZE1qVVU\"/></td>\n    </tr>\n</table>\n\nYou can check the sample app [here](https://github.com/DevLight-Mobile-Agency/NavigationTabBar/tree/master/app).\n\nWarn\n====\n```\nThis library is not more supported. \nIf you want to add new feature or fix a bug, grab source code and do it. \nIf you think your fix or feature would be useful to other developers, \nI can add link of your repository to this README file. \nThank you for using our libraries.\n```\n\nDownload\n========\n\nYou can download a `.aar` from GitHub's [releases page](https://github.com/DevLight-Mobile-Agency/NavigationTabBar/releases).\n\nYou can use Gradle:\n```groovy\ncompile 'devlight.io:navigationtabbar:1.2.5'\n```\n\nOr Maven:\n```groovy\n<dependency>\n    <groupId>devlight.io</groupId>\n    <artifactId>navigationtabbar</artifactId>\n    <version>1.2.5</version>\n    <type>aar</type>\n</dependency>\n```\n\nOr Ivy:\n```groovy\n<dependency org='devlight.io' name='navigationtabbar' rev='1.2.5'>\n  <artifact name='$AID' ext='pom'></artifact>\n</dependency>\n```\n\nAndroid SDK Version\n===================\n\n`NavigationTabBar` requires a minimum SDK version of 11. \n\nSample\n======\n\n<b>Parameters</b>\n\nFor `NTB` you can set such parameters as:\n \n - models:  \n     allows you to set `NTB` models, where you set icon and color. Can be set up only via code.\n    \n - behavior:  \n     allows you to set bottom translation behavior.\n    \n - view pager:  \n     allows you to connect `NTB` with `ViewPager`. If you want your can also set `OnPageChangeListener`.\n         \n - background color:  \n    allows you to set background to `NTB` which automatically set with offset relative to badge gravity and corners radius.\n\n - model selected icon:  \n     allows you to set selected icon when current model is active.\n\n - model title:  \n     allows you to enable title in you model.\n    \n - model badge:  \n     allows you to enable badge in you model.\n     \n - use custom typeface on badge:  \n     allows you to handle set of custom typeface in your badge.\n    \n - title mode:  \n     allows you to handle mode of the model title show. Can show all or only active.\n     \n - title size:  \n     allows you to set titles size. \n     \n - scale mode:  \n     allows you to handle mode of the model icon and title scale.\n     \n - tint mode:  \n     allows you to enable or disable icon tinting.\n      \n - badge size:  \n     allows you to set badges size.\n     \n - badge position:  \n     allows you to set the badge position in you model. Can be: left(25%), center(50%) and right(75%).\n\n - badge gravity:  \n     allows you to set the badge gravity in NTB. Can be top or bottom.\n     \n - badge colors:  \n     allows you to set the badge bg and title colors.\n    \n - typeface:  \n     allows you to set custom typeface to your title.\n \n - corners radius:  \n     allows you to set corners radius of pointer.\n\n - icon size fraction:  \n     allows you to set icon size fraction relative to smaller model side.\n\n - animation duration:  \n     allows you to set animation duration.\n      \n - inactive color:  \n     allows you to set inactive icon color.\n     \n - active color:  \n     allows you to set active icon color.\n     \n - tab bar listener:  \n     allows you to set listener which triggering on start or on end when you set model index.\n        \n - preview colors:  \n     allows you to set preview colors, which generate count of models equals to count of colors.\n\n<b>Tips</b>\n\nCreation of models occurs through `Builder` pattern.  \n`ModelBuilder` requires two fields: icon and color. Title, badge title and selected icon is optional.\n\nYou can set selected icon. Resize and scale of selected icon equals to original icon.  \nOrientation automatically detected according to `View` size.\n\nBy default badge bg color is the active model color and badge title color is the model bg color. To reset colors just set `AUTO_COLOR` value to badge bg and title color.  \nBy default badge sizes and title sizes is auto fit. To reset calculation just set `AUTO_SIZE` value to badge size and title size.  \nBy default icon size fraction is `0.5F` (half of smaller side of `NTB` model). To reset scale fraction of icon to automatic just put in method `AUTO_SCALE` value.\n\nIf your set `ViewPager` and enable swipe you can action down on active pointer and do like drag.\n\n<b>Init</b>\n\nCheck out in code init:\n\n```java\nfinal NavigationTabBar navigationTabBar = (NavigationTabBar) findViewById(R.id.ntb);\nfinal ArrayList<NavigationTabBar.Model> models = new ArrayList<>();\nmodels.add(\n        new NavigationTabBar.Model.Builder(\n                getResources().getDrawable(R.drawable.ic_first),\n                Color.parseColor(colors[0])\n        ).title(\"Heart\")\n                .badgeTitle(\"NTB\")\n                .build()\n);\nmodels.add(\n        new NavigationTabBar.Model.Builder(\n                getResources().getDrawable(R.drawable.ic_second),\n                Color.parseColor(colors[1])\n        ).title(\"Cup\")\n                .badgeTitle(\"with\")\n                .build()\n);\nmodels.add(\n        new NavigationTabBar.Model.Builder(\n                getResources().getDrawable(R.drawable.ic_third),\n                Color.parseColor(colors[2])\n        ).title(\"Diploma\")\n                .badgeTitle(\"state\")\n                .build()\n);\nmodels.add(\n        new NavigationTabBar.Model.Builder(\n                getResources().getDrawable(R.drawable.ic_fourth),\n                Color.parseColor(colors[3])\n        ).title(\"Flag\")\n                .badgeTitle(\"icon\")\n                .build()\n);\nmodels.add(\n        new NavigationTabBar.Model.Builder(\n                getResources().getDrawable(R.drawable.ic_fifth),\n                Color.parseColor(colors[4])\n        ).title(\"Medal\")\n                .badgeTitle(\"777\")\n                .build()\n);\nnavigationTabBar.setModels(models);\nnavigationTabBar.setViewPager(viewPager, 2);\n\nnavigationTabBar.setTitleMode(NavigationTabBar.TitleMode.ACTIVE);\nnavigationTabBar.setBadgeGravity(NavigationTabBar.BadgeGravity.BOTTOM);\nnavigationTabBar.setBadgePosition(NavigationTabBar.BadgePosition.CENTER);\nnavigationTabBar.setTypeface(\"fonts/custom_font.ttf\");\nnavigationTabBar.setIsBadged(true);\nnavigationTabBar.setIsTitled(true);\nnavigationTabBar.setIsTinted(true);\nnavigationTabBar.setIsBadgeUseTypeface(true);\nnavigationTabBar.setBadgeBgColor(Color.RED);\nnavigationTabBar.setBadgeTitleColor(Color.WHITE);\nnavigationTabBar.setIsSwiped(true);\nnavigationTabBar.setBgColor(Color.BLACK);\nnavigationTabBar.setBadgeSize(10);\nnavigationTabBar.setTitleSize(10);\nnavigationTabBar.setIconSizeFraction(0.5);\n```\n\nIf your models is in badge mode you can set title, hide, show, toggle and update badge title like this:\n```java\nmodel.setTitle(\"Here some title to model\");\nmodel.hideBadge();\nmodel.showBadge();\nmodel.toggleBadge();\nmodel.updateBadgeTitle(\"Here some title like NEW or some integer value\");\n```\n          \nTo enable behavior translation inside `CoordinatorLayout` when at bottom of screen:\n```java\nnavigationTabBar.setBehaviorEnabled(true);\n```\n\nTo deselect active index and reset pointer:\n```java\nnavigationTabBar.deselect();\n```\n\nOther methods check out in sample.\n\nAnd XML init:\n\n```xml\n<devlight.io.library.ntb.NavigationTabBar\n   android:id=\"@+id/ntb\"\n   android:layout_width=\"match_parent\"\n   android:layout_height=\"50dp\"\n   app:ntb_animation_duration=\"400\"\n   app:ntb_preview_colors=\"@array/colors\"\n   app:ntb_corners_radius=\"10dp\"\n   app:ntb_active_color=\"#fff\"\n   app:ntb_inactive_color=\"#000\"\n   app:ntb_badged=\"true\"\n   app:ntb_titled=\"true\"\n   app:ntb_scaled=\"true\"\n   app:ntb_tinted=\"true\"\n   app:ntb_title_mode=\"all\"\n   app:ntb_badge_position=\"right\"\n   app:ntb_badge_gravity=\"top\"\n   app:ntb_badge_bg_color=\"#ffff0000\"\n   app:ntb_badge_title_color=\"#ffffffff\"\n   app:ntb_typeface=\"fonts/custom_typeface.ttf\"\n   app:ntb_badge_use_typeface=\"true\"\n   app:ntb_swiped=\"true\"\n   app:ntb_bg_color=\"#000\"\n   app:ntb_icon_size_fraction=\"0.5\"\n   app:ntb_badge_size=\"10sp\"\n   app:ntb_title_size=\"10sp\"/>\n```\n\nXML属性中文详解:\n```xml\n<devlight.io.library.ntb.NavigationTabBar 各属性详解\n    全局:\n    app:ntb_bg_color=\"#000\"             ntb的背景颜色                可自定义\n    app:ntb_active_color=\"#000\"         ntb活动时的图标+标题颜色      可自定义\n    app:ntb_inactive_color=\"#0f0\"       ntb不活动时的图标+标题颜色    可自定义\n    app:ntb_corners_radius=\"10dp\"       ntb切换时的动画弧度大小       可自定义\n    app:ntb_animation_duration=\"1000\"   ntb切换时的动画时间           单位:ms\n    图标相关:\n    app:ntb_icon_size_fraction=\"1\"      图标所占的大小比例            最佳值:0.5\n    标题相关:\n    app:ntb_titled=\"true\"               是否显示图标所对应的标题       默认为false\n    app:ntb_title_mode=\"active\"         图片所对应的标题显示模式       active:活动时才显示 all:总是显示  PS:app:ntb_titled属性值为 true 时才可用\n    app:ntb_title_size=\"10sp\"           设置图标所对应的标题文字大小    请自定义\n    勋章相关:\n    app:ntb_badged=\"false\"              是否显示勋章                  默认为false\n    app:ntb_badge_gravity=\"top\"         勋章的上下位置                top|bottom\n    app:ntb_badge_position=\"right\"      勋章的左右位置                left(25%), center(50%) and right(75%)\n    app:ntb_badge_bg_color=\"#ffff0000\"  勋章的背景颜色                可自定义\n    app:ntb_badge_title_color=\"#000000\" 勋章的标题文字颜色             可自定义 PS:不设置的话默认为切换动画的背景色\n    app:ntb_badge_size=\"12sp\"           勋章的标题文字大小             可自定义\n    字体相关:\n    app:ntb_badge_use_typeface=\"false\"  是否使用自定义字体             默认为false\n    app:ntb_typeface=\"fonts/by3500.ttf\" 设置ntb的自定义字体            请将自定义的字体文件放在 asset/fonts 文件夹下\n    其他:\n    app:ntb_preview_colors=\"@array/colors\"\n    app:ntb_scaled=\"true\"\n    app:ntb_tinted=\"true\"\n    app:ntb_swiped=\"true\"/>\n```\n\nGetting Help\n============\n\nTo report a specific problem or feature request, [open a new issue on Github](https://github.com/DevLight-Mobile-Agency/NavigationTabBar/issues/new).\n\nXamarin\n=======\n\nThanks to [Martijn van Dijk](https://github.com/martijn00) for developing Xamarin bindings library for [NavigationTabBar](https://github.com/martijn00/NavigationTabBarXamarin).  \nPlugin is available on [Nuget](https://www.nuget.org/packages/Xam.Plugins.Android.NavigationTabBar/).\n\n## use navbar using materialize css\nnavbar using materialize css is really easy and would take just assigning right classes to the html tags and it would create a navigation tab bar using its prewritten css and js files. This can be easily used in html pages using downloaded files or cdn links...\nhttps://materializecss.com/navbar.html\n\nCredits\n=======\n\nSincere thanks, to portal [FAnDroid.info](http://www.fandroid.info) [(StartAndroid)](https://www.youtube.com/channel/UCzE7HcbvyEiS5ea1rVRbPLQ) who released the review of this library in detail. If you understand the Russian language, then feel free to see the video or read the [text version](http://www.fandroid.info/obzor-biblioteki-navigationtabbar-dlya-android-ot-komandy-devlight/) of its great post.\n<p align=\"center\">\n    <a href=\"https://youtu.be/nGikO-tbSsg\">\n        <img src=\"https://drive.google.com/uc?export=download&id=0BxPO_UeS7wScSGg0TVBodk9ZM2M\"/>\n    </a>\n</p>\n\nInspired by:\n\n|[Sergey Valiukh](https://dribbble.com/SergeyValiukh)|\n|:--------------------------------------------------:|\n|[![](https://s-media-cache-ak0.pinimg.com/originals/39/ee/33/39ee330f3460bd638284f0576bc95b65.gif)](https://dribbble.com/shots/2071319-GIF-of-the-Tapbar-Interactions)|\n\nThanks to [Valery Nuzhniy](https://www.pinterest.com/hevbolt/) for NTB badge design.\n\nAuthor\n======\n\nCreated by [Basil Miller](https://github.com/GIGAMOLE) - [@gigamole](mailto:gigamole53@gmail.com)\n\nCompany\n=======\n\n[![Facebook](https://drive.google.com/uc?export=download&id=0BxPO_UeS7wScaGhGVFNKU0VxMnc)](https://www.facebook.com/devlightagency)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;[![Twitter](https://drive.google.com/uc?export=download&id=0BxPO_UeS7wScZ1ExQWh5cHF5cVE)](https://twitter.com/DevLightIO)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;[![LinkedIn](https://drive.google.com/uc?export=download&id=0BxPO_UeS7wSccGZINzEycE1nVFE)](https://www.linkedin.com/company/devlight)\n\n[Here](https://github.com/DevLight-Mobile-Agency) you can see open source work developed by Devlight LLC.  \nThis and another works is an exclusive property of Devlight LLC. \n\nIf you want to use this library in applications which will be available on Google Play, please report us about it or author of the library.\n\nWhether you're searching for a new partner or trusted team for creating your new great product we are always ready to start work with you. \n\nYou can contact us via info@devlight.io or opensource@devlight.io.  \nThanks in advance.\n\nDevlight LLC, 2016  \n[devlight.io](http://devlight.io) \n"
        },
        {
          "name": "app",
          "type": "tree",
          "content": null
        },
        {
          "name": "build.gradle",
          "type": "blob",
          "size": 0.470703125,
          "content": "// Top-level build file where you can add configuration options common to all sub-projects/modules.\n\nbuildscript {\n    repositories {\n        jcenter()\n        google()\n    }\n    dependencies {\n        classpath 'com.github.dcendents:android-maven-gradle-plugin:1.5'\n        classpath \"com.jfrog.bintray.gradle:gradle-bintray-plugin:1.7.3\"\n        classpath 'com.android.tools.build:gradle:3.1.2'\n    }\n}\n\nallprojects {\n    repositories {\n        jcenter()\n        google()\n    }\n}\n"
        },
        {
          "name": "gradle.properties",
          "type": "blob",
          "size": 0.8349609375,
          "content": "# Project-wide Gradle settings.\n\n# IDE (e.g. Android Studio) users:\n# Gradle settings configured through the IDE *will override*\n# any settings specified in this file.\n\n# For more details on how to configure your build environment visit\n# http://www.gradle.org/docs/current/userguide/build_environment.html\n\n# Specifies the JVM arguments used for the daemon process.\n# The setting is particularly useful for tweaking memory settings.\n# Default value: -Xmx10248m -XX:MaxPermSize=256m\n# org.gradle.jvmargs=-Xmx2048m -XX:MaxPermSize=512m -XX:+HeapDumpOnOutOfMemoryError -Dfile.encoding=UTF-8\n\n# When configured, Gradle will run in incubating parallel mode.\n# This option should only be used with decoupled projects. More details, visit\n# http://www.gradle.org/docs/current/userguide/multi_project_builds.html#sec:decoupled_projects\n# org.gradle.parallel=true"
        },
        {
          "name": "gradle",
          "type": "tree",
          "content": null
        },
        {
          "name": "gradlew",
          "type": "blob",
          "size": 4.9609375,
          "content": "#!/usr/bin/env bash\n\n##############################################################################\n##\n##  Gradle start up script for UN*X\n##\n##############################################################################\n\n# Add default JVM options here. You can also use JAVA_OPTS and GRADLE_OPTS to pass JVM options to this script.\nDEFAULT_JVM_OPTS=\"\"\n\nAPP_NAME=\"Gradle\"\nAPP_BASE_NAME=`basename \"$0\"`\n\n# Use the maximum available, or set MAX_FD != -1 to use that value.\nMAX_FD=\"maximum\"\n\nwarn ( ) {\n    echo \"$*\"\n}\n\ndie ( ) {\n    echo\n    echo \"$*\"\n    echo\n    exit 1\n}\n\n# OS specific support (must be 'true' or 'false').\ncygwin=false\nmsys=false\ndarwin=false\ncase \"`uname`\" in\n  CYGWIN* )\n    cygwin=true\n    ;;\n  Darwin* )\n    darwin=true\n    ;;\n  MINGW* )\n    msys=true\n    ;;\nesac\n\n# For Cygwin, ensure paths are in UNIX format before anything is touched.\nif $cygwin ; then\n    [ -n \"$JAVA_HOME\" ] && JAVA_HOME=`cygpath --unix \"$JAVA_HOME\"`\nfi\n\n# Attempt to set APP_HOME\n# Resolve links: $0 may be a link\nPRG=\"$0\"\n# Need this for relative symlinks.\nwhile [ -h \"$PRG\" ] ; do\n    ls=`ls -ld \"$PRG\"`\n    link=`expr \"$ls\" : '.*-> \\(.*\\)$'`\n    if expr \"$link\" : '/.*' > /dev/null; then\n        PRG=\"$link\"\n    else\n        PRG=`dirname \"$PRG\"`\"/$link\"\n    fi\ndone\nSAVED=\"`pwd`\"\ncd \"`dirname \\\"$PRG\\\"`/\" >&-\nAPP_HOME=\"`pwd -P`\"\ncd \"$SAVED\" >&-\n\nCLASSPATH=$APP_HOME/gradle/wrapper/gradle-wrapper.jar\n\n# Determine the Java command to use to start the JVM.\nif [ -n \"$JAVA_HOME\" ] ; then\n    if [ -x \"$JAVA_HOME/jre/sh/java\" ] ; then\n        # IBM's JDK on AIX uses strange locations for the executables\n        JAVACMD=\"$JAVA_HOME/jre/sh/java\"\n    else\n        JAVACMD=\"$JAVA_HOME/bin/java\"\n    fi\n    if [ ! -x \"$JAVACMD\" ] ; then\n        die \"ERROR: JAVA_HOME is set to an invalid directory: $JAVA_HOME\n\nPlease set the JAVA_HOME variable in your environment to match the\nlocation of your Java installation.\"\n    fi\nelse\n    JAVACMD=\"java\"\n    which java >/dev/null 2>&1 || die \"ERROR: JAVA_HOME is not set and no 'java' command could be found in your PATH.\n\nPlease set the JAVA_HOME variable in your environment to match the\nlocation of your Java installation.\"\nfi\n\n# Increase the maximum file descriptors if we can.\nif [ \"$cygwin\" = \"false\" -a \"$darwin\" = \"false\" ] ; then\n    MAX_FD_LIMIT=`ulimit -H -n`\n    if [ $? -eq 0 ] ; then\n        if [ \"$MAX_FD\" = \"maximum\" -o \"$MAX_FD\" = \"max\" ] ; then\n            MAX_FD=\"$MAX_FD_LIMIT\"\n        fi\n        ulimit -n $MAX_FD\n        if [ $? -ne 0 ] ; then\n            warn \"Could not set maximum file descriptor limit: $MAX_FD\"\n        fi\n    else\n        warn \"Could not query maximum file descriptor limit: $MAX_FD_LIMIT\"\n    fi\nfi\n\n# For Darwin, add options to specify how the application appears in the dock\nif $darwin; then\n    GRADLE_OPTS=\"$GRADLE_OPTS \\\"-Xdock:name=$APP_NAME\\\" \\\"-Xdock:icon=$APP_HOME/media/gradle.icns\\\"\"\nfi\n\n# For Cygwin, switch paths to Windows format before running java\nif $cygwin ; then\n    APP_HOME=`cygpath --path --mixed \"$APP_HOME\"`\n    CLASSPATH=`cygpath --path --mixed \"$CLASSPATH\"`\n\n    # We build the pattern for arguments to be converted via cygpath\n    ROOTDIRSRAW=`find -L / -maxdepth 1 -mindepth 1 -type d 2>/dev/null`\n    SEP=\"\"\n    for dir in $ROOTDIRSRAW ; do\n        ROOTDIRS=\"$ROOTDIRS$SEP$dir\"\n        SEP=\"|\"\n    done\n    OURCYGPATTERN=\"(^($ROOTDIRS))\"\n    # Add a user-defined pattern to the cygpath arguments\n    if [ \"$GRADLE_CYGPATTERN\" != \"\" ] ; then\n        OURCYGPATTERN=\"$OURCYGPATTERN|($GRADLE_CYGPATTERN)\"\n    fi\n    # Now convert the arguments - kludge to limit ourselves to /bin/sh\n    i=0\n    for arg in \"$@\" ; do\n        CHECK=`echo \"$arg\"|egrep -c \"$OURCYGPATTERN\" -`\n        CHECK2=`echo \"$arg\"|egrep -c \"^-\"`                                 ### Determine if an option\n\n        if [ $CHECK -ne 0 ] && [ $CHECK2 -eq 0 ] ; then                    ### Added a condition\n            eval `echo args$i`=`cygpath --path --ignore --mixed \"$arg\"`\n        else\n            eval `echo args$i`=\"\\\"$arg\\\"\"\n        fi\n        i=$((i+1))\n    done\n    case $i in\n        (0) set -- ;;\n        (1) set -- \"$args0\" ;;\n        (2) set -- \"$args0\" \"$args1\" ;;\n        (3) set -- \"$args0\" \"$args1\" \"$args2\" ;;\n        (4) set -- \"$args0\" \"$args1\" \"$args2\" \"$args3\" ;;\n        (5) set -- \"$args0\" \"$args1\" \"$args2\" \"$args3\" \"$args4\" ;;\n        (6) set -- \"$args0\" \"$args1\" \"$args2\" \"$args3\" \"$args4\" \"$args5\" ;;\n        (7) set -- \"$args0\" \"$args1\" \"$args2\" \"$args3\" \"$args4\" \"$args5\" \"$args6\" ;;\n        (8) set -- \"$args0\" \"$args1\" \"$args2\" \"$args3\" \"$args4\" \"$args5\" \"$args6\" \"$args7\" ;;\n        (9) set -- \"$args0\" \"$args1\" \"$args2\" \"$args3\" \"$args4\" \"$args5\" \"$args6\" \"$args7\" \"$args8\" ;;\n    esac\nfi\n\n# Split up the JVM_OPTS And GRADLE_OPTS values into an array, following the shell quoting and substitution rules\nfunction splitJvmOpts() {\n    JVM_OPTS=(\"$@\")\n}\neval splitJvmOpts $DEFAULT_JVM_OPTS $JAVA_OPTS $GRADLE_OPTS\nJVM_OPTS[${#JVM_OPTS[*]}]=\"-Dorg.gradle.appname=$APP_BASE_NAME\"\n\nexec \"$JAVACMD\" \"${JVM_OPTS[@]}\" -classpath \"$CLASSPATH\" org.gradle.wrapper.GradleWrapperMain \"$@\"\n"
        },
        {
          "name": "gradlew.bat",
          "type": "blob",
          "size": 2.259765625,
          "content": "@if \"%DEBUG%\" == \"\" @echo off\n@rem ##########################################################################\n@rem\n@rem  Gradle startup script for Windows\n@rem\n@rem ##########################################################################\n\n@rem Set local scope for the variables with windows NT shell\nif \"%OS%\"==\"Windows_NT\" setlocal\n\n@rem Add default JVM options here. You can also use JAVA_OPTS and GRADLE_OPTS to pass JVM options to this script.\nset DEFAULT_JVM_OPTS=\n\nset DIRNAME=%~dp0\nif \"%DIRNAME%\" == \"\" set DIRNAME=.\nset APP_BASE_NAME=%~n0\nset APP_HOME=%DIRNAME%\n\n@rem Find java.exe\nif defined JAVA_HOME goto findJavaFromJavaHome\n\nset JAVA_EXE=java.exe\n%JAVA_EXE% -version >NUL 2>&1\nif \"%ERRORLEVEL%\" == \"0\" goto init\n\necho.\necho ERROR: JAVA_HOME is not set and no 'java' command could be found in your PATH.\necho.\necho Please set the JAVA_HOME variable in your environment to match the\necho location of your Java installation.\n\ngoto fail\n\n:findJavaFromJavaHome\nset JAVA_HOME=%JAVA_HOME:\"=%\nset JAVA_EXE=%JAVA_HOME%/bin/java.exe\n\nif exist \"%JAVA_EXE%\" goto init\n\necho.\necho ERROR: JAVA_HOME is set to an invalid directory: %JAVA_HOME%\necho.\necho Please set the JAVA_HOME variable in your environment to match the\necho location of your Java installation.\n\ngoto fail\n\n:init\n@rem Get command-line arguments, handling Windowz variants\n\nif not \"%OS%\" == \"Windows_NT\" goto win9xME_args\nif \"%@eval[2+2]\" == \"4\" goto 4NT_args\n\n:win9xME_args\n@rem Slurp the command line arguments.\nset CMD_LINE_ARGS=\nset _SKIP=2\n\n:win9xME_args_slurp\nif \"x%~1\" == \"x\" goto execute\n\nset CMD_LINE_ARGS=%*\ngoto execute\n\n:4NT_args\n@rem Get arguments from the 4NT Shell from JP Software\nset CMD_LINE_ARGS=%$\n\n:execute\n@rem Setup the command line\n\nset CLASSPATH=%APP_HOME%\\gradle\\wrapper\\gradle-wrapper.jar\n\n@rem Execute Gradle\n\"%JAVA_EXE%\" %DEFAULT_JVM_OPTS% %JAVA_OPTS% %GRADLE_OPTS% \"-Dorg.gradle.appname=%APP_BASE_NAME%\" -classpath \"%CLASSPATH%\" org.gradle.wrapper.GradleWrapperMain %CMD_LINE_ARGS%\n\n:end\n@rem End local scope for the variables with windows NT shell\nif \"%ERRORLEVEL%\"==\"0\" goto mainEnd\n\n:fail\nrem Set variable GRADLE_EXIT_CONSOLE if you need the _script_ return code instead of\nrem the _cmd.exe /c_ return code!\nif  not \"\" == \"%GRADLE_EXIT_CONSOLE%\" exit 1\nexit /b 1\n\n:mainEnd\nif \"%OS%\"==\"Windows_NT\" endlocal\n\n:omega\n"
        },
        {
          "name": "navigationtabbar",
          "type": "tree",
          "content": null
        },
        {
          "name": "settings.gradle",
          "type": "blob",
          "size": 0.03515625,
          "content": "include ':app', ':navigationtabbar'\n"
        }
      ]
    }
  ]
}