{
  "metadata": {
    "timestamp": 1736608982400,
    "page": 191,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjIwMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "zongzibinbin/MallChat",
      "stars": 4113,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 1.083984375,
          "content": "\n### IntelliJ project files\n.idea/\n*.iml\n/target/*\n/**/target/\n\n\n# git\n*.orig\n.flattened-pom.xml\ndemo-api/.flattened-pom.xml\ndemo-client/.flattened-pom.xml\n\n# Log file\n*.log\n*_rpc_port.txt\n\n# BlueJ files\n*.ctxt\n\n\n# Package Files #\n*.jar\n*.war\n*.ear\n*.zip\n*.tar.gz\n*.rar\n\n# virtual machine crash logs, see http://www.java.com/en/download/help/error_hotspot.xml\nhs_err_pid*\n### macOS files\n# General\n.DS_Store\n.AppleDouble\n.LSOverride\n\n# Icon must end with two \\r\nIcon\n\n# Thumbnails\n._*\n\n# Files that might appear in the root of a volume\n.DocumentRevisions-V100\n.fseventsd\n.Spotlight-V100\n.TemporaryItems\n.Trashes\n.VolumeIcon.icns\n.com.apple.timemachine.donotpresent\n\n# Directories potentially created on remote AFP share\n.AppleDB\n.AppleDesktop\nNetwork Trash Folder\nTemporary Items\n.apdisk\n\n# Temporary File\n*CodeGenerator-Temporary\n*CodeGeneratorFile\n*temporary\n\nCodeGenerator.java\nTestController.java\napplication-my-prod.properties\napplication-remote-prod.properties\napplication-my-test.properties\nmybatis-generator-config.xml\nChannelBizRankClient.java\nChannelBizBrandWallClient.java\n/*/rebel.xml\n\n# yml\n*.yml\n"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 4.9208984375,
          "content": "\n# Contributor Covenant Code of Conduct\n\nEnglish | [简体中文](./CODE_OF_CONDUCT_CN.md)\n\n## Our Pledge\n\nWe as members, contributors, and leaders pledge to make participation in our\ncommunity a harassment-free experience for everyone, regardless of age, body\nsize, visible or invisible disability, ethnicity, sex characteristics, gender\nidentity and expression, level of experience, education, socio-economic status,\nnationality, personal appearance, race, caste, color, religion, or sexual\nidentity and orientation.\n\nWe pledge to act and interact in ways that contribute to an open, welcoming,\ndiverse, inclusive, and healthy community.\n\n## Our Standards\n\nExamples of behavior that contributes to a positive environment for our\ncommunity include:\n\n* Demonstrating empathy and kindness toward other people\n* Being respectful of differing opinions, viewpoints, and experiences\n* Giving and gracefully accepting constructive feedback\n* Accepting responsibility and apologizing to those affected by our mistakes,\n  and learning from the experience\n* Focusing on what is best not just for us as individuals, but for the overall\n  community\n\nExamples of unacceptable behavior include:\n\n* The use of sexualized language or imagery, and sexual attention or advances of\n  any kind\n* Trolling, insulting or derogatory comments, and personal or political attacks\n* Public or private harassment\n* Publishing others' private information, such as a physical or email address,\n  without their explicit permission\n* Other conduct which could reasonably be considered inappropriate in a\n  professional setting\n\n## Enforcement Responsibilities\n\nCommunity leaders are responsible for clarifying and enforcing our standards of\nacceptable behavior and will take appropriate and fair corrective action in\nresponse to any behavior that they deem inappropriate, threatening, offensive,\nor harmful.\n\nCommunity leaders have the right and responsibility to remove, edit, or reject\ncomments, commits, code, wiki edits, issues, and other contributions that are\nnot aligned to this Code of Conduct, and will communicate reasons for moderation\ndecisions when appropriate.\n\n## Scope\n\nThis Code of Conduct applies within all community spaces, and also applies when\nan individual is officially representing the community in public spaces.\nExamples of representing our community include using an official e-mail address,\nposting via an official social media account, or acting as an appointed\nrepresentative at an online or offline event.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be\nreported to the community leaders responsible for enforcement All complaints will be reviewed and investigated promptly and fairly.\n\nAll community leaders are obligated to respect the privacy and security of the\nreporter of any incident.\n\n## Enforcement Guidelines\n\nCommunity leaders will follow these Community Impact Guidelines in determining\nthe consequences for any action they deem in violation of this Code of Conduct:\n\n### 1. Correction\n\n**Community Impact**: Use of inappropriate language or other behavior deemed\nunprofessional or unwelcome in the community.\n\n**Consequence**: A private, written warning from community leaders, providing\nclarity around the nature of the violation and an explanation of why the\nbehavior was inappropriate. A public apology may be requested.\n\n### 2. Warning\n\n**Community Impact**: A violation through a single incident or series of\nactions.\n\n**Consequence**: A warning with consequences for continued behavior. No\ninteraction with the people involved, including unsolicited interaction with\nthose enforcing the Code of Conduct, for a specified period of time. This\nincludes avoiding interactions in community spaces as well as external channels\nlike social media. Violating these terms may lead to a temporary or permanent\nban.\n\n### 3. Temporary Ban\n\n**Community Impact**: A serious violation of community standards, including\nsustained inappropriate behavior.\n\n**Consequence**: A temporary ban from any sort of interaction or public\ncommunication with the community for a specified period of time. No public or\nprivate interaction with the people involved, including unsolicited interaction\nwith those enforcing the Code of Conduct, is allowed during this period.\nViolating these terms may lead to a permanent ban.\n\n### 4. Permanent Ban\n\n**Community Impact**: Demonstrating a pattern of violation of community\nstandards, including sustained inappropriate behavior, harassment of an\nindividual, or aggression toward or disparagement of classes of individuals.\n\n**Consequence**: A permanent ban from any sort of public interaction within the\ncommunity.\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenantversion 2.1][homepage],\n\nFor answers to common questions about this code of conduct, see [https://www.contributor-covenant.org/faq][FAQ]\n\n[homepage]: https://www.contributor-covenant.org/version/2/1/code_of_conduct.html\n[FAQ]: https://www.contributor-covenant.org/faq\n"
        },
        {
          "name": "CODE_OF_CONDUCT_CN.md",
          "type": "blob",
          "size": 3.810546875,
          "content": "\n# 贡献者公约\n\n[English](./CODE_OF_CONDUCT.md) | 简体中文\n\n## 我们的承诺\n\n身为社区成员、贡献者和领袖，我们承诺使社区参与者不受骚扰，无论其年龄、体型、可见或不可见的缺陷、族裔、性征、性别认同和表达、经验水平、教育程度、社会与经济地位、国籍、相貌、种族、种姓、肤色、宗教信仰、性倾向或性取向如何。\n\n我们承诺以有助于建立开放、友善、多样化、包容、健康社区的方式行事和互动。\n\n## 我们的准则\n\n有助于为我们的社区创造积极环境的行为例子包括但不限于：\n\n* 表现出对他人的同情和善意\n* 尊重不同的主张、观点和感受\n* 提出和大方接受建设性意见\n* 承担责任并向受我们错误影响的人道歉\n* 注重社区共同诉求，而非个人得失\n\n不当行为例子包括：\n\n* 使用情色化的语言或图像，及性引诱或挑逗\n* 嘲弄、侮辱或诋毁性评论，以及人身或政治攻击\n* 公开或私下的骚扰行为\n* 未经他人明确许可，公布他人的私人信息，如物理或电子邮件地址\n* 其他有理由认定为违反职业操守的不当行为\n\n## 责任和权力\n\n社区领袖有责任解释和落实我们所认可的行为准则，并妥善公正地对他们认为不当、威胁、冒犯或有害的任何行为采取纠正措施。\n\n社区领导有权力和责任删除、编辑或拒绝或拒绝与本行为准则不相符的评论（comment）、提交（commits）、代码、维基（wiki）编辑、议题（issues）或其他贡献，并在适当时机知采取措施的理由。\n\n## 适用范围\n\n本行为准则适用于所有社区场合，也适用于在公共场所代表社区时的个人。\n\n代表社区的情形包括使用官方电子邮件地址、通过官方社交媒体帐户发帖或在线上或线下活动中担任指定代表。\n\n## 监督\n\n辱骂、骚扰或其他不可接受的行为可通过社区群、微信公众号等向负责监督的社区领袖报告。\n所有投诉都将得到及时和公平的审查和调查。\n\n所有社区领袖都有义务尊重任何事件报告者的隐私和安全。\n\n## 处理方针\n\n社区领袖将遵循下列社区处理方针来明确他们所认定违反本行为准则的行为的处理方式：\n\n### 1. 纠正\n\n**社区影响**：使用不恰当的语言或其他在社区中被认定为不符合职业道德或不受欢迎的行为。\n\n**处理意见**：由社区领袖发出非公开的书面警告，明确说明违规行为的性质，并解释举止如何不妥。或将要求公开道歉。\n\n### 2. 警告\n\n**社区影响**：单个或一系列违规行为。\n\n**处理意见**：警告并对连续性行为进行处理。在指定时间内，不得与相关人员互动，包括主动与行为准则执行者互动。这包括避免在社区场所和外部渠道中的互动。违反这些条款可能会导致临时或永久封禁。\n\n### 3. 临时封禁\n\n**社区影响**: 严重违反社区准则，包括持续的不当行为。\n\n**处理意见**: 在指定时间内，暂时禁止与社区进行任何形式的互动或公开交流。在此期间，不得与相关人员进行公开或私下互动，包括主动与行为准则执行者互动。违反这些条款可能会导致永久封禁。\n\n### 4. 永久封禁\n\n**社区影响**：行为模式表现出违反社区准则，包括持续的不当行为、骚扰个人或攻击或贬低某个类别的个体。\n\n**处理意见**：永久禁止在社区内进行任何形式的公开互动。\n\n## 参见\n\n本行为准则改编自 [Contributor Covenant 2.1 版][homepage]。\n\n有关本行为准则的常见问题的答案，参见 [https://www.contributor-covenant.org/faq][FAQ]。\n\n[homepage]:  https://www.contributor-covenant.org/version/2/1/code_of_conduct.html\n[FAQ]: https://www.contributor-covenant.org/faq\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 11.0908203125,
          "content": "                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright [yyyy] [name of copyright owner]\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 9.9091796875,
          "content": "<p align=\"center\">\n    <a href=\"\" target=\"_blank\">\n      <img src=\"https://s1.ax1x.com/2023/07/02/pCDR0W4.png\" width=\"280\" />\n    </a>\n</p>\n\n<h1 align=\"center\">MallChat-抹茶</h1>\n<p align=\"center\"><strong>一个既能购物又能即时聊天的电商系统。致力于打造互联网企业级项目的最佳实践。<br>电商该有的购物车、订单、支付、推荐、搜索、拉新、促活、推送、物流、客服、它都必须有。<em>持续更新 ing～</em></strong></p>\n\n<div align=\"center\">\n <a href=\"#公众号\"><img src=\"https://img.shields.io/badge/公众号-程序员阿斌-blue.svg?style=plasticr\"></a>\n    <a href=\"#公众号\"><img src=\"https://img.shields.io/badge/交流群-加入开发-green.svg?style=plasticr\"></a>\n    <a href=\"https://github.com/zongzibinbin/MallChat\"><img src=\"https://img.shields.io/badge/github-项目地址-yellow.svg?style=plasticr\"></a>\n    <a href=\"https://gitee.com/zhongzhibinbin/MallChat\"><img src=\"https://img.shields.io/badge/码云-项目地址-orange.svg?style=plasticr\"></a>\n    <a href=\"https://github.com/Evansy/MallChatWeb\"><img src=\"https://img.shields.io/badge/前端-项目地址-blueviolet.svg?style=plasticr\"></a>\n    <a href=\"https://github.com/zongzibinbin/MallChat/commits\" target=\"_blank\"><br>\n    <a href=\"https://github.com/Evansy/MallChatWeb/actions/workflows/deploy.yml\" target=\"_blank\">\n        <img alt=\"Commit\" src=\"https://github.com/Evansy/MallChatWeb/actions/workflows/deploy.yml/badge.svg?branch=main\">\n    </a>\n    <a href=\"https://github.com/zongzibinbin/MallChat/commits\" target=\"_blank\">\n        <img alt=\"Commit\" src=\"https://img.shields.io/github/commit-activity/m/zongzibinbin/MallChat\"></a>\n    <a href=\"https://github.com/zongzibinbin/MallChat/issues\" target=\"_blank\">\n        <img alt=\"Issues\" src=\"https://img.shields.io/github/issues/zongzibinbin/MallChat\">\n    </a> \n    <a href=\"https://github.com/zongzibinbin/MallChat/blob/master/LICENSE\" target=\"_blank\">\n        <img alt=\"License: Apache-2.0\" src=\"https://img.shields.io/badge/License-Apache--2.0-blue.svg\">\n    </a> \n    <a href=\"https://github.com/zongzibinbin/MallChat/stargazers\" target=\"_blank\">\n        <img alt=\"License\" src=\"https://img.shields.io/github/stars/zongzibinbin/MallChat.svg?style=social\">\n    </a> \n    \n</div>\n\n## 项目导航\n\n- **快速体验地址**：[抹茶聊天首页](https://mallchat.cn)\n- **前端项目仓库**：[MallChatWeb](https://github.com/Evansy/MallChatWeb)\n- **项目视频记录**：[Bilibili地址](https://space.bilibili.com/146719540) 全程分享项目进度，功能选型的思考，同时征集迭代建议。\n- **项目学习文档**：10w+字，保姆级教学路线，环境搭建、核心功能、基建轮子、接口压测、问题记录、一个不落。可点击[抹茶项目文档](https://www.yuque.com/snab/planet/cef1mcko4fve0ur3)查看（内含500人交流大群）\n- **项目交流群**：对抹茶感兴趣的，可以加入[交流群](#公众号)。你的每一个举动，都会决定项目未来的方向。无论是提意见做产品经理，还是找bug做个测试人员，又或者加入开发小模块成为contributer，都欢迎你的加入。\n- **码云仓库**：[Gitee](https://gitee.com/zhongzhibinbin/MallChat)（国内访问速度更快）\n\n## 项目介绍\n\n抹茶聊天是一个IM项目，通过netty实现和前端的websocket连接。内含微信扫描登录，成员列表，消息列表，消息互动，丰富的消息类型，还有很多实用的小轮子列如aop日志，分布式锁注解，频控注解，ip解析归属地等，持续更新中。。。\n\n![p92nKne.png](./docs/image/项目大纲.jpg)\n\n![p92nKne.png](./docs/image/设计模式.jpg)\n\n### 项目演示\n\n#### C端项目\n\n- 前端源码地址：[https://github.com/Evansy/MallChatWeb](https://github.com/Evansy/MallChatWeb)\n- 项目演示地址：[https://mallchat.cn](https://mallchat.cn) (记住抹茶.cn，下次工作摸鱼可直接打开)\n\n![p92nKne.png](./docs/image/群聊截图.jpg)\n\n![p92nKne.png](./docs/image/复杂图片.jpg)\n\n### 技术选型\n\n#### 后端技术\n\n|        技术         | 说明                                       | 官网                                                         |\n| :-----------------: | ------------------------------------------ | ------------------------------------------------------------ |\n|     SpringBoot      | web开发必备框架                            | [https://spring.io/projects/spring-boot](https://spring.io/projects/spring-boot) |\n|       MyBatis       | ORM框架                                    | http://www.mybatis.org/mybatis-3/zh/index.html               |\n|     MyBatisPlus     | 零sql，简化数据库操作，分页插件            | [https://baomidou.com/](https://baomidou.com/)               |\n|        Redis        | 缓存加速，多数据结构支持业务功能           | [https://redis.io](https://redis.io)                         |\n|      Caffeine       | 本地缓存                                   | http://caffe.berkeleyvision.org/                             |\n|        Nginx        | 负载均衡，https配置，websocket升级，ip频控 | [https://nginx.org](https://nginx.org)                       |\n|       Docker        | 应用容器引擎                               | [https://www.docker.com](https://www.docker.com)             |\n|         Oss         | 对象存储                                   | [https://letsencrypt.org/](https://letsencrypt.org/)         |\n|         Jwt         | 用户登录，认证方案                         | [https://jwt.io](https://jwt.io)                             |\n|       Lombok        | 简化代码                                   | [https://projectlombok.org](https://projectlombok.org)       |\n|       Hutool        | Java工具类库                               | https://github.com/looly/hutool                              |\n|     Swagger-UI      | API文档生成工具                            | https://github.com/swagger-api/swagger-ui                    |\n| Hibernate-validator | 接口校验框架                               | [hibernate.org/validator/](hibernate.org/validator/)         |\n|        minio        | 自建对象存储                               | https://github.com/minio/minio                               |\n\n#### 前端技术\n\n前往[MallChatWeb](https://github.com/Evansy/MallChatWeb)查看\n\n### 环境搭建\n\n在项目目录下的`application.yml`修改自己的启动环境`spring.profiles.active` = `test`然后找到同级文件`application-test.properties`，填写自己的环境配置。[星球成员](https://www.yuque.com/snab/planet/cne0nel2hny8eu4i)提供一套测试环境配置，可直连\n\n### 项目文档\n\n保姆级教学路线，涵盖环境搭建、核心功能实现、基础架构构建、接口压力测试、问题记录以及项目的亮点。无一遗漏持续不断地更新中～  \n查看[项目文档](https://www.yuque.com/snab/planet/cef1mcko4fve0ur3)\n\n<div style=\"display: flex; align-items: center;\">\n  <img src=\"./docs/image/文档1.jpg\" alt=\"文档1\" width=\"50%\">\n  <img src=\"./docs/image/文档2.jpg\" alt=\"文档2\" width=\"47%\">\n</div>\n\n## star 趋势图\n\n![Stargazers over time](https://starchart.cc/zongzibinbin/MallChat.svg)\n\n## 贡献\n**贡献之前请先阅读[行为准则](CODE_OF_CONDUCT.md) 和 贡献指南。感谢所有为 MallChat 做过贡献的人!**\n\n#### 后端:\n\n<a href=\"https://github.com/zongzibinbin/MallChat/graphs/contributors\">\n  <img src=\"https://contrib.rocks/image?repo=zongzibinbin/MallChat\" />\n</a>  \n\n#### 前端:\n\n<a href=\"https://github.com/Evansy/MallChatWeb/graphs/contributors\">\n<img src=\"https://contrib.rocks/image?repo=Evansy/MallChatWeb\" />\n</a>\n\n<h4>优秀贡献者:</h4>\n\n<table>\n  <tr>\n    <th>类别</th>\n    <th>用户</th>\n    <th>贡献模块</th>\n  </tr>\n  <tr>\n    <td rowspan=\"3\">前端</td>\n    <td rowspan=\"3\">\n      <a href=\"https://github.com/LIjiAngChen8\"><img src=\"https://avatars.githubusercontent.com/u/48879481?v=4\" style=\" width: 80px; height: 80px;\"></a>\n    </td>\n    <td><a href=\"https://github.com/Evansy/MallChatWeb/pull/74\">图片、语音、文件类型消息收发</a></td>\n  </tr>\n  <tr>\n    <td><a href=\"https://github.com/Evansy/MallChatWeb/pull/50\">消息互动操作(撤回、点赞、删除)</a></td>\n  </tr>\n  <tr>\n    <td><a href=\"https://github.com/Evansy/MallChatWeb/pull/17\">虚拟列表</a></td>\n  </tr>\n  <tr>\n    <td rowspan=\"5\">后端</td>\n    <td rowspan=\"2\">\n      <a href=\"https://github.com/1045078399\"><img src=\"https://avatars.githubusercontent.com/u/82020261?v=4\" style=\" width: 80px; height: 80px;\"></a>\n    </td>\n    <td><a href=\"https://github.com/zongzibinbin/MallChat/pull/31\">DFA敏感词检测</a></td>\n  </tr>\n  <tr>\n    <td><a href=\"https://github.com/zongzibinbin/MallChat/pull/64\">OpenAI聊天机器人</a></td>\n  </tr>\n  <tr>\n    <td rowspan=\"1\">\n      <a href=\"https://github.com/xiaocairush\"><img src=\"https://avatars.githubusercontent.com/u/6416523?v=4\" style=\" width: 80px; height: 80px;\"></a>\n    </td>\n    <td><a href=\"https://github.com/zongzibinbin/MallChat/pull/99\">Ac自动机敏感词检测</a></td>\n  </tr>\n    <tr>\n    <td rowspan=\"1\">\n      <a href=\"https://github.com/linzhihan\"><img src=\"https://avatars.githubusercontent.com/u/58815955?v=4\" style=\" width: 80px; height: 80px;\"></a>\n    </td>\n    <td><a href=\"https://github.com/zongzibinbin/MallChat/pull/95\">限流编程式</a></td>\n  </tr>\n    <tr>\n    <td rowspan=\"1\">\n      <a href=\"https://github.com/zbzbzzz\"><img src=\"https://avatars.githubusercontent.com/u/42697182?v=4\" style=\" width: 80px; height: 80px;\"></a>\n    </td>\n    <td><a href=\"https://github.com/zongzibinbin/MallChat/pull/82\">握手认证</a></td>\n  </tr>\n</table>\n\n\n\n\n\n## License\n[Apache License 2.0](./LICENSE)\n## 公众号\n\n微信搜索 **阿斌Java之路** 关注我的原创公众号，后台回复「**抹茶**」即可加入抹茶交流群，一些做过公司万人群聊，高并发的小伙伴都在里面讨论方案。公众号也会经常更新项目相关的文档，等你来撩~~\n\n![p9211Ag.png](https://s1.ax1x.com/2023/05/15/p9211Ag.png)\n"
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "mallchat-chat-server",
          "type": "tree",
          "content": null
        },
        {
          "name": "mallchat-tools",
          "type": "tree",
          "content": null
        },
        {
          "name": "pom.xml",
          "type": "blob",
          "size": 5.779296875,
          "content": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<project xmlns=\"http://maven.apache.org/POM/4.0.0\"\n         xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\n         xsi:schemaLocation=\"http://maven.apache.org/POM/4.0.0 http://maven.apache.org/xsd/maven-4.0.0.xsd\">\n    <modelVersion>4.0.0</modelVersion>\n\n    <groupId>com.abin.mallchat</groupId>\n    <artifactId>mallchat</artifactId>\n    <version>1.0-SNAPSHOT</version>\n    <modules>\n        <module>mallchat-chat-server</module>\n        <module>mallchat-tools</module>\n    </modules>\n    <packaging>pom</packaging>\n\n    <parent>\n        <groupId>org.springframework.boot</groupId>\n        <artifactId>spring-boot-starter-parent</artifactId>\n        <version>2.6.7</version>\n        <relativePath/> <!-- lookup parent from repository -->\n    </parent>\n\n    <properties>\n        <project.build.sourceEncoding>UTF-8</project.build.sourceEncoding>\n        <project.reporting.outputEncoding>UTF-8</project.reporting.outputEncoding>\n        <java.version>1.8</java.version>\n        <skipTests>true</skipTests>\n        <docker.host>http://192.168.3.101:2375</docker.host>\n        <hutool.version>5.8.18</hutool.version>\n        <springfox-swagger.version>3.0.0</springfox-swagger.version>\n        <swagger-models.version>1.6.0</swagger-models.version>\n        <mybatis-plus-generator.version>3.4.1</mybatis-plus-generator.version>\n        <mybatis.version>3.5.10</mybatis.version>\n        <mysql-connector.version>8.0.29</mysql-connector.version>\n        <spring-data-commons.version>2.7.5</spring-data-commons.version>\n        <jjwt.version>0.9.1</jjwt.version>\n        <logstash-logback.version>7.2</logstash-logback.version>\n        <minio.version>8.4.5</minio.version>\n        <jaxb-api.version>2.3.1</jaxb-api.version>\n        <lombok.version>1.18.10</lombok.version>\n        <netty-all.version>4.1.76.Final</netty-all.version>\n        <weixin-java-mp.version>4.4.0</weixin-java-mp.version>\n        <mybatis-plus-boot-starter.version>3.4.0</mybatis-plus-boot-starter.version>\n        <jsoup.version>1.15.3</jsoup.version>\n        <okhttp.version>4.8.1</okhttp.version>\n        <redisson-spring-boot-starter.version>3.17.1</redisson-spring-boot-starter.version>\n    </properties>\n\n    <dependencyManagement>\n        <dependencies>\n            <dependency>\n                <groupId>com.abin.mallchat</groupId>\n                <artifactId>mallchat-common-starter</artifactId>\n                <version>${version}</version>\n            </dependency>\n            <dependency>\n                <groupId>com.abin.mallchat</groupId>\n                <artifactId>mallchat-oss-starter</artifactId>\n                <version>${version}</version>\n            </dependency>\n            <dependency>\n                <groupId>com.abin.mallchat</groupId>\n                <artifactId>mallchat-transaction</artifactId>\n                <version>${version}</version>\n            </dependency>\n            <dependency>\n                <groupId>com.squareup.okhttp3</groupId>\n                <artifactId>okhttp</artifactId>\n                <version>${okhttp.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.jsoup</groupId>\n                <artifactId>jsoup</artifactId>\n                <version>${jsoup.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>com.baomidou</groupId>\n                <artifactId>mybatis-plus-boot-starter</artifactId>\n                <version>${mybatis-plus-boot-starter.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.projectlombok</groupId>\n                <artifactId>lombok</artifactId>\n                <version>${lombok.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>com.github.binarywang</groupId>\n                <artifactId>weixin-java-mp</artifactId>\n                <version>${weixin-java-mp.version}</version>\n            </dependency>\n            <!-- netty -->\n            <dependency>\n                <groupId>io.netty</groupId>\n                <artifactId>netty-all</artifactId>\n                <version>${netty-all.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>cn.hutool</groupId>\n                <artifactId>hutool-all</artifactId>\n                <version>${hutool.version}</version>\n            </dependency>\n            <!-- MyBatis-->\n            <dependency>\n                <groupId>org.mybatis</groupId>\n                <artifactId>mybatis</artifactId>\n                <version>${mybatis.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>com.baomidou</groupId>\n                <artifactId>mybatis-plus-generator</artifactId>\n                <version>${mybatis-plus-generator.version}</version>\n            </dependency>\n            <!--Mysql数据库驱动-->\n            <dependency>\n                <groupId>mysql</groupId>\n                <artifactId>mysql-connector-java</artifactId>\n                <version>${mysql-connector.version}</version>\n            </dependency>\n            <!--JWT(Json Web Token)登录支持-->\n            <dependency>\n                <groupId>io.jsonwebtoken</groupId>\n                <artifactId>jjwt</artifactId>\n                <version>${jjwt.version}</version>\n            </dependency>\n            <!-- 阿里云OSS -->\n            <dependency>\n                <groupId>io.minio</groupId>\n                <artifactId>minio</artifactId>\n                <version>${minio.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.redisson</groupId>\n                <artifactId>redisson-spring-boot-starter</artifactId>\n                <version>${redisson-spring-boot-starter.version}</version>\n            </dependency>\n        </dependencies>\n    </dependencyManagement>\n\n</project>"
        }
      ]
    }
  ]
}