{
  "metadata": {
    "timestamp": 1736708627146,
    "page": 956,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjk3MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "reneargento/algorithms-sedgewick-wayne",
      "stars": 2276,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.3310546875,
          "content": "*.class\n\n# Mobile Tools for Java (J2ME)\n.mtj.tmp/\n\n# Package Files #\n*.war\n*.ear\n\n# IDE\n.classpath\n.idea/\n.project\n.settings/\nbin/\nAlgorithmsBookExercises.iml\n\n# virtual machine crash logs, see http://www.java.com/en/download/help/error_hotspot.xml\nhs_err_pid*\n\n# Google Drive API credentials\ntokens/\nsrc/util/google/drive/credentials.json"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.0439453125,
          "content": "MIT License\n\nCopyright (c) 2017 Rene Argento\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"
        },
        {
          "name": "README.ch.md",
          "type": "blob",
          "size": 1.3603515625,
          "content": "# 算法\n本项目为 Robert Sedgewick 和 Kevin Wayne 所著的《算法》第四版课后问题的解答。\n\n- [English](README.md)\n- [简体中文](README.ch.md)\n\n<a href=\"url\"><img src=\"resources/book_cover.png\" align=\"right\" height=\"280\" width=\"200\" ></a>\n\n我认为《算法》这本书是一个非常好的学习算法和数据结构的资源。但是在网上课后习题解答的资源却很少或者部分答案并不完整。所以我决定把自己对练习的解答公布出来，希望能帮助学这本书的学生和专家能检验他们自己的答案并能有更多的收获。\n\n据我所知，这些解答都是正确的。<br/>\n如果你发现有什么不对的解答，随时欢迎你建一个issue 或者建一个pull request 来帮助修正。\n\n很多大学都在使用这些练习作为课后作业。如果这些习题是你的作业，请确保你自己已经理解了对应的题目和答案，而不是简单地复制答案。这样将会对你的职业生涯带来很大的好处。\n\n这个项目的答案基于2015年12月的第七次印刷的英文版本，如果是其他批次（特别是比较老的习题）比较印刷的，习题的顺序可能是有一点差别。\n\n<b>2018年11月26日 更新 </b></br>\n在花了我两年半的时间后，这个项目终于完成了！<br/>\n现在书里所有的问题的答案你都可以在这个项目里找到了！\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 1.474609375,
          "content": "# Algorithms\nSolutions to the exercises of the Algorithms book by Robert Sedgewick and Kevin Wayne (4th editon).\n\n- [English](README.md)\n- [简体中文](README.ch.md)\n\n<a href=\"url\"><img src=\"resources/book_cover.png\" align=\"right\" height=\"280\" width=\"200\" ></a>\n\nI found the book to be an excellent resource to learning algorithms and data structures. Since there are not many (almost none) solutions of the exercises on the Internet and the only ones available are incomplete, I decided to share my work on the exercises. Hopefully this will help students and professionals to validate their exercise solutions and learn more about the book content.\n\nTo the best of my knowledge, these solutions are correct.</br>\nIf you find anything incorrect feel free to create an issue or to open a pull request. \n\nMany of these exercises are used as homework assignments in universities. If you have to do any of these exercises as homework make sure you understand the problem and solution instead of simply copying it. Understanding these algorithms and data structures will be extremelly valuable in your career.\n\nThe exercises answered on this repository are based on the seventh printing of the book (of September 2015).\nOther printings of the book (especially older ones) may have exercises in a slightly different order.\n\n<b>Update (November 26 2018):</b></br>\nIt took me 2 and a half years of work, but the repository is now complete!</br>\nYou can now find here the solutions to all the exercises in the book.\n"
        },
        {
          "name": "lib",
          "type": "tree",
          "content": null
        },
        {
          "name": "resources",
          "type": "tree",
          "content": null
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}