{
  "metadata": {
    "timestamp": 1736609008016,
    "page": 231,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjI0MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "geoserver/geoserver",
      "stars": 3913,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 1.8232421875,
          "content": "# Java sources\n*.java          text diff=java\n*.kt            text diff=java\n*.groovy        text diff=java\n*.scala         text diff=java\n*.gradle        text diff=java\n*.gradle.kts    text diff=java\n\n# These files are text and should be normalized (Convert crlf => lf)\n*.css           text diff=css\n*.scss          text diff=css\n*.sass          text\n*.df            text\n*.htm           text diff=html\n*.html          text diff=html\n*.js            text\n*.jsp           text\n*.jspf          text\n*.jspx          text\n*.properties    text\n*.tld           text\n*.tag           text\n*.tagx          text\n*.xml           text\n*.xsd           text\n*.sld           text\n*.csv           text\n*.jjt           text\n*.prj           text\n*.apt           text\n*.md            text\n*.pgw           text\n*.jgw           text\n*.txt           text\n*.rst           text\n*.ftl           text\n\n# These files are binary and should be left untouched\n# (binary is a macro for -text -diff)\n*.class         binary\n*.dll           binary\n*.ear           binary\n*.jar           binary\n*.so            binary\n*.war           binary\n*.jks           binary\n*.shp           binary\n*.shx           binary\n*.dbf           binary\n*.qix           binary\n*.fix           binary\n*.tiff          binary\n*.tif           binary\n*.jpg           binary\n*.jpeg          binary\n*.png           binary\n*.zip           binary\n*.pdf           binary\n*.db            binary\n*.ecw           binary\n*.fgb           binary\n*.gif           binary\n*.gpkg          binary\n*.grb2          binary\n*.grib2         binary\n*.gz            binary\n*.img           binary\n*.jgrass        binary\n*.jp2           binary\n*.mbtiles       binary\n*.msk           binary\n*.ovr           binary\n*.pbf           binary\n*.pdf           binary\n*.sid           binary\n*.tpk           binary\n*.ttf           binary\n*.wkb           binary\n\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.7275390625,
          "content": "build-full.bat\ntarget\n.settings\n.classpath\n.factorypath\n.project\n.metadata\n.DS_Store\n*.class\n*.pyc\n\n/.metadata/\n\n# Intellij\n.idea/\n*.iml\n\n# Cucumber Testing artifacts\ncucumber-report\n.mvn\n\n# staging release artifacts\ndistribution/\nsettings.xml\n\n# NSG CITE testst data directory\ndata/citensg-1.0/gwc/cite*\ndata/citensg-1.0/gwc/geowebcache_*.bak\ndata/citensg-1.0/legendsamples/\ndata/citensg-1.0/logs/geoserver.log\n\n# cite tests logs directory\nbuild/cite/logs\n\n# https://bugs.openjdk.java.net/browse/JDK-8214300\n.attach_pid*\n\n# Windows installer related stuff\nsrc/release/installer/win/*.rtf\nsrc/release/installer/win/source/\nsrc/release/installer/win/target/\n\n# spotless up to date checks\n.spotless-index\n\n# Eclipse stuff\nsrc/web/app/.temp-Start*\n"
        },
        {
          "name": "CITATION.cff",
          "type": "blob",
          "size": 3.349609375,
          "content": "# This CITATION.cff file was generated with cffinit.\n# Visit https://bit.ly/cffinit to generate yours today!\n\ncff-version: 1.2.0\ntitle: GeoServer\nmessage: >-\n  If you use this software, please cite it using the\n  metadata from this file.\ntype: software\nauthors:\n  - given-names: Andrea\n    family-names: Aime\n    affiliation: GeoSolutions It\n  - given-names: Alessio\n    family-names: Fabiani\n    affiliation: GeoSolutions It\n  - given-names: Brad\n    family-names: Hards\n  - given-names: Nils\n    family-names: Bühner\n  - given-names: Daniele\n    family-names: Romagnoli\n    affiliation: GeoSolutions It\n  - given-names: Emanuele\n    family-names: Tajariol\n    affiliation: GeoSolutions It\n  - given-names: Fernando\n    family-names: Miño\n    affiliation: GeoSolutions It\n  - given-names: Gabriel\n    family-names: Roldan\n    affiliation: Camptocamp\n  - given-names: Ian\n    family-names: Turton\n    orcid: 'https://orcid.org/0000-0001-5631-6491'\n  - given-names: James\n    family-names: Hughes\n  - given-names: Jody\n    family-names: Garnett\n    affiliation: GeoCat BV\n    email: jody.garnett@gmail.com\n    orcid: 'https://orcid.org/0009-0003-1298-7113'\n  - given-names: Josh\n    family-names: Fix\n  - given-names: Jukka\n    family-names: Rahkonen\n  - given-names: Mark\n    family-names: Prins\n    orcid: 'https://orcid.org/0009-0006-1942-7903'\n    affiliation: B3Partners\n  - given-names: Nuno\n    family-names: Oliveira\n    affiliation: GeoSolutions It\n  - given-names: Peter\n    family-names: Rushforth\n  - given-names: Alessandro\n    family-names: Parma\n    affiliation: GeoSolutions It\n  - given-names: Steve\n    family-names: Ikeoka\n  - given-names: Simone\n    family-names: Giannecchini\n    affiliation: GeoSolutions It\n  - given-names: Kevin\n    family-names: Smith\n    affiliation: Vivid Solutions\n  - given-names: Torben\n    family-names: Barsballe\n    affiliation: Planet Federal\n  - name: GeoSolutions SRL\n    city: Camaiore\n    country: IT\n    post-code: '55041'\n    address: Via Carignoni 51\n    location: Lucca\n    region: Tuscany\n    tel: '+390584962313'\n    fax: '+390584660272'\n    website: 'https://www.geosolutionsgroup.com/'\n    email: info@geosolutionsgroup.com\n  - name: GeoCat BV\n    address: Veenderweg 13\n    city: Bennekom\n    country: NL\n    post-code: 6721 WD\n    tel: +31 (0) 318 416 664\n    website: 'https://www.geocat.net/'\n    email: info@geocat.net\n  - name: Open Source Geospatial Foundation\n    address: '9450 SW Gemini Dr. #42523'\n    location: Beaverton\n    region: Oregon\n    post-code: '97008'\n    country: US\n    email: info@osgeo.org\n    website: 'https://www.osgeo.org/'\nrepository-code: 'http://github.com/geoserver/geoserver'\nurl: 'https://geoserver.org'\nrepository-artifact: 'https://sourceforge.net/projects/geoserver/files/GeoServer'\nabstract: >-\n  Java web application to share and edit geospatial data.\n  Publish from any major spatial data source using open\n  standards. GeoServer implements industry standard OGC\n  protocols such as Web Feature Service (WFS), Web Map\n  Service (WMS), and Web Coverage Service (WCS). Additional\n  formats and publication options are available as\n  extensions including Web Processing Service (WPS), and Web\n  Map Tile Service (WMTS).\nkeywords:\n  - GIS\n  - webapping\n  - WMS\n  - WFS\n  - WCS\n  - WPS\n  - OGC\n  - standards\n  - spatial\n  - mapping\n  - open geospatial consortium\n  - open source geospatial foundation\n  - osgeo\nlicense: GPL-2.0\n"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 3.3740234375,
          "content": "# Contributor Covenant Code of Conduct\n\n## Our Pledge\n\nIn the interest of fostering an open and welcoming environment, we as\ncontributors and maintainers pledge to making participation in our project and\nour community a harassment-free experience for everyone, regardless of age, body\nsize, disability, ethnicity, sex characteristics, gender identity and expression,\nlevel of experience, education, socio-economic status, nationality, personal\nappearance, race, religion, or sexual identity and orientation.\n\n## Our Standards\n\nExamples of behavior that contributes to creating a positive environment\ninclude:\n\n* Using welcoming and inclusive language\n* Being respectful of differing viewpoints and experiences\n* Gracefully accepting constructive criticism\n* Focusing on what is best for the community\n* Showing empathy towards other community members\n\nExamples of unacceptable behavior by participants include:\n\n* The use of sexualized language or imagery and unwelcome sexual attention or\n advances\n* Trolling, insulting/derogatory comments, and personal or political attacks\n* Public or private harassment\n* Publishing others' private information, such as a physical or electronic\n address, without explicit permission\n* Other conduct which could reasonably be considered inappropriate in a\n professional setting\n\n## Our Responsibilities\n\nProject maintainers are responsible for clarifying the standards of acceptable\nbehavior and are expected to take appropriate and fair corrective action in\nresponse to any instances of unacceptable behavior.\n\nProject maintainers have the right and responsibility to remove, edit, or\nreject comments, commits, code, wiki edits, issues, and other contributions\nthat are not aligned to this Code of Conduct, or to ban temporarily or\npermanently any contributor for other behaviors that they deem inappropriate,\nthreatening, offensive, or harmful.\n\n## Scope\n\nThis Code of Conduct applies both within project spaces and in public spaces\nwhen an individual is representing the project or its community. Examples of\nrepresenting a project or community include using an official project e-mail\naddress, posting via an official social media account, or acting as an appointed\nrepresentative at an online or offline event. Representation of a project may be\nfurther defined and clarified by project maintainers.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be\nreported by contacting the project team via simone.giannecchini@geo-solutions.it .\nor by contacting the Open Source Geospatial Foundation at conduct-report@osgeo.org .\nAll complaints will be reviewed and investigated and will result in a response that\nis deemed necessary and appropriate to the circumstances. The project team is\nobligated to maintain confidentiality with regard to the reporter of an incident.\nFurther details of specific enforcement policies may be posted separately.\n\nProject maintainers who do not follow or enforce the Code of Conduct in good\nfaith may face temporary or permanent repercussions as determined by other\nmembers of the project's leadership.\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant][homepage], version 1.4,\navailable at https://www.contributor-covenant.org/version/1/4/code-of-conduct.html\n\n[homepage]: https://www.contributor-covenant.org\n\nFor answers to common questions about this code of conduct, see\nhttps://www.contributor-covenant.org/faq\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 9.9189453125,
          "content": "# Contributing\n\nWhen submitting pull request:\n\n* **Small Contribution / Single Source Code File:** For a small change to a single source file a project committer can review and apply the change on your behalf. This is a quick workaround allowing us to correct spelling mistakes in the documentation, clarify a javadoc, or accept a very small fix.\n\n  We understand that fixing a single source file may require changes to several test case files to verify the fix addresses its intended problem.\n\n* **Large Contributions / Multiple Files / New Files:** To  contribute a new file, or if your change effects several files, sign a [Code Contribution License]( http://docs.geoserver.org/latest/en/developer/policies/committing.html). It does not take long and you can send it via email.\n   * [Corporate contributor license](https://www.osgeo.org/resources/corporate-contributor-license/)\n   * [Individual contributor license](https://www.osgeo.org/resources/individual-contributor-license/)\n\nThis agreement can be printed, signed, scanned, and emailed to [info@osgeo.org](mailto:info@osgeo.org) at the Open Source Geospatial Foundation (OSGeo). [OSGeo](https://www.osgeo.org/about/)\nis the non-profit which holds the GeoServer codebase for the community.\n\nFor more information, please review the section on  [submitting pull requests](http://docs.geoserver.org/latest/en/developer/policies/pull_request.html) and [making commits](http://docs.geoserver.org/latest/en/developer/policies/committing.html).\n\n## Pull Requests\n\nIssuing a pull request requires that you [fork the GeoServer git repository](https://github.com/geoserver/geoserver) into\nyour own account.\n\nAssuming that `origin` points to your GitHub repository then the workflow becomes:\n\n1. Make the change.\n\n```\n   git checkout -b my_bugfix main\n   git add .\n   git commit -m \"fixed bug xyz\"\n```\n2. Push the change up to your GitHub repository.\n```\n   git push origin my_bugfix\n```\n3. Visit your GitHub repository page and issue the pull request.\n\n4. At this point the core developers will be notified of the pull request and review it at the earliest convenience. Core developers will review the patch and might require changes or improvements to it; it will be up to the submitter to amend the pull request and keep it alive until it gets merged.\n\n> Please be patient, pull requests are often reviewed in spare time so turn-around can be a little slow. If a pull request becomes stale with no feedback from the submitter for a couple of months, it will linked to from a JIRA issue (to avoid losing the partial work) and then be closed.\n\n## Pull Request Guidelines\n\nThe following guidelines are meant to ensure that your pull request is as easy as possible to  review.\n\n* Ensure your IDE/editor is properly configured\n\n  Ensure that your development environment is properly configured for GeoServer development. A common issue is a text editor is configured to use tabs rather than spaces.\n\n* Include only relevant changes\n\n  Ensure the patch only contains changes relevant to the issue you are trying to fix. A common mistake is  to include whitespace and formatting changes along with the relevant changes. These changes, while they  may seem harmless, make the patch much harder to read.\n\n* Fix one thing at a time\n\n  Do not batch up multiple unrelated changes into a single patch. If you want to fix multiple issues work on them separately and submit separate patches for them.\n\n* Always add a test\n\n  Given a large code base, the large number of external contributors, and the fast evolution of the code base, tests are really the only line of defense against accidental breakage of the contributed functionality. That is why we always demand to have at least one test, it's not a \"punishment\", but a basic guarantee your changes will still be there, and working, in future releases.\n\n* Referer to a Jira ticket from the commit message\n\n  Release managers generate a changelog by checking the tickets resolved for a given target version, if there is none, your contribution won't show up. So always create a ticket associated to your commits, and refer to it from your commit message.\n\n* Be patient\n\n  The core developers review community patches in spare time. Be cognizant of this and realize that just  as you are contributing your own free time to the project, so is the developer who is reviewing and applying your patch.\n\n* Tips\n\n  Include a test case that shows your patch fixes an issue (or adds new functionality). If you do not include a test case the developer reviewing your work will need to create one.\n\n  [JIRA Issue](https://osgeo-org.atlassian.net/projects/GEOS/issues) are used to list your fix in the release notes each release. You can link to the JIRA ticket in your pull request description.\n\n## Commit Guidelines\n\nGeoServer does not have much in the way of strict commit policies. Our current conventions are:\n\n1. **Add copyright headers:**\n   * Remember to add a copyright header with the year of creation to any new file. As an example, if you are adding a file in 2018 the copyright header would be:\n\n   ```\n   /* (c) 2018 Open Source Geospatial Foundation - all rights reserved\n    * This code is licensed under the GPL 2.0 license, available at the root\n    * application directory.\n    */\n   ```\n\n   * If you are modifying an existing file that does not have a copyright header, add one as above.\n\n   * Updates to existing files with copyright headers do not require updates to the copyright year.\n\n   * When adding content from another organisation maintain copyright history and original license. Only add Open Source Geospatial Foundation if you have made modifications to the file for GeoServer:\n\n   ```\n   /* (c) 2016 Open Source Geospatial Foundation - all rights reserved\n    * (c) 2014 OpenPlans\n    * (c) 2008-2010 GeoSolutions\n    *\n    * This code is licensed under the GPL 2.0 license, available at the root\n    * application directory.\n    *\n    * Original from GeoWebCache 1.5.1 under a LGPL license\n    */\n   ```\n\n   In a rare case (as when asking to migrate content from GeoTools) you can obtain permission to change the license to our GPL 2.0 license.\n\n2. **Do not commit large amounts of binary data:** In general do not commit any binary data to the repository. There are cases where it is appropriate like some data for a test case, but in these cases the files should be kept as small as possible.\n\n3. **Do not commit jars or libs, use Maven instead:** In general never commit a depending library directly into the repository, this is what we use Maven for. If you have a jar that is not present in any maven repositories, ask on the developer list to get it uploaded to one of the project maven repositories.\n\n4. **Ensure code is properly formatted:** We follow the [Google formatting conventions](https://google.github.io/styleguide/javaguide.html) with the AOSP variant (4 spaces indent instead of 2).\n   \n   The [google-java-format project](https://github.com/google/google-java-format) offers plugins for various IDEs. If your IDE is not supported, please just build once on the command line before committing.\n\n## Community commit access\n\nThe first stage of access allows a developer to commit only to the community\nmodule or extension for which they are the maintainer. This stage of access can\nbe obtained quite easily.\n\nThe process of getting community commit access is as follows:\n\n1. **Email the developer list:** This first step is all about communication. In order to grant commit access the other developers on the project must first know what the intention is. Therefore any developer looking for commit access must first describe what they want to commit (usually a community module), and what it does.\n\n2. **Sign up for a GitHub account:** GeoServer source code is hosted on Github and you'll need an account in order to access it. You can sign-up [here](https://github.com/signup/).\n\n3. **Print, sign, scan and send the contributor agreement:**\n\n   * [corporate_contributor.pdf](https://www.osgeo.org/wp-content/uploads/corporate_contributor.pdf)\n   * [individual_contributor.pdf](https://www.osgeo.org/wp-content/uploads/individual_contributor.pdf)\n\n   Scanned assignment agreement can be emailed to [info@osgeo.org](mailto:info@osgeo.org) at OpenPlans.\n\n   The [contribution licenses](https://www.osgeo.org/about/licenses/) are used by OSGeo projects seeking to assign copyright directly to the foundation. These licenses are directly derived from the Apache code contribution licenses (CLA V2.0 and CCLA v r190612).\n\n4. **Notify the developer list:** After a developer has signed up on Github they must notify the developer list. A project despot will then add them to the group of GeoServer committers and grant write access to the canonical repository.\n\n5. **Fork the canonical GeoServer repository:** All committers maintain a fork of the GeoServer repository that they work from. Fork the canonical repository into your own account.\n\n6. **Configure your local setup:** Follow this [guide](http://docs.geoserver.org/latest/en/developer/source.html#source) in the developer manual.\n\n### Core commit access\n\nThe second allows a developer to make commits to the core modules of geoserver.\nBeing granted this stage of access takes time, and is obtained only after the\ndeveloper has gained the trust of the other core committers.\n\nThe process of obtaining core commit access is far less mechanical than the one\nto obtain community commit access. It is based solely on trust. To obtain core\ncommit access a developer must first obtain the trust of the other core\ncommitters.\n\nThe way this is typically done is through continuous code review of patches.\nAfter a developer has submitted enough patches that have been met with a\npositive response, and those patches require little modifications, the\ndeveloper will be nominated for core commit access.\n\nThere is no magic number of patches that make the criteria, it is based mostly\non the nature of the patches, how in depth they are, etc... Basically it\nboils down to the developer being able to show that they understand the code base\nwell enough to not seriously break anything.\n"
        },
        {
          "name": "LICENSE.md",
          "type": "blob",
          "size": 27.9873046875,
          "content": "# GeoServer License Notice\n\nGeoServer is distributed under the GNU General Public License Version 2.0 license:\n\n    GeoServer, open geospatial information server\n    Copyright (C) 2014-2020 Open Source Geospatial Foundation.\n    Copyright (C) 2001-2014 OpenPlans\n    \n    This program is free software; you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation; either version 2 of the License, or\n    (at your option) any later version (collectively, \"GPL\").\n    \n    As an exception to the terms of the GPL, you may copy, modify,\n    propagate, and distribute a work formed by combining GeoServer with the\n    EMF, XSD and OSHI Libraries, or a work derivative of such a combination, even if\n    such copying, modification, propagation, or distribution would otherwise\n    violate the terms of the GPL. Nothing in this exception exempts you from\n    complying with the GPL in all respects for all of the code used other\n    than the EMF, XSD and OSHI Libraries. You may include this exception and its grant\n    of permissions when you distribute GeoServer.  Inclusion of this notice\n    with such a distribution constitutes a grant of such permissions.  If\n    you do not wish to grant these permissions, remove this paragraph from\n    your distribution. \"GeoServer\" means the GeoServer software licensed\n    under version 2 or any later version of the GPL, or a work based on such\n    software and licensed under the GPL. \"EMF, XSD and OSHI Libraries\" means \n    Eclipse Modeling Framework Project and XML Schema Definition software\n    distributed by the Eclipse Foundation and the OSHI library, all licensed \n    under the Eclipse Public License Version 1.0 (\"EPL\"), or a work based on \n    such software and licensed under the EPL.\n    \n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n    \n    You should have received a copy of the GNU General Public License\n    along with this program; if not, write to the Free Software\n    Foundation, Inc., 51 Franklin Street, Suite 500, Boston, MA 02110-1335  USA\n\nFor latest contact information of Open Source Geospatial Foundation see the website at\nhttps://www.osgeo.org.  Current email is info@osgeo.org and address is OSGeo, 14525 SW Millikan #42523, Beaverton, Oregon, United States, 97005-2343.\n\nThe full GPL license is available in [licenses/GPL](licenses/GPL.md)\n\n## Additional Libraries and Code used\n\nGeoServer uses several additional libraries and pieces of code.  We are \nincluding the appropriate notices in this file.  We'd like to thank all\nthe creators of the libraries we rely on, GeoServer would certainly not\nbe possible without them.  There are also several LGPL libraries that do\nnot require us to cite them, but we'd like to thank GeoTools - \nhttps://geotools.org, JTS - https://locationtech.github.io/jts/\n WKB4J https://wkb4j.sourceforge.net, OpenPDF - https://github.com/LibrePDF/OpenPDF,\nand J. David Eisenberg's PNG encoder https://www.catcode.com/pngencoder/\n\n### NeuQuant Neural-Net Quantization Algorithm\n\nGeoServer also thanks Anthony Dekker for the NeuQuant Neural-Net Quantization\nAlgorithm.  The copyright notice is intact in the source code and also here:\n\n-----\n\n    /* NeuQuant Neural-Net Quantization Algorithm\n     * ------------------------------------------\n     *\n     * Copyright (c) 1994 Anthony Dekker\n     *\n     * NEUQUANT Neural-Net quantization algorithm by Anthony Dekker, 1994.\n     * See \"Kohonen neural networks for optimal colour quantization\"\n     * in \"Network: Computation in Neural Systems\" Vol. 5 (1994) pp 351-367.\n     * for a discussion of the algorithm.\n     *\n     * Any party obtaining a copy of these files from the author, directly or\n     * indirectly, is granted, free of charge, a full and unrestricted irrevocable,\n     * world-wide, paid up, royalty-free, nonexclusive right and license to deal\n     * in this software and documentation files (the \"Software\"), including without\n     * limitation the rights to use, copy, modify, merge, publish, distribute, sublicense,\n     * and/or sell copies of the Software, and to permit persons who receive\n     * copies from any such party to do so, with the only requirement being\n     * that this copyright notice remain intact.\n     */\n\n-----\n\n### GifEncoder\n\nThe GeoServer Project also thanks J. M. G. Elliot for his improvements on \nJef Poskanzer's GifEncoder.  Notice is included below on his Elliot's \nrelease to public domain and Poskanzer's original notice (which is new\nBSD).  Source code is included in GeoServer source, with modifications done\nby David Blasby for The Open Planning Project (now OpenPlans).  \n\n------\n\n> Since Gif89Encoder includes significant sections of code from Jef Poskanzer's\n> GifEncoder.java, I'm including its notice in this distribution as requested (appended\n> below).\n> \n> As for my part of the code, I hereby release it, on a strictly \"as is\" basis,\n> to the public domain.\n> \n> J. M. G. Elliott\n> 15-Jul-2000\n> \n> ---- from Jef Poskanzer's GifEncoder.java ----\n> \n>     // GifEncoder - write out an image as a GIF\n>     //\n>     // Transparency handling and variable bit size courtesy of Jack Palevich.\n>     //\n>     // Copyright (C) 1996 by Jef Poskanzer <jef@acme.com>.  All rights reserved.\n>     //\n>     // Redistribution and use in source and binary forms, with or without\n>     // modification, are permitted provided that the following conditions\n>     // are met:\n>     // 1. Redistributions of source code must retain the above copyright\n>     //    notice, this list of conditions and the following disclaimer.\n>     // 2. Redistributions in binary form must reproduce the above copyright\n>     //    notice, this list of conditions and the following disclaimer in the\n>     //    documentation and/or other materials provided with the distribution.\n>     //\n>     // THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND\n>     // ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\n>     // IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\n>     // ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE\n>     // FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\n>     // DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS\n>     // OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\n>     // HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\n>     // LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY\n>     // OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF\n>     // SUCH DAMAGE.\n>     //\n>     // Visit the ACME Labs Java page for up-to-date versions of this and other\n>     // fine Java utilities: https://www.acme.com/java/\n\n------\n\n### JAI ImageIO\n\nJAI ImageIO jars from Sun are also included.  These are released under a \nBSD license (new).  Notice is below:\n\n-------\n\n    Initial sources\n\n    Copyright (c) 2005 Sun Microsystems, Inc. All  Rights Reserved.\n\n    Redistribution and use in source and binary forms, with or without\n    modification, are permitted provided that the following conditions\n    are met: \n\n    - Redistribution of source code must retain the above copyright \n      notice, this  list of conditions and the following disclaimer.\n\n    - Redistribution in binary form must reproduce the above copyright\n      notice, this list of conditions and the following disclaimer in \n      the documentation and/or other materials provided with the\n      distribution.\n\n    Neither the name of Sun Microsystems, Inc. or the names of \n    contributors may be used to endorse or promote products derived \n    from this software without specific prior written permission.\n\n    This software is provided \"AS IS,\" without a warranty of any \n    kind. ALL EXPRESS OR IMPLIED CONDITIONS, REPRESENTATIONS AND \n    WARRANTIES, INCLUDING ANY IMPLIED WARRANTY OF MERCHANTABILITY, \n    FITNESS FOR A PARTICULAR PURPOSE OR NON-INFRINGEMENT, ARE HEREBY\n    EXCLUDED. SUN MIDROSYSTEMS, INC. (\"SUN\") AND ITS LICENSORS SHALL \n    NOT BE LIABLE FOR ANY DAMAGES SUFFERED BY LICENSEE AS A RESULT OF \n    USING, MODIFYING OR DISTRIBUTING THIS SOFTWARE OR ITS\n    DERIVATIVES. IN NO EVENT WILL SUN OR ITS LICENSORS BE LIABLE FOR \n    ANY LOST REVENUE, PROFIT OR DATA, OR FOR DIRECT, INDIRECT, SPECIAL,\n    CONSEQUENTIAL, INCIDENTAL OR PUNITIVE DAMAGES, HOWEVER CAUSED AND\n    REGARDLESS OF THE THEORY OF LIABILITY, ARISING OUT OF THE USE OF OR\n    INABILITY TO USE THIS SOFTWARE, EVEN IF SUN HAS BEEN ADVISED OF THE\n    POSSIBILITY OF SUCH DAMAGES. \n\n    You acknowledge that this software is not designed or intended for \n    use in the design, construction, operation or maintenance of any \n    nuclear facility. \n\n-------\n\n### Jetty\n\nGeoServer also includes binaries and from Jetty, the standard version can be \nfound at https://www.eclipse.org/jetty/, released under an OSI-approved artistic\nlicense.  We include the license completely, as some versions will be \ndistributed without full source.\n\n------\n\n> Jetty License\n> $Revision: 3.7 $\n> Preamble:\n> \n> The intent of this document is to state the conditions under which the Jetty Package may be copied, such that the Copyright Holder maintains some semblance of control over the development of the package, while giving the users of the package the right to use, distribute and make reasonable modifications to the Package in accordance with the goals and ideals of the Open Source concept as described at https://www.opensource.org.\n> \n> It is the intent of this license to allow commercial usage of the Jetty package, so long as the source code is distributed or suitable visible credit given or other arrangements made with the copyright holders.\n> \n> Definitions:\n> \n> * \"Jetty\" refers to the collection of Java classes that are distributed as a HTTP server with servlet capabilities and associated utilities.\n> \n> * \"Package\" refers to the collection of files distributed by the Copyright Holder, and derivatives of that collection of files created through textual modification.\n> \n> * \"Standard Version\" refers to such a Package if it has not been modified, or has been modified in accordance with the wishes of the Copyright Holder.\n> \n> * \"Copyright Holder\" is whoever is named in the copyright or copyrights for the package.\n>   Mort Bay Consulting Pty. Ltd. (Australia) is the \"Copyright Holder\" for the Jetty package.\n> \n> * \"You\" is you, if you're thinking about copying or distributing this Package.\n> \n> * \"Reasonable copying fee\" is whatever you can justify on the basis of media cost, duplication charges, time of people involved, and so on. (You will not be required to justify it to the Copyright Holder, but only to the computing community at large as a market that must bear the fee.)\n> \n> * \"Freely Available\" means that no fee is charged for the item itself, though there may be fees involved in handling the item. It also means that recipients of the item may redistribute it under the same conditions they received it.\n> \n> 0. The Jetty Package is Copyright (c) Mort Bay Consulting Pty. Ltd. (Australia) and others. Individual files in this package may contain additional copyright notices. The javax.servlet packages are copyright Sun Microsystems Inc.\n> \n> 1. The Standard Version of the Jetty package is available from https://jetty.mortbay.org.\n> \n> 2. You may make and distribute verbatim copies of the source form of the Standard Version of this Package without restriction, provided that you include this license and all of the original copyright notices and associated disclaimers.\n> \n> 3. You may make and distribute verbatim copies of the compiled form of the Standard Version of this Package without restriction, provided that you include this license.\n> \n> 4. You may apply bug fixes, portability fixes and other modifications derived from the Public Domain or from the Copyright Holder. A Package modified in such a way shall still be considered the Standard Version.\n> \n> 5. You may otherwise modify your copy of this Package in any way, provided that you insert a prominent notice in each changed file stating how and when you changed that file, and provided that you do at least ONE of the following:\n> \n>     a) Place your modifications in the Public Domain or otherwise make them Freely Available, such as by posting said modifications to Usenet or an equivalent medium, or placing the modifications on a major archive site such as ftp.uu.net, or by allowing the Copyright Holder to include your modifications in the Standard Version of the Package.\n> \n>     b) Use the modified Package only within your corporation or organization.\n> \n>     c) Rename any non-standard classes so the names do not conflict with standard classes, which must also be provided, and provide a separate manual page for each non-standard class that clearly documents how it differs from the Standard Version.\n> \n>     d) Make other arrangements with the Copyright Holder.\n> \n> 6. You may distribute modifications or subsets of this Package in source code or compiled form, provided that you do at least ONE of the following:\n> \n>     a) Distribute this license and all original copyright messages, together with instructions (in the about dialog, manual page or equivalent) on where to get the complete Standard Version.\n> \n>     b) Accompany the distribution with the machine-readable source of the Package with your modifications. The modified package must include this license and all of the original copyright notices and associated disclaimers, together with instructions on where to get the complete Standard Version.\n> \n>     c) Make other arrangements with the Copyright Holder.\n> \n> 7. You may charge a reasonable copying fee for any distribution of this Package. You may charge any fee you choose for support of this Package. You may not charge a fee for this Package itself. However, you may distribute this Package in aggregate with other (possibly commercial) programs as part of a larger (possibly commercial) software distribution provided that you meet the other distribution requirements of this license.\n> \n> 8. Input to or the output produced from the programs of this Package do not automatically fall under the copyright of this Package, but belong to whomever generated them, and may be sold commercially, and may be aggregated with this Package.\n> \n> 9. Any program subroutines supplied by you and linked into this Package shall not be considered part of this Package.\n> \n> 10. The name of the Copyright Holder may not be used to endorse or promote products derived from this software without specific prior written permission.\n> \n> 11. This license may change with each release of a Standard Version of the Package. You may choose to use the license associated with version you are using or the license of the latest Standard Version.\n> \n> 12. THIS PACKAGE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.\n> \n> 13. If any superior law implies a warranty, the sole remedy under such shall be , at the Copyright Holders option either a) return of any price paid or b) use or reasonable endeavours to repair or replace the software.\n> \n> 14. This license shall be read under the laws of Australia.\n   \n-------\n\n### Prototype library (MIT License)\n\nGeoServer includes a few snippets from the Prototype library (www.prototypejs.org), \nunder a MIT license:\n\n-------\n\n    Copyright (c) 2005-2007 Sam Stephenson\n\n    Permission is hereby granted, free of charge, to any person obtaining a copy\n    of this software and associated documentation files (the \"Software\"), to deal\n    in the Software without restriction, including without limitation the rights\n    to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\n    copies of the Software, and to permit persons to whom the Software is\n    furnished to do so, subject to the following conditions:\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\n    AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n    OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\n    SOFTWARE.\n\n-------\n\n### Apache License\n\nGeoServer uses a number of libraries licensed under the Apache License, \nVersion 2.0.  These include Spring - https://www.springsource.org/,\na number of Apache commons libraries - https://jakarta.apache.org/commons/\nwhose jars we distribute and include in our source tree under lib/.  Also \nincluded as libraries are log4 https://logging.apache.org/log4j/docs/index.htmlj, \nbatik https://xmlgraphics.apache.org/batik/, and xerces https://xerces.apache.org/xerces-j/.\n\nNote there is some disagreement as to whether GPL and Apache 2.0 are compatible see \nhttps://www.apache.org/licenses/GPL-compatibility.html for more information.  We\nhope that something will work out, as GeoServer would not be possible without\napache libraries.\n\nNotice for apache license is included below:\n\n-------\n\n   Apache License\n   Version 2.0, January 2004\n   https://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n   \"License\" shall mean the terms and conditions for use, reproduction, and distribution as defined by Sections 1 through 9 of this document.\n\n   \"Licensor\" shall mean the copyright owner or entity authorized by the copyright owner that is granting the License.\n\n   \"Legal Entity\" shall mean the union of the acting entity and all other entities that control, are controlled by, or are under common control with that entity. For the purposes of this definition, \"control\" means (i) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or (ii) ownership of fifty percent (50%) or more of the outstanding shares, or (iii) beneficial ownership of such entity.\n\n   \"You\" (or \"Your\") shall mean an individual or Legal Entity exercising permissions granted by this License.\n\n   \"Source\" form shall mean the preferred form for making modifications, including but not limited to software source code, documentation source, and configuration files.\n\n   \"Object\" form shall mean any form resulting from mechanical transformation or translation of a Source form, including but not limited to compiled object code, generated documentation, and conversions to other media types.\n\n   \"Work\" shall mean the work of authorship, whether in Source or Object form, made available under the License, as indicated by a copyright notice that is included in or attached to the work (an example is provided in the Appendix below).\n\n   \"Derivative Works\" shall mean any work, whether in Source or Object form, that is based on (or derived from) the Work and for which the editorial revisions, annotations, elaborations, or other modifications represent, as a whole, an original work of authorship. For the purposes of this License, Derivative Works shall not include works that remain separable from, or merely link (or bind by name) to the interfaces of, the Work and Derivative Works thereof.\n\n   \"Contribution\" shall mean any work of authorship, including the original version of the Work and any modifications or additions to that Work or Derivative Works thereof, that is intentionally submitted to Licensor for inclusion in the Work by the copyright owner or by an individual or Legal Entity authorized to submit on behalf of the copyright owner. For the purposes of this definition, \"submitted\" means any form of electronic, verbal, or written communication sent to the Licensor or its representatives, including but not limited to communication on electronic mailing lists, source code control systems, and issue tracking systems that are managed by, or on behalf of, the Licensor for the purpose of discussing and improving the Work, but excluding communication that is conspicuously marked or otherwise designated in writing by the copyright owner as \"Not a Contribution.\"\n\n   \"Contributor\" shall mean Licensor and any individual or Legal Entity on behalf of whom a Contribution has been received by Licensor and subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable copyright license to reproduce, prepare Derivative Works of, publicly display, publicly perform, sublicense, and distribute the Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable (except as stated in this section) patent license to make, have made, use, offer to sell, sell, import, and otherwise transfer the Work, where such license applies only to those patent claims licensable by such Contributor that are necessarily infringed by their Contribution(s) alone or by combination of their Contribution(s) with the Work to which such Contribution(s) was submitted. If You institute patent litigation against any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the Work or a Contribution incorporated within the Work constitutes direct or contributory patent infringement, then any patent licenses granted to You under this License for that Work shall terminate as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the Work or Derivative Works thereof in any medium, with or without modifications, and in Source or Object form, provided that You meet the following conditions:\n\n      1. You must give any other recipients of the Work or Derivative Works a copy of this License; and\n\n      2. You must cause any modified files to carry prominent notices stating that You changed the files; and\n\n      3. You must retain, in the Source form of any Derivative Works that You distribute, all copyright, patent, trademark, and attribution notices from the Source form of the Work, excluding those notices that do not pertain to any part of the Derivative Works; and\n\n      4. If the Work includes a \"NOTICE\" text file as part of its distribution, then any Derivative Works that You distribute must include a readable copy of the attribution notices contained within such NOTICE file, excluding those notices that do not pertain to any part of the Derivative Works, in at least one of the following places: within a NOTICE text file distributed as part of the Derivative Works; within the Source form or documentation, if provided along with the Derivative Works; or, within a display generated by the Derivative Works, if and wherever such third-party notices normally appear. The contents of the NOTICE file are for informational purposes only and do not modify the License. You may add Your own attribution notices within Derivative Works that You distribute, alongside or as an addendum to the NOTICE text from the Work, provided that such additional attribution notices cannot be construed as modifying the License.\n\n   You may add Your own copyright statement to Your modifications and may provide additional or different license terms and conditions for use, reproduction, or distribution of Your modifications, or for any such Derivative Works as a whole, provided Your use, reproduction, and distribution of the Work otherwise complies with the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise, any Contribution intentionally submitted for inclusion in the Work by You to the Licensor shall be under the terms and conditions of this License, without any additional terms or conditions. Notwithstanding the above, nothing herein shall supersede or modify the terms of any separate license agreement you may have executed with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade names, trademarks, service marks, or product names of the Licensor, except as required for reasonable and customary use in describing the origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or agreed to in writing, Licensor provides the Work (and each Contributor provides its Contributions) on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied, including, without limitation, any warranties or conditions of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A PARTICULAR PURPOSE. You are solely responsible for determining the appropriateness of using or redistributing the Work and assume any risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory, whether in tort (including negligence), contract, or otherwise, unless required by applicable law (such as deliberate and grossly negligent acts) or agreed to in writing, shall any Contributor be liable to You for damages, including any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or out of the use or inability to use the Work (including but not limited to damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses), even if such Contributor has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing the Work or Derivative Works thereof, You may choose to offer, and charge a fee for, acceptance of support, warranty, indemnity, or other liability obligations and/or rights consistent with this License. However, in accepting such obligations, You may act only on Your own behalf and on Your sole responsibility, not on behalf of any other Contributor, and only if You agree to indemnify, defend, and hold each Contributor harmless for any liability incurred by, or claims asserted against, such Contributor by reason of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n   \n-------\n\n### Eclipse Public License\n\nGeoServer is build using a number of eclipse libraries including emf and xsd made available under the Eclipse Public License.\n\nThe notice for EPL license is included below:\n\n--------\n\n    Copyright (c) 2002-2006 IBM Corporation and others.\n    All rights reserved.   This program and the accompanying materials\n    are made available under the terms of the Eclipse Public License v1.0\n    which accompanies this distribution, and is available at\n    https://www.eclipse.org/legal/epl-v10.html\n\n-------\n\n### Java Service Launcher (JSL)\n\nGeoServer uses the Java Service Launcher (JSL) by Michael Roeschter as a wrapper to install GeoServer as a Windows service.\nThe following license applies to this software (taken from https://roeschter.de/#license):\n\n-------\n\n    JAVA SERVICE LAUNCHER (JSL) is PUBLIC DOMAIN.\n\n    This means the software is FREE. Free means you may use or reuse \n    any part of the software. You may package it with commercial software \n    and use it in commercial and business environments. \n    You may NOT claim copyright for the JSL software and it's source code \n    or any parts of the software and source. \n    Any derived work may retain a copyright or be commercialized as long \n    as the JSL parts of it are not covered by this copyright.\n\n    You may distribute derived work in executable form and not include \n    the JSL source code if JSL constitues only a minor part of the \n    intellectual work (in other words, you can take the executable and \n    embed it in a Java application you distribute commercially), but you \n    may not charge in particular for or discriminate against the use of \n    the parts derived from JSL.\n\n    Disclaimer: \n    This software is supplied AS IS with no claim of fitness for purpose.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 2.41796875,
          "content": "<img src=\"/doc/en/themes/geoserver/static/GeoServer_500.png\" width=\"353\">\n\n[![Gitter](https://badges.gitter.im/geoserver/geoserver.svg)](https://gitter.im/geoserver/geoserver?utm_source=badge&utm_medium=badge&utm_campaign=pr-badge&utm_content=badge)\n[![DOI](https://zenodo.org/badge/2751199.svg)](https://zenodo.org/badge/latestdoi/2751199)\n\n[GeoServer](https://geoserver.org) is an open source software server written in Java that \nallows users to share and edit geospatial data. Designed for interoperability, it publishes data from \nany major spatial data source using open standards.\n\nBeing a community-driven project, GeoServer is developed, tested, and supported by a diverse group of \nindividuals and organizations from around the world.\n\nGeoServer is the reference implementation of the Open Geospatial Consortium (OGC) \nWeb Feature Service (WFS) and Web Coverage Service (WCS) standards, as well as a high performance \ncertified compliant Web Map Service (WMS), compliant Catalog Service for the Web (CSW)\nand implementing Web Processing Service (WPS). \nGeoServer forms a core component of the Geospatial Web.\n\n## License\n\nGeoServer licensed under the [GPL](https://docs.geoserver.org/latest/en/user/introduction/license.html).\n\n## Using\n\nPlease refer to the [user guide](https://docs.geoserver.org/latest/en/user/) for information\non how to install and use GeoServer.\n\n## Building\n\nGeoServer uses [Apache Maven](https://maven.apache.org/) for a build system. To \nbuild the application run maven from the ```src``` directory.\n\n    mvn clean install\n\nSee the [developer guide](https://docs.geoserver.org/latest/en/developer/) \nfor more details.\n\n## Bugs\n\nGeoServer uses [JIRA](https://osgeo-org.atlassian.net/projects/GEOS), hosted by \n[Atlassian](https://www.atlassian.com/), for issue tracking.\n\n<a id=\"mailing-lists\"></a> <!-- to retain the existing anchor tag -->\n## Community support\n\nThe [Community support page](https://geoserver.org/comm/) on the GeoServer web site provides\naccess to the various channels of communication, as well as some indication of the [code of conduct](https://geoserver.org/comm/userlist-guidelines.html) when posting to the groups.\n\n## Contributing\n\nPlease read [the contribution guidelines](https://github.com/geoserver/geoserver/blob/main/CONTRIBUTING.md) before contributing pull requests to the GeoServer project.\n\n## More Information\n\nVisit the [website](https://geoserver.org/) or read the [docs](https://docs.geoserver.org/). \n\n"
        },
        {
          "name": "SECURITY.md",
          "type": "blob",
          "size": 3.2236328125,
          "content": "# Security Policy\n\n## Supported Versions\n\nEach GeoServer release is supported with bug fixes for a year, with releases made approximately every two months.\n\n| Version     | Supported          | Available               |\n| ----------- | ------------------ |------------------------ |\n| stable      | :white_check_mark: | six months              |\n| maintenance | :white_check_mark: | twelve months           |\n| archived    | :x:                |                         |\n\nThis approach provides ample time for upgrading ensuring you are always working with a supported GeoServer release.\n\nIf your organization is making use of a GeoServer version that is no longer in use by the community all is not lost.\nYou can volunteer on the developer list to make additional releases, or engage with one of our\n[Commercial Support](http://geoserver.org/support/) providers.\n\n## Reporting a Vulnerability\n\nIf you encounter a security vulnerability in GeoServer please take care to report in a responsible fashion:\n\n1. Keep exploit details out of public forums, mailing lists, and issue tracker.\n\n2. There are two options to report a security vulnerability:\n\n   * To report via email:\n\n     Please send an email directly to the volunteers on the private geoserver-security@lists.osgeo.org mailing list.\n     Provide information about the security vulnerability you might have found in your email.\n\n     This is a moderated list: send directly to the address; your email will be moderated; and eventually shared with volunteers.\n  \n   * To report via GitHub:\n\n     Navigate to [security](https://github.com/geoserver/geoserver/security) page, use link for [Private vulnerability reporting](https://github.com/geoserver/geoserver/security/advisories/new).\n\n     For more information see [GitHub documentation](https://docs.github.com/en/code-security/security-advisories/guidance-on-reporting-and-writing-information-about-vulnerabilities/privately-reporting-a-security-vulnerability#privately-reporting-a-security-vulnerability).\n\n3. There is no expected response time. Be prepared to work with geoserver-security email list volunteers on a solution.\n\n4. Keep in mind participants are volunteering their time, an extensive fix may require fundraising/resources.\n\nFor more information see [Community Support](http://geoserver.org/comm/).\n\n## Coordinated vulnerability disclosure\n\nDisclosure policy:\n\n1. The reported vulnerability has been verified by working with the geoserver-security list\n2. GitHub [security advisory](https://github.com/geoserver/geoserver/security) is used to reserve a CVE number\n3. A fix or documentation clarification is accepted and backported to both the \"stable\" and \"maintenance\" branches\n4. A fix is included for the \"stable\" and \"maintenance\" downloads ([released as scheduled](https://github.com/geoserver/geoserver/wiki/Release-Schedule), or issued via emergency update)\n6. The CVE vulnerability is published with mitigation and patch instructions\n\nThis represents a balance between transparency and participation that does not overwhelm participants. \nThose seeking greater visibility are encouraged to volunteer with the geoserver-security list;\nor work with one of the [commercial support providers](https://geoserver.org/support/) who participate on behalf of their customers.\n"
        },
        {
          "name": "build",
          "type": "tree",
          "content": null
        },
        {
          "name": "data",
          "type": "tree",
          "content": null
        },
        {
          "name": "doc",
          "type": "tree",
          "content": null
        },
        {
          "name": "licenses",
          "type": "tree",
          "content": null
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}