{
  "metadata": {
    "timestamp": 1736708175874,
    "page": 639,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjY1MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "WhatsApp/stickers",
      "stars": 2762,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": "Android",
          "type": "tree",
          "content": null
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 0.2373046875,
          "content": "# Code of Conduct\n\nFacebook has adopted a Code of Conduct that we expect project participants to adhere to.\nPlease read the [full text](https://code.fb.com/codeofconduct/)\nso that you can understand what actions will and will not be tolerated."
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 1.484375,
          "content": "# Contributing to WhatsApp Stickers\nWe want to make contributing to this project as easy and transparent as\npossible.\n\n## Pull Requests\nWe actively welcome your pull requests.\n\n1. Fork the repo and create your branch from `main`.\n2. If you've added code that should be tested, add tests.\n3. If you've changed APIs, update the documentation.\n4. Ensure the test suite passes.\n5. Make sure your code lints.\n6. If you haven't already, complete the Contributor License Agreement (\"CLA\").\n\n## Contributor License Agreement (\"CLA\")\nIn order to accept your pull request, we need you to submit a CLA. You only need\nto do this once to work on any of Facebook's open source projects.\n\nComplete your CLA here: <https://code.facebook.com/cla>\n\n## Issues\nWe use GitHub issues to track public bugs. Please ensure your description is\nclear and has sufficient instructions to be able to reproduce the issue.\n\nFacebook has a [bounty program](https://www.facebook.com/whitehat/) for the safe\ndisclosure of security bugs. In those cases, please go through the process\noutlined on that page and do not file a public issue.\n\n## Coding Style  \nFor Android, we follow Google Java Style Guide as the coding style: <https://google.github.io/styleguide/javaguide.html>.\nFor iOS, we follow the Swift API Design Guidelines: <https://swift.org/documentation/api-design-guidelines/>.\n\n## License\nBy contributing to WhatsApp Stickers, you agree that your contributions will be licensed\nunder the LICENSE file in the root directory of this source tree.\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.5068359375,
          "content": "BSD License\n\nFor WhatsApp Stickers software\n\nCopyright (c) WhatsApp Inc. and its affiliates. All rights reserved.\n\nRedistribution and use in source and binary forms, with or without modification,\nare permitted provided that the following conditions are met:\n\n * Redistributions of source code must retain the above copyright notice, this\n   list of conditions and the following disclaimer.\n\n * Redistributions in binary form must reproduce the above copyright notice,\n   this list of conditions and the following disclaimer in the documentation\n   and/or other materials provided with the distribution.\n\n * Neither the name WhatsApp nor the names of its contributors may be used to\n   endorse or promote products derived from this software without specific\n   prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND\nANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR\nANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\nLOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON\nANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 3.984375,
          "content": "# WhatsApp Stickers\n\n![Works with Android](https://img.shields.io/badge/Works_with-Android-green?style=flat-square)\n![Works with iOS](https://img.shields.io/badge/Works_with-iOS-blue?style=flat-square)\n![GitHub issues](https://img.shields.io/github/issues/whatsapp/stickers?style=flat-square)\n\n> This repository contains the iOS and Android sample apps and API for creating third party sticker packs for WhatsApp.\n\nIf you'd like to create your own [stickers for WhatsApp](https://faq.whatsapp.com/en/android/26000227/), you can package them in an Android or iOS app. \n\nFor Android users, you can publish your sticker app to the [Google Play Store](https://play.google.com/store) and users who download and install your app will be able to start sending those stickers right away from within WhatsApp. \nFor iOS developers please read the [IMPORTANT NOTICE ABOUT iOS APPS](#please-read-important-notice-about-ios-apps) section.\n\n**Stickers on WhatsApp must be legal, authorized and acceptable.** Learn more about acceptable uses of our services from our [Terms of Service](https://www.whatsapp.com/legal/#terms-of-service).\n\n## Get started :rocket:\n\nTo get started, review the `README` files in the [Android](https://github.com/WhatsApp/stickers/tree/master/Android) or [iOS](https://github.com/WhatsApp/stickers/tree/master/iOS) folders, and refer to the [FAQ](https://faq.whatsapp.com/general/26000226).\n\n## PLEASE READ: IMPORTANT NOTICE ABOUT iOS APPS\n\nWith Apple’s strict App Store review policy, we recommend iOS developers to submit apps that contain more functionality than to simply export stickers. This will increase the chances of the app being accepted. As an alternative to creating an iOS app, there are various sticker maker apps that help you create and import stickers into WhatsApp.\n\nThe sample iOS app is an example of how to use our API to import stickers into WhatsApp and can serve as a guide on how to get started, but it is not meant to be used as a template for your app because it will not be accepted by Apple.\n\n## Announcements :loudspeaker:\nPlease check out [Announcements](https://github.com/WhatsApp/stickers/wiki/Animated-Stickers) for recent changes.\n\n## Brand guidelines\nWhen naming your app, it is strongly advised you do not use \"WhatsApp\" anywhere in the name of your app or in the name field of your app listing. However, when preparing your app for submission in Google Play Store/App Store, you'll have the option to add description associated with your app and it's okay to mention WhatsApp in the description. Make sure you use \"WhatsApp\" as a brand name, with \"W\" and \"A\" capitalized with no space between letters. More information on WhatsApp Brand(https://www.facebook.com/brand/resources/whatsapp/whatsapp-brand).\n\n## Opening Issues :warning:\n\n> Only use the GitHub Issues section if you discovered **issues with the code itself**. Do not mistake the Issues page as a help desk. You can ask for help at [Stack Overflow](https://stackoverflow.com/questions/tagged/whatsapp-stickers).  \n> For support, please contact <developer@support.whatsapp.com>.\n\n- Create an [**Android**](https://github.com/WhatsApp/stickers/issues/new?template=android.md) issue\n- Create an [**iOS**](https://github.com/WhatsApp/stickers/issues/new?template=ios.md) issue\n- Create a [**general issue**](https://github.com/WhatsApp/stickers/issues/new?template=general.md)\n\n_For all three options, fill in all fields that apply._\n\n## Opening Pull Requests\n\n> In order for us to accept pull requests, please complete the Contributor License Agreement by following instructions in [`CONTRIBUTING`](https://github.com/WhatsApp/stickers/blob/master/CONTRIBUTING.md).\n\n1. Please check that a similar pull request doesn't exist already [here](https://github.com/WhatsApp/stickers/pulls?utf8=%E2%9C%93&q=is%3Apr)\n2. [Open a new pull request](https://github.com/WhatsApp/stickers/compare)\n3. Wait for someone to look at it :watch:\n\n## License\n\nWhatsApp Stickers is BSD licensed, as found in the [`LICENSE`](https://github.com/WhatsApp/stickers/blob/master/LICENSE) file.\n"
        },
        {
          "name": "iOS",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}