{
  "metadata": {
    "timestamp": 1736708575571,
    "page": 854,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjg3MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "sharpie7/circuitjs1",
      "stars": 2417,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".classpath",
          "type": "blob",
          "size": 0.685546875,
          "content": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<classpath>\n\t<classpathentry kind=\"src\" path=\"src\"/>\n\t<classpathentry exported=\"true\" kind=\"con\" path=\"com.google.gwt.eclipse.core.GWT_CONTAINER\"/>\n\t<classpathentry kind=\"con\" path=\"org.eclipse.jdt.launching.JRE_CONTAINER/org.eclipse.jdt.internal.debug.ui.launcher.StandardVMType/J2SE-1.5\">\n\t\t<attributes>\n\t\t\t<attribute name=\"owner.project.facets\" value=\"java\"/>\n\t\t</attributes>\n\t</classpathentry>\n\t<classpathentry exported=\"true\" kind=\"con\" path=\"com.gwtplugins.gwt.eclipse.core.GWT_CONTAINER/GWT 2.7.0\"/>\n\t<classpathentry kind=\"con\" path=\"com.gwtplugins.gwt.eclipse.core.GWT_CONTAINER\"/>\n\t<classpathentry kind=\"output\" path=\"war/WEB-INF/classes\"/>\n</classpath>\n"
        },
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.369140625,
          "content": "# Auto detect text files and perform LF normalization\n* text=auto\n\n# Custom for Visual Studio\n*.cs     diff=csharp\n\n# Standard to msysgit\n*.doc\t diff=astextplain\n*.DOC\t diff=astextplain\n*.docx diff=astextplain\n*.DOCX diff=astextplain\n*.dot  diff=astextplain\n*.DOT  diff=astextplain\n*.pdf  diff=astextplain\n*.PDF\t diff=astextplain\n*.rtf\t diff=astextplain\n*.RTF\t diff=astextplain\n"
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.65234375,
          "content": "#GWT cache\ngwt-unitCache/\nwar/circuitjs1/\nwar/circuitjs1/circuits/\nwar/e-*.html\nwar/WEB-INF/\n\n# Windows image file caches\nThumbs.db\nehthumbs.db\n\n# Folder config file\nDesktop.ini\n\n# Recycle Bin used on file shares\n$RECYCLE.BIN/\n\n# Windows Installer files\n*.cab\n*.msi\n*.msm\n*.msp\n\n# Windows shortcuts\n*.lnk\n\n# =========================\n# Operating System Files\n# =========================\n\n# OSX\n# =========================\n\n.DS_Store\n.AppleDouble\n.LSOverride\n\n# Thumbnails\n._*\n\n# Files that might appear on external disk\n.Spotlight-V100\n.Trashes\n\n# Directories potentially created on remote AFP share\n.AppleDB\n.AppleDesktop\nNetwork Trash Folder\nTemporary Items\n.apdisk\n"
        },
        {
          "name": ".project",
          "type": "blob",
          "size": 1.1923828125,
          "content": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<projectDescription>\n\t<name>circuitjs1</name>\n\t<comment></comment>\n\t<projects>\n\t</projects>\n\t<buildSpec>\n\t\t<buildCommand>\n\t\t\t<name>org.eclipse.wst.common.project.facet.core.builder</name>\n\t\t\t<arguments>\n\t\t\t</arguments>\n\t\t</buildCommand>\n\t\t<buildCommand>\n\t\t\t<name>org.eclipse.jdt.core.javabuilder</name>\n\t\t\t<arguments>\n\t\t\t</arguments>\n\t\t</buildCommand>\n\t\t<buildCommand>\n\t\t\t<name>com.google.gdt.eclipse.core.webAppProjectValidator</name>\n\t\t\t<arguments>\n\t\t\t</arguments>\n\t\t</buildCommand>\n\t\t<buildCommand>\n\t\t\t<name>com.google.gwt.eclipse.core.gwtProjectValidator</name>\n\t\t\t<arguments>\n\t\t\t</arguments>\n\t\t</buildCommand>\n\t\t<buildCommand>\n\t\t\t<name>com.gwtplugins.gdt.eclipse.core.webAppProjectValidator</name>\n\t\t\t<arguments>\n\t\t\t</arguments>\n\t\t</buildCommand>\n\t\t<buildCommand>\n\t\t\t<name>com.gwtplugins.gwt.eclipse.core.gwtProjectValidator</name>\n\t\t\t<arguments>\n\t\t\t</arguments>\n\t\t</buildCommand>\n\t</buildSpec>\n\t<natures>\n\t\t<nature>org.eclipse.jdt.core.javanature</nature>\n\t\t<nature>com.google.gwt.eclipse.core.gwtNature</nature>\n\t\t<nature>org.eclipse.wst.common.project.facet.core.nature</nature>\n\t\t<nature>com.gwtplugins.gwt.eclipse.core.gwtNature</nature>\n\t</natures>\n</projectDescription>\n"
        },
        {
          "name": ".settings",
          "type": "tree",
          "content": null
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 0.8046875,
          "content": "# Contributing to Circuitjs1\n## Raising issues\nPlease feel free to add issues for feature requests or bug reports. We do work on this in our spare time, for free, so the issues\nthat get processed tend to be the ones that are of most interest to us or scratch itches that we share.\n### Labeling issues\nPlease start your issue titles with \"Bug-\" for bug reports or \"Feature-\" for feature requests.\n\nPlease only include one item in each issue (ie don't say \"I would like this feature, and THIS feature and THAT feature\" in one issue).\n\nFor bug reports please include an example circuit (or a link to one) that exhibits the bug and the steps to reproduce the bug.\n\nFor feature requests please explain why you would find this feature useful - what new work-flow would it support or what type of application would it assist with.\n"
        },
        {
          "name": "COPYING.txt",
          "type": "blob",
          "size": 17.66796875,
          "content": "                    GNU GENERAL PUBLIC LICENSE\n                       Version 2, June 1991\n\n Copyright (C) 1989, 1991 Free Software Foundation, Inc.,\n 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n                            Preamble\n\n  The licenses for most software are designed to take away your\nfreedom to share and change it.  By contrast, the GNU General Public\nLicense is intended to guarantee your freedom to share and change free\nsoftware--to make sure the software is free for all its users.  This\nGeneral Public License applies to most of the Free Software\nFoundation's software and to any other program whose authors commit to\nusing it.  (Some other Free Software Foundation software is covered by\nthe GNU Lesser General Public License instead.)  You can apply it to\nyour programs, too.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthis service if you wish), that you receive source code or can get it\nif you want it, that you can change the software or use pieces of it\nin new free programs; and that you know you can do these things.\n\n  To protect your rights, we need to make restrictions that forbid\nanyone to deny you these rights or to ask you to surrender the rights.\nThese restrictions translate to certain responsibilities for you if you\ndistribute copies of the software, or if you modify it.\n\n  For example, if you distribute copies of such a program, whether\ngratis or for a fee, you must give the recipients all the rights that\nyou have.  You must make sure that they, too, receive or can get the\nsource code.  And you must show them these terms so they know their\nrights.\n\n  We protect your rights with two steps: (1) copyright the software, and\n(2) offer you this license which gives you legal permission to copy,\ndistribute and/or modify the software.\n\n  Also, for each author's protection and ours, we want to make certain\nthat everyone understands that there is no warranty for this free\nsoftware.  If the software is modified by someone else and passed on, we\nwant its recipients to know that what they have is not the original, so\nthat any problems introduced by others will not reflect on the original\nauthors' reputations.\n\n  Finally, any free program is threatened constantly by software\npatents.  We wish to avoid the danger that redistributors of a free\nprogram will individually obtain patent licenses, in effect making the\nprogram proprietary.  To prevent this, we have made it clear that any\npatent must be licensed for everyone's free use or not licensed at all.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\n                    GNU GENERAL PUBLIC LICENSE\n   TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n\n  0. This License applies to any program or other work which contains\na notice placed by the copyright holder saying it may be distributed\nunder the terms of this General Public License.  The \"Program\", below,\nrefers to any such program or work, and a \"work based on the Program\"\nmeans either the Program or any derivative work under copyright law:\nthat is to say, a work containing the Program or a portion of it,\neither verbatim or with modifications and/or translated into another\nlanguage.  (Hereinafter, translation is included without limitation in\nthe term \"modification\".)  Each licensee is addressed as \"you\".\n\nActivities other than copying, distribution and modification are not\ncovered by this License; they are outside its scope.  The act of\nrunning the Program is not restricted, and the output from the Program\nis covered only if its contents constitute a work based on the\nProgram (independent of having been made by running the Program).\nWhether that is true depends on what the Program does.\n\n  1. You may copy and distribute verbatim copies of the Program's\nsource code as you receive it, in any medium, provided that you\nconspicuously and appropriately publish on each copy an appropriate\ncopyright notice and disclaimer of warranty; keep intact all the\nnotices that refer to this License and to the absence of any warranty;\nand give any other recipients of the Program a copy of this License\nalong with the Program.\n\nYou may charge a fee for the physical act of transferring a copy, and\nyou may at your option offer warranty protection in exchange for a fee.\n\n  2. You may modify your copy or copies of the Program or any portion\nof it, thus forming a work based on the Program, and copy and\ndistribute such modifications or work under the terms of Section 1\nabove, provided that you also meet all of these conditions:\n\n    a) You must cause the modified files to carry prominent notices\n    stating that you changed the files and the date of any change.\n\n    b) You must cause any work that you distribute or publish, that in\n    whole or in part contains or is derived from the Program or any\n    part thereof, to be licensed as a whole at no charge to all third\n    parties under the terms of this License.\n\n    c) If the modified program normally reads commands interactively\n    when run, you must cause it, when started running for such\n    interactive use in the most ordinary way, to print or display an\n    announcement including an appropriate copyright notice and a\n    notice that there is no warranty (or else, saying that you provide\n    a warranty) and that users may redistribute the program under\n    these conditions, and telling the user how to view a copy of this\n    License.  (Exception: if the Program itself is interactive but\n    does not normally print such an announcement, your work based on\n    the Program is not required to print an announcement.)\n\nThese requirements apply to the modified work as a whole.  If\nidentifiable sections of that work are not derived from the Program,\nand can be reasonably considered independent and separate works in\nthemselves, then this License, and its terms, do not apply to those\nsections when you distribute them as separate works.  But when you\ndistribute the same sections as part of a whole which is a work based\non the Program, the distribution of the whole must be on the terms of\nthis License, whose permissions for other licensees extend to the\nentire whole, and thus to each and every part regardless of who wrote it.\n\nThus, it is not the intent of this section to claim rights or contest\nyour rights to work written entirely by you; rather, the intent is to\nexercise the right to control the distribution of derivative or\ncollective works based on the Program.\n\nIn addition, mere aggregation of another work not based on the Program\nwith the Program (or with a work based on the Program) on a volume of\na storage or distribution medium does not bring the other work under\nthe scope of this License.\n\n  3. You may copy and distribute the Program (or a work based on it,\nunder Section 2) in object code or executable form under the terms of\nSections 1 and 2 above provided that you also do one of the following:\n\n    a) Accompany it with the complete corresponding machine-readable\n    source code, which must be distributed under the terms of Sections\n    1 and 2 above on a medium customarily used for software interchange; or,\n\n    b) Accompany it with a written offer, valid for at least three\n    years, to give any third party, for a charge no more than your\n    cost of physically performing source distribution, a complete\n    machine-readable copy of the corresponding source code, to be\n    distributed under the terms of Sections 1 and 2 above on a medium\n    customarily used for software interchange; or,\n\n    c) Accompany it with the information you received as to the offer\n    to distribute corresponding source code.  (This alternative is\n    allowed only for noncommercial distribution and only if you\n    received the program in object code or executable form with such\n    an offer, in accord with Subsection b above.)\n\nThe source code for a work means the preferred form of the work for\nmaking modifications to it.  For an executable work, complete source\ncode means all the source code for all modules it contains, plus any\nassociated interface definition files, plus the scripts used to\ncontrol compilation and installation of the executable.  However, as a\nspecial exception, the source code distributed need not include\nanything that is normally distributed (in either source or binary\nform) with the major components (compiler, kernel, and so on) of the\noperating system on which the executable runs, unless that component\nitself accompanies the executable.\n\nIf distribution of executable or object code is made by offering\naccess to copy from a designated place, then offering equivalent\naccess to copy the source code from the same place counts as\ndistribution of the source code, even though third parties are not\ncompelled to copy the source along with the object code.\n\n  4. You may not copy, modify, sublicense, or distribute the Program\nexcept as expressly provided under this License.  Any attempt\notherwise to copy, modify, sublicense or distribute the Program is\nvoid, and will automatically terminate your rights under this License.\nHowever, parties who have received copies, or rights, from you under\nthis License will not have their licenses terminated so long as such\nparties remain in full compliance.\n\n  5. You are not required to accept this License, since you have not\nsigned it.  However, nothing else grants you permission to modify or\ndistribute the Program or its derivative works.  These actions are\nprohibited by law if you do not accept this License.  Therefore, by\nmodifying or distributing the Program (or any work based on the\nProgram), you indicate your acceptance of this License to do so, and\nall its terms and conditions for copying, distributing or modifying\nthe Program or works based on it.\n\n  6. Each time you redistribute the Program (or any work based on the\nProgram), the recipient automatically receives a license from the\noriginal licensor to copy, distribute or modify the Program subject to\nthese terms and conditions.  You may not impose any further\nrestrictions on the recipients' exercise of the rights granted herein.\nYou are not responsible for enforcing compliance by third parties to\nthis License.\n\n  7. If, as a consequence of a court judgment or allegation of patent\ninfringement or for any other reason (not limited to patent issues),\nconditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot\ndistribute so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you\nmay not distribute the Program at all.  For example, if a patent\nlicense would not permit royalty-free redistribution of the Program by\nall those who receive copies directly or indirectly through you, then\nthe only way you could satisfy both it and this License would be to\nrefrain entirely from distribution of the Program.\n\nIf any portion of this section is held invalid or unenforceable under\nany particular circumstance, the balance of the section is intended to\napply and the section as a whole is intended to apply in other\ncircumstances.\n\nIt is not the purpose of this section to induce you to infringe any\npatents or other property right claims or to contest validity of any\nsuch claims; this section has the sole purpose of protecting the\nintegrity of the free software distribution system, which is\nimplemented by public license practices.  Many people have made\ngenerous contributions to the wide range of software distributed\nthrough that system in reliance on consistent application of that\nsystem; it is up to the author/donor to decide if he or she is willing\nto distribute software through any other system and a licensee cannot\nimpose that choice.\n\nThis section is intended to make thoroughly clear what is believed to\nbe a consequence of the rest of this License.\n\n  8. If the distribution and/or use of the Program is restricted in\ncertain countries either by patents or by copyrighted interfaces, the\noriginal copyright holder who places the Program under this License\nmay add an explicit geographical distribution limitation excluding\nthose countries, so that distribution is permitted only in or among\ncountries not thus excluded.  In such case, this License incorporates\nthe limitation as if written in the body of this License.\n\n  9. The Free Software Foundation may publish revised and/or new versions\nof the General Public License from time to time.  Such new versions will\nbe similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\nEach version is given a distinguishing version number.  If the Program\nspecifies a version number of this License which applies to it and \"any\nlater version\", you have the option of following the terms and conditions\neither of that version or of any later version published by the Free\nSoftware Foundation.  If the Program does not specify a version number of\nthis License, you may choose any version ever published by the Free Software\nFoundation.\n\n  10. If you wish to incorporate parts of the Program into other free\nprograms whose distribution conditions are different, write to the author\nto ask for permission.  For software which is copyrighted by the Free\nSoftware Foundation, write to the Free Software Foundation; we sometimes\nmake exceptions for this.  Our decision will be guided by the two goals\nof preserving the free status of all derivatives of our free software and\nof promoting the sharing and reuse of software generally.\n\n                            NO WARRANTY\n\n  11. BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY\nFOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.  EXCEPT WHEN\nOTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES\nPROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED\nOR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.  THE ENTIRE RISK AS\nTO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU.  SHOULD THE\nPROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING,\nREPAIR OR CORRECTION.\n\n  12. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR\nREDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,\nINCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING\nOUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED\nTO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY\nYOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER\nPROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGES.\n\n                     END OF TERMS AND CONDITIONS\n\n            How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nconvey the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the program's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This program is free software; you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation; either version 2 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License along\n    with this program; if not, write to the Free Software Foundation, Inc.,\n    51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.\n\nAlso add information on how to contact you by electronic and paper mail.\n\nIf the program is interactive, make it output a short notice like this\nwhen it starts in an interactive mode:\n\n    Gnomovision version 69, Copyright (C) year name of author\n    Gnomovision comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n    This is free software, and you are welcome to redistribute it\n    under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate\nparts of the General Public License.  Of course, the commands you use may\nbe called something other than `show w' and `show c'; they could even be\nmouse-clicks or menu items--whatever suits your program.\n\nYou should also get your employer (if you work as a programmer) or your\nschool, if any, to sign a \"copyright disclaimer\" for the program, if\nnecessary.  Here is a sample; alter the names:\n\n  Yoyodyne, Inc., hereby disclaims all copyright interest in the program\n  `Gnomovision' (which makes passes at compilers) written by James Hacker.\n\n  <signature of Ty Coon>, 1 April 1989\n  Ty Coon, President of Vice\n\nThis General Public License does not permit incorporating your program into\nproprietary programs.  If your program is a subroutine library, you may\nconsider it more useful to permit linking proprietary applications with the\nlibrary.  If this is what you want to do, use the GNU Lesser General\nPublic License instead of this License.\n"
        },
        {
          "name": "INTERNALS.md",
          "type": "blob",
          "size": 6.0419921875,
          "content": "# Internals\n\nHere is a brief description of how we simulate a circuit.\nSee the book Electronic Circuit and System Simulation Methods by\nPillage, et al for more information.\n\nBasically, we create a matrix.  Each row in the matrix represents\na node in the circuit.  The matrix equation looks like A x = B\nwhere x is a vector containing the voltages of each node.  B\nrepresents the net current in or out of each node, and should be\nall zeroes by Kirchoff's current law, unless there is a current\nsource somewhere.\n\nIf you have a resistor, you want Vb-Va=IR or Vb/R - Va/R = I.  So\nthe net current out of node b and into node a depends on the voltage\nVb and Va.  You add matrix elements -1/R and 1/R at rows a and b\nand columns a and b to reflect this.  (See CirSim.stampResistor()).\nThen after adding all resistors to the matrix, you solve for x, and\nthat gives you the voltage at each node, and from that you can\nderive the currents through each element.  We leave out node 0, the\nground node, because the matrix would be singular otherwise (there\nwould be an infinite number of solutions, because all nodes can be\nshifted up or down by the same voltage).\n\nTo implement a current source of current I, we simply subtract I from\nrow a of the right side vector, and add I to row b.  This\nrepresents a flow of current I from a to b. (CirSim.stampCurrentSource())\n\nWe need to add additional rows to the matrix to implement voltage\nsources.  Each voltage source needs an additional row to enforce\nthe voltage constraint, and also an additional element in x (and\nan extra matrix column) to solve for the current (since we have no other\nway to obtain it).  For a voltage source with voltage Vs across\nnodes a and b, the voltage constraint equation is Vb-Va = Vs.  To express\nthat as a row in the matrix, you add matrix elements 1\nand -1 in the extra row at columns b and a, and set the corresponding\nelement of the right side (B) to Vs.  Also, to represent a flow of\ncurrent I from node a to b, we add matrix elements 1 to -1 in rows\na and b in the extra column.  (CirSim.stampVoltageSource())\nNow when solving for x, we get the voltage at each node, and the\ncurrent through each voltage source.\n\nWhen simulating inductors, the current state changes over time.\nWe use a small timestep value to step through time iteratively to\nsimulate the circuit.  We treat an inductor as a current source in\nparallel with a resistor.  The current source has current equal to\nthe current through the inductor at a particular time.  The resistor\nrepresents resistance to changes in current, and the resistance\nvalue is proportional to the inductance.  So for each time step,\nwe solve the equation, get the new current, and then update\nthe current source value.  (We just need to change the right\nside for this, not the matrix.)\n\nThis is numerical integration, and there are several ways to do it.\nThere's forward Euler which we don't use.  There's backward Euler which is \nmore stable than forward Euler.  And there is trapezoidal which\nis more accurate than backward Euler but less stable.  You can select\neither trapezoidal or backward Euler.  Trapezoidal will give you\nbetter accuracy for something like an LRC circuit or a filter, but\nbackward Euler will give you better stability (much less oscillation)\nif an inductor is suddenly switched on or off.  To implement these\nin our inductors, we simply choose different values for the resistor\nand the current through the current source, depending on which\nmethod is being used.\n\nTo simulate capacitors, you could simulate it as a voltage source\nin series with a resistor.  But this would require two extra rows\nin the matrix.  Instead, we simulate it as a current source in\nparallel with a resistor.  The resistor value is inversely proportional\nto the capacitance, because large capacitors can store more charge\n(accept more current flow) without a large change in voltage.  The\ncurrent from the current source flows in a loop through the resistor\nand this simulates the charge on the capacitor.  This current changes\nafter each timestep, like the inductor.  After each step, we get\nthe new voltage and current and update the current source appropriately.\n\nFor nonlinear devices the matrix must be solved iteratively.  For example,\na diode has current that is an exponential function of the voltage.\nFor that we start with a given voltage and linearize the diode's\nresponse at that point, so we can represent it in the matrix.  We find\nthe tangent line to the diode's response curve at that voltage,\nand that line can be expressed as a resistance (depending on the\nslope of the line) and a current source (depending on its height).\nAfter solving the matrix, we get a new voltage across the diode, and we\ncompare it with the old voltage to see if it's nearly the same.  If\nnot, then we have to calculate a new linearization and create a new\nmatrix.  This continues until it converges on a value that is nearly\nthe same as the previous one.\n\nWhen simulating diodes and transistors, we have to be careful to limit the\nchanges in voltage at each iteration.  Since the response is an\nexponential function, we could easily end up with an enormous current.\nThe linearization could be too large to represent accurately in the\nmatrix.\n\nNonlinear devices require iteration, which requires us to create a new\nmatrix and fully solve it at least once per timestep.  If there are no\nnonlinear devices, we don't need to do this.  The matrix doesn't\nchange, only the right side.  We can partially solve this matrix\nbeforehand, by doing an LU factorization.  This saves a lot of time\nfor large linear circuits, so we do this whenever possible.\nWe call CircuitElm.nonLinear() for each element when analyzing the circuit\nto see if we need to do the extra work.\n\nWhen analyzing a circuit, we call stamp() for each CircuitElm to\ncreate the matrix.  This creates the circuit elements that don't\nchange.  Then for each time step, we call doStep().  This modifies\nthe right side as needed (for linear elements) or modifies the\nmatrix further (for nonlinear elements).  doStep() should also\ncheck to see if we are within convergence limits and set the\nconverged flag to false if not.\n\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 7.6650390625,
          "content": "# CircuitJS1\n\n## Introduction\n\nCircuitJS1 is an electronic circuit simulator that runs in the browser. It was originally written by Paul Falstad as a Java Applet. It was adapted by Iain Sharp to run in the browser using GWT.\n\nFor a hosted version of the application see:\n\n* Paul's Page: [http://www.falstad.com/circuit/](http://www.falstad.com/circuit/)\n* Iain's Page: [http://lushprojects.com/circuitjs/](http://lushprojects.com/circuitjs/)\n\nThanks to: Edward Calver for 15 new components and other improvements; Rodrigo Hausen for file import/export and many other UI improvements; J. Mike Rollins for the Zener diode code; Julius Schmidt for the spark gap code and some examples; Dustin Soodak for help with the user interface improvements; Jacob Calvert for the T Flip Flop; Ben Hayden for scope spectrum; Thomas Reitinger, Krystian Sławiński, Usevalad Khatkevich, Lucio Sciamanna, Mauro Hemerly Gazzani, J. Miguel Silva, and Franck Viard for translations; Andre Adrian for improved emitter coupled oscillator; Felthry for many examples; Colin Howell for code improvements. LZString (c) 2013 pieroxy.\n\n## Building the web application\n\nThe tools you will need to build the project are:\n\n* Eclipse, Oxygen version.\n* GWT plugin for Eclipse.\n\nInstall \"Eclipse for Java developers\" from [here](https://www.eclipse.org/downloads/packages/). To add the GWT plugin for Eclipse follow the instructions [here](https://gwt-plugins.github.io/documentation/gwt-eclipse-plugin/Download.html).\n\nThis repository is a project folder for your Eclipse project space. Once you have a local copy you can then build and run in development mode or build for deployment. Running in super development mode is done by clicking on the \"run\" icon on the toolbar and choosing http://127.0.0.1:8888/circuitjs.html from the \"Development Mode\" tab which appears. Building for deployment is done by selecting the project root node and using the GWT button on the Eclipse taskbar and choosing \"GWT Compile Project...\".\n\nGWT will build its output in to the \"war\" directory. In the \"war\" directory the file \"iframe.html\" is loaded as an iFrame in to the spare space at the bottom of the right hand pannel. It can be used for branding etc.\n\n## Deployment of the web application\n\n* \"GWT Compile Project...\" as explained above. This will put the outputs in to the \"war\" directory in the Eclipse project folder. You then need to copy everything in the \"war\" directory, except the \"WEB-INF\" directory, on to your web server.\n* Customize the header of the file \"circuitjs1.html\" to include your tracking, favicon etc.\n* Customize the \"iframe.html\" file to include any branding you want in the right hand panel of the application\n* The optional file \"shortrelay.php\" is a server-side script to act as a relay to a URL shortening service to avoid cross-origin problems with a purely client solution. You may want to customize this for your site. If you don't want to use this feature edit the circuitjs1.java file before compiling.\n* If you wish to enable dropbox loading and saving a dropbox API app-key is needed. This should be edited in to the circuitjs.html file where needed. If this is not included the relevant features will be disabled.\n\n\nThe link for the full-page version of the application is now:\n`http://<your host>/<your path>/circuitjs1.html`\n(you can rename the \"circuitjs1.html\" file if you want too though you should also update \"shortrelay.php\" if you do).\n\nJust for reference the files should look like this\n\n```\n-+ Directory containing the front page (eg \"circuitjs\")\n  +- circuitjs.html - full page version of application\n  +- iframe.html - see notes above\n  +- shortrelay.php - see notes above\n  ++ circuitjs1 (directory)\n   +- various files built by GWT\n   +- circuits (directory, containing example circuits)\n   +- setuplist.txt (index in to example circuit directory)\n```\n   \n## Embedding\n\nYou can link to the full page version of the application using the link shown above.\n\nIf you want to embed the application in another page then use an iframe with the src being the full-page version.\n\nYou can add query parameters to link to change the applications startup behaviour. The following are supported:\n```\n.../circuitjs.html?cct=<string> // Load the circuit from the URL (like the # in the Java version)\n.../circuitjs.html?ctz=<string> // Load the circuit from compressed data in the URL\n.../circuitjs.html?startCircuit=<filename> // Loads the circuit named \"filename\" from the \"Circuits\" directory\n.../circuitjs.html?startCircuitLink=<URL> // Loads the circuit from the specified URL. CURRENTLY THE URL MUST BE A DROPBOX SHARED FILE OR ANOTHER URL THAT SUPPORTS CORS ACCESS FROM THE CLIENT\n.../circuitjs.html?euroResistors=true // Set to true to force \"Euro\" style resistors. If not specified the resistor style will be based on the user's browser's language preferences\n.../circuitjs.html?usResistors=true // Set to true to force \"US\" style resistors. If not specified the resistor style will be based on the user's browser's language preferences\n.../circuitjs.html?whiteBackground=<true|false>\n.../circuitjs.html?conventionalCurrent=<true|false>\n.../circuitjs.html?running=<true|false> // Start the app without the simulation running, default true\n.../circuitjs.html?hideSidebar=<true|false> // Hide the sidebar, default false\n.../circuitjs.html?hideMenu=<true|false> // Hide the menu, default false\n.../circuitjs.html?editable=<true|false> // Allow circuit editing, default true\n.../circuitjs.html?positiveColor=%2300ff00 // change positive voltage color (rrggbb)\n.../circuitjs.html?negativeColor=%23ff0000 // change negative voltage color\n.../circuitjs.html?hideInfoBox=<true|false>\n```\n## Building an Electron application\n\nThe [Electron](https://electronjs.org/) project allows web applications to be distributed as local executables for a variety of platforms. This repository contains the additional files needed to build circuitJS1 as an Electron application.\n\nThe general approach to building an Electron application for a particular platform is documented [here](https://electronjs.org/docs/tutorial/application-distribution). The following instructions apply this approach to circuit JS.\n\nTo build the Electron application:\n* Compile the application using GWT, as above.\n* Download and unpack a [pre-built Electron binary directory](https://github.com/electron/electron/releases) version 9.3.2 for the target platform.\n* Copy the \"app\" directory from this repository to the location specified [here](https://electronjs.org/docs/tutorial/application-distribution) in the Electron binary directory structure.\n* Copy the \"war\" directory, containing the compiled CircuitJS1 application, in to the \"app\" directory the Electron binary directory structure.\n* Run the \"Electron\" executable file. It should automatically load CircuitJS1.\n\nKnown limitations of the Electron application:\n* \"Create short URL\" on \"Export as URL\" doesn't work as it relies on server support.\n* For diodes, \"Create Simple Model\" doesn't work as it relies on a javascript feature that is not supported.\n\nThanks to @Immortalin for the initial work in applying Electron to CircuitJS1.\n\n## License\n\nThis program is free software; you can redistribute it and/or\nmodify it under the terms of the GNU General Public License\nas published by the Free Software Foundation; either version 2\nof the License, or (at your option) any later version.\n\nThis program is distributed in the hope that it will be useful,\nbut WITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\nGNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License\nalong with this program; if not, write to the Free Software\nFoundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.\n"
        },
        {
          "name": "app",
          "type": "tree",
          "content": null
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "tests",
          "type": "tree",
          "content": null
        },
        {
          "name": "war",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}