{
  "metadata": {
    "timestamp": 1736609076424,
    "page": 334,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjM0MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "dropbox/hackpad",
      "stars": 3545,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.2587890625,
          "content": ".gitattributes export-ignore\n.gitignore export-ignore\nclient export-ignore\nrhino1_7R1 export-ignore\nphantom export-ignore\netherpad/etc/Hackpad-APNS-beta.p12 export-ignore\netherpad/etc/Hackpad-APNS.p12 export-ignore\netherpad/etc/Hackpad-APNS-debug.p12 export-ignore\n"
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 3.7099609375,
          "content": "*~\netherpad/appjet-eth-dev.jar\netherpad/etc/etherpad.local.properties\netherpad/src/etherpad/collab/ace/contentcollector.js\netherpad/src/etherpad/collab/ace/domline.js\netherpad/src/etherpad/collab/ace/easysync1.js\netherpad/src/etherpad/collab/ace/easysync2.js\netherpad/src/etherpad/collab/ace/easysync2_tests.js\netherpad/src/etherpad/collab/ace/linestylefilter.js\netherpad/src/static/js/ace.js\netherpad/src/static/js/colorutils.js\netherpad/src/static/js/cssmanager_client.js\netherpad/src/static/js/domline_client.js\netherpad/src/static/js/easysync2_client.js\netherpad/src/static/js/linestylefilter_client.js\netherpad/*.log\ninfrastructure/lib/cos.jar\nbuild-arch-stamp\nbuild-indep-stamp\nconfigure-stamp\ninfrastructure/lib/mysql-connector*.jar\ndebian/etherpad.debhelper.log\ndebian/etherpad.*.debhelper\ndebian/etherpad.substvars\ndebian/etherpad\ndebian/files\nbuild-stamp\ninfrastructure/lib/mysql-*.jar\n.tags\n.tags_sorted_by_file\n\n# https://gist.github.com/3786883\n#########################\n# .gitignore file for Xcode4 / OS X Source projects\n#\n# NB: if you are storing \"built\" products, this WILL NOT WORK,\n#   and you should use a different .gitignore (or none at all)\n# This file is for SOURCE projects, where there are many extra\n#   files that we want to exclude\n#\n# For updates, see: http://stackoverflow.com/questions/49478/git-ignore-file-for-xcode-projects\n#########################\n\n#####\n# OS X temporary files that should never be committed\n\n.DS_Store\n*.swp\n*.lock\nprofile\n\n\n####\n# Xcode temporary files that should never be committed\n# \n# NB: NIB/XIB files still exist even on Storyboard projects, so we want this...\n\n*~.nib\n\n\n####\n# Xcode build files -\n#\n# NB: slash on the end, so we only remove the FOLDER, not any files that were badly named \"DerivedData\"\n\nDerivedData/\n\n# NB: slash on the end, so we only remove the FOLDER, not any files that were badly named \"build\"\n\nbuild/\n\n\n#####\n# Xcode private settings (window sizes, bookmarks, breakpoints, custom executables, smart groups)\n#\n# This is complicated:\n#\n# SOMETIMES you need to put this file in version control.\n# Apple designed it poorly - if you use \"custom executables\", they are\n#  saved in this file.\n# 99% of projects do NOT use those, so they do NOT want to version control this file.\n#  ..but if you're in the 1%, comment out the line \"*.pbxuser\"\n\n*.pbxuser\n*.mode1v3\n*.mode2v3\n*.perspectivev3\n#    NB: also, whitelist the default ones, some projects need to use these\n!default.pbxuser\n!default.mode1v3\n!default.mode2v3\n!default.perspectivev3\n\n\n####\n# Xcode 4 - semi-personal settings, often included in workspaces\n#\n# You can safely ignore the xcuserdata files - but do NOT ignore the files next to them\n#\n\nxcuserdata\n\n####\n# XCode 4 workspaces - more detailed\n#\n# Workspaces are important! They are a core feature of Xcode - don't exclude them :)\n#\n# Workspace layout is quite spammy. For reference:\n#\n# (root)/\n#   (project-name).xcodeproj/\n#     project.pbxproj\n#     project.xcworkspace/\n#       contents.xcworkspacedata\n#       xcuserdata/\n#         (your name)/xcuserdatad/\n#     xcuserdata/\n#       (your name)/xcuserdatad/\n#\n#\n#\n# Xcode 4 workspaces - SHARED\n#\n# This is UNDOCUMENTED (google: \"developer.apple.com xcshareddata\" - 0 results\n# But if you're going to kill personal workspaces, at least keep the shared ones...\n#\n#\n!xcshareddata\n\n####\n# XCode 4 build-schemes\n#\n# PRIVATE ones are stored inside xcuserdata\n!xcschemes\n\n####\n# Xcode 4 - Deprecated classes\n#\n# Allegedly, if you manually \"deprecate\" your classes, they get moved here.\n#\n# We're using source-control, so this is a \"feature\" that we do not want!\n\n*.moved-aside\n\n\n####\n# UNKNOWN: recommended by others, but I can't discover what these files are\n#\n# ...none. Everything is now explained.\npad.sublime-project\npad.sublime-workspace\n*.xccheckout\n\n"
        },
        {
          "name": ".gitmodules",
          "type": "blob",
          "size": 0.1279296875,
          "content": "[submodule \"infrastructure/SimpleWebRTC\"]\n\tpath = infrastructure/SimpleWebRTC\n\turl = git@github.com:HenrikJoreteg/SimpleWebRTC.git\n"
        },
        {
          "name": "CONTRIBUTORS",
          "type": "blob",
          "size": 1.5458984375,
          "content": "This file has been automatically created using\ngit log | grep Author: | sort | uniq | sed -e \"s+Author: ++g\" > CONTRIBUTORS\nManual annotations in braces. Email addresses might or might not be proper email addresses.\n\nAaron Iba <aaroniba@gmail.com>\nChris Ball <cjb@laptop.org>\nChristian Geier <cg@oberon.local>\nColin Zwiebel <computercolin@etherpad.(none)>\nDan Bentley <dtbentley@gmail.com>\nDavid Greenspan <davidgreenspan@gmail.com>\nEgil Moeller <egil.moller@freecode.no>\nElliot Kroo <elliot.kroo@gmail.com>\nElliot Kroo <elliot@kroo.net>\nElliot Kroo <kroo@appjet.com>\netherpad <etherpad@localhost.(none)>\ngeier <github@lostpackets.de>\nHan Wei <laughinghan@gmail.com>\nholtzermann17 <holtzermann17@gmail.com>\nJeff Mitchell <etherpad@jefferai.org>\nJeppe Toustrup <jeppe@tenzer.dk>\nJoe Corneli <holtzermann17@gmail.com>\nJoe Corneli <joe@planetmath-laptop.(none)>\nJoseph Corneli <jac2349@lwkm013.open.ac.uk>\nMichael Forrest <michael.forrest@gmail.com>\nMichael Prasuhn <mike@mikeyp.net>\nMikko Rantalainen <mikko.rantalainen@peda.net>\nMikyter <mikyter@gmail.com>\npenSec.IT UG (haftungsbeschränkt) <etherpad@pensec.it>\nPer Andersson <avtobiff@gmail.com>\nPeter Martischka <petermartischka@googlemail.com>\nPeter Martischka <pita@googlemail.com>\nPeter Martischka <pita@pitapoison.de>\nredhog <redhog@thalariel.(none)> (Egil Möller)\nroot <root@primarypad.com> (John McLear)\nroot <root@sp.primarypad.com> (John McLear)\nSam Freilich <sam@complexmeme.net>\nSimon Bohlin <simon.bohlin@gmail.com>\nSimon B @piratpartiet <simonb@redhog.org>\nsoh335 <sugarbabe335@gmail.com>\nTechKid <mail@techkid.co.uk>\n"
        },
        {
          "name": "COPYING",
          "type": "blob",
          "size": 11.091796875,
          "content": "\n                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright [yyyy] [name of copyright owner]\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n"
        },
        {
          "name": "DOCKER.md",
          "type": "blob",
          "size": 2.30859375,
          "content": "How to develop Hackpad under Docker\n===================================\n\nIf you'd like to develop Hackpad on Docker, these instructions are for you.\n\nThis will let you edit this repository and see your changes reflected in the docker image. \n\nGetting it running\n-------------------\n\n1. Obviously, if you haven't already, you'll need to install [Docker](https://docs.docker.com/installation/).\n\n2. Build the image. From the root of this repo, run:\n\n\t\tdocker build -t hackpad .\n\n3. Run the container. Docker doesn't let you automatically mount a directory on your host machine in the container, so you'll need to specify by hand. \n\n\tReplace /path/to/this/repo below with the path to the current repository. Leave the other path alone. \n\n\t\tdocker run -d -p 9000:9000 -v /path/to/this/repo:/etc/hackpad/src hackpad\n\n\tThis will build hackpad, run schema migrations, and then start the server. It may take a few minutes. If you want to see what's going on, do:\n\n\t\tdocker logs -f [container name]\n\n4. Fix networking (one time only). If you're on OS X or Windows, you'll need to set up port forwarding to have Hackpad work properly. Linux folk can skip this.\n\n\t1. Open VirtualBox\n\n\t2. Select the `default` image and click Settings\n\n\t3. Go to Network -> Adapter 1 -> Port forwarding\n\n\t4. Create a custom rule like so:\n\n\t\t* Host IP: 127.0.0.1\n\t\t* Host Port: 9000\n\t\t* Guest IP: blank\n\t\t* Guest Port: 9000\n\n\tYou should only have to do this once.\n\n\tAt this point you should be able to open http://localhost:9000 in a browser and see the Hackpad page.\n\n5. Create a password for the admin account.\n\n\tAs part of the Docker setup, Hackpad is configured with 'admin@localhost.info' as a admin account, but you'll need to create a password to log in. \n\n\tTo do that: \n\n\t1. Open http://localhost:9000 and click Log In\n\n\t2. Create an account with 'admin@localhost.info' and any password you like.\n\n\t3. From the command line, run:\n\n\t\t1. Find the name of your running container by running `docker ps`. Note the name. \n\n\t\t2. Run this query and find the token:\n\n\t\t\t\tdocker exec -it [container name] mysql -D hackpad -e 'select * from email_signup;'\n\n\t\t3. Load this in a browser: http://localhost:9000/ep/account/validate-email?email=admin%40localhost.info&token=TOKEN\n\n\nYou're all set!  You should be able to edit the Hackpad source code and the docker container will track those changes.\n\n"
        },
        {
          "name": "Dockerfile",
          "type": "blob",
          "size": 0.2841796875,
          "content": "from ubuntu:14.04\n\nRUN apt-get -y update\n\nRUN apt-get install -yf \\\n    openjdk-7-jdk \\\n    mysql-server \\\n    scala \n\nRUN mkdir /etc/hackpad\n\nVOLUME /etc/hackpad/src\n\nCOPY bin/docker-entrypoint.sh /etc/hackpad/\n\nENTRYPOINT [\"/etc/hackpad/docker-entrypoint.sh\"]\n\nEXPOSE 9000\n\nCMD [\"hackpad\"]"
        },
        {
          "name": "INSTALL",
          "type": "blob",
          "size": 1.650390625,
          "content": "INSTALLATION INSTRUCTIONS\n\nINSTALLING ON POSIX COMPATIBLE SYSTEMS\n\n* Install the dependencies:\n  * Sun Java JDK 7\n  * Scala 2.11: On OS X, it's easiest to install via [Homebrew](http://brew.sh/): `brew install scala`\n  * MySQL: Again, easiest to install via Homebrew: `brew install mysql`\n\n* Edit the file bin/exports.sh (and optionally\n  etherpad/bin/etherpad.default) and change the paths to\n  match your system.\n\n* Run bin/build.sh\n\n* Run contrib/scripts/setup-mysql-db.sh\n\n* Copy etherpad/etc/etherpad.localdev-default.properties to etherpad/etc/etherpad.local.properties\n* Edit etherpad/etc/etherpad.local.properties and set\n   etherpad.superUserEmailAddresses\n       Example: etherpad.superUserEmailAddresses = name1@example.com,name2@example.com\n   topdomains\n       Example: topdomains = yourhostname.com,localhost\n\n* You can now run etherpad via bin/run.sh.  Wait for the HTTP server to start\n  listening, then visit http://localhost:9000.\n\n* Create an account in development\n  * Go through the sign up flow.  At this point, you will have created an\n    account, but it needs to be validated.  If this were production, you would\n    go to your email to click a link in a verification email, but since your\n    development environment does not send email, we will resort to haxx.\n  * Inspect the `email_signup` table in MySQL and find the row with your email\n    address.  Note the token.\n  * Visit http://localhost:9000/ep/account/validate-email?email=YOUR_EMAIL&token=TOKEN\n  * Hurrah, you now have an account!\n\n* If you want emoji support go to https://github.com/github/gemoji/tree/master/images/emoji/unicode\n  and copy the images into etherpad/src/static/img/emoji/unicode/\n\n\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 13.1220703125,
          "content": "\nCopyright (c) 2015 Dropbox, Inc.\n\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\n\nhttp://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software d\nistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\nimplied. See the License for the specific language governing permissions and\nlimitations under the License.\n\n>>>>>>>>>>>>>>\nThis software builds on code released by various organizations. Their\ncopyright and licenses are stated below. The rest is copyright the\nEtherpad Foundation contributors, listed in the CONTRIBUTORS file, and\nlicensed under the Apache License 2.0.\n\n=========================================================================\nCopyright of the original Google code release\n\nThis distribution includes some code written by other organizations.\nThe rest is Copyright 2007-2009 Google Inc. and licensed under the Apache License 2.0.\n=========================================================================\n\n>>>>>>>>>>>>>>\nApache Commons Lang\nCopyright 2001-2008 The Apache Software Foundation\n\nThis product includes software developed by\nThe Apache Software Foundation (http://www.apache.org/).\n\n=========================================================================\n==  NOTICE file corresponding to section 4(d) of the Apache License,   ==\n==  Version 2.0, in this case for the Apache Derby distribution.       ==\n=========================================================================\n\n>>>>>>>>>>>>>>\nApache Derby\nCopyright 2004-2008 The Apache Software Foundation\n\nThis product includes software developed by\nThe Apache Software Foundation (http://www.apache.org/).\n\nPortions of Derby were originally developed by\nInternational Business Machines Corporation and are\nlicensed to the Apache Software Foundation under the\n\"Software Grant and Corporate Contribution License Agreement\",\ninformally known as the \"Derby CLA\".\nThe following copyright notice(s) were affixed to portions of the code\nwith which this file is now or was at one time distributed\nand are placed here unaltered.\n\n(C) Copyright 1997,2004 International Business Machines Corporation.  All rights reserved.\n\n(C) Copyright IBM Corp. 2003.\n\nThe portion of the functionTests under 'nist' was originally\ndeveloped by the National Institute of Standards and Technology (NIST),\nan agency of the United States Department of Commerce, and adapted by\nInternational Business Machines Corporation in accordance with the NIST\nSoftware Acknowledgment and Redistribution document at\nhttp://www.itl.nist.gov/div897/ctg/sql_form.htm\n\n>>>>>>>>>>>>>>\nApache Harmony\nCopyright 2006, 2009 The Apache Software Foundation.\n\nThis product includes software developed at\nThe Apache Software Foundation (http://www.apache.org/).\n\nPortions of Apache Harmony were originally developed by\nIntel Corporation and are licensed to the Apache Software\nFoundation under the \"Software Grant and Corporate Contribution\nLicense Agreement\" and for which the following copyright notices\napply\n         (C) Copyright 2005 Intel Corporation\n         (C) Copyright 2005-2006 Intel Corporation\n         (C) Copyright 2006 Intel Corporation\n\n>>>>>>>>>>>>>>\n==============================================================\n Jetty Web Container\n Copyright 1995-2006 Mort Bay Consulting Pty Ltd\n==============================================================\n\nThe Jetty Web Container is Copyright Mort Bay Consulting Pty Ltd\nunless otherwise noted. It is licensed under the apache 2.0\nlicense.\n\nThe javax.servlet package used by Jetty is copyright\nSun Microsystems, Inc and Apache Software Foundation. It is\ndistributed under the Common Development and Distribution License.\nYou can obtain a copy of the license at\nhttps://glassfish.dev.java.net/public/CDDLv1.0.html.\n\nThe UnixCrypt.java code ~Implements the one way cryptography used by\nUnix systems for simple password protection.  Copyright 1996 Aki Yoshida,\nmodified April 2001  by Iris Van den Broeke, Daniel Deville.\nPermission to use, copy, modify and distribute UnixCrypt\nfor non-commercial or commercial purposes and without fee is\ngranted provided that the copyright notice appears in all copies.\n\nThe default JSP implementation is provided by the Glassfish JSP engine\nfrom project Glassfish http://glassfish.dev.java.net.  Copyright 2005\nSun Microsystems, Inc. and portions Copyright Apache Software Foundation.\n\nSome portions of the code are Copyright:\n  2006 Tim Vernum\n  1999 Jason Gilbert.\n\nThe jboss integration module contains some LGPL code.\n\nThe win32 Java Service Wrapper (v3.2.3) is Copyright (c) 1999, 2006\nTanuki Software, Inc.  and 2001 Silver Egg Technology.  It is\ncovered by an open license which is viewable at\nhttp://svn.codehaus.org/jetty/jetty/branches/jetty-6.1/extras/win32service/LICENSE.txt\n\n>>>>>>>>>>>>>>\nApache Sanselan\nCopyright 2007-2009 The Apache Software Foundation.\n\nThis product includes software developed at\nThe Apache Software Foundation (http://www.apache.org/).\n\n>>>>>>>>>>>>>>\nTagSoup\nCopyright 2002-2008 by John Cowan\n\n>>>>>>>>>>>>>>\ndnsjava:\n\nCopyright (c) 1999-2005, Brian Wellington\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are met:\n\n    * Redistributions of source code must retain the above copyright notice,\n      this list of conditions and the following disclaimer.\n    * Redistributions in binary form must reproduce the above copyright notice,\n      this list of conditions and the following disclaimer in the documentation\n      and/or other materials provided with the distribution.\n    * Neither the name of the dnsjava project nor the names of its contributors\n      may be used to endorse or promote products derived from this software\n      without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND\nANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR\nANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\nLOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON\nANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n>>>>>>>>>>>>>>\njBCrypt:\n\nCopyright (c) 2006 Damien Miller\n\nPermission to use, copy, modify, and distribute this software for any\npurpose with or without fee is hereby granted, provided that the above\ncopyright notice and this permission notice appear in all copies.\n\n>>>>>>>>>>>>>>\nScala:\n\nCopyright (c) 2002-2009 EPFL, Lausanne, unless otherwise specified.\nAll rights reserved.\n\nThis software was developed by the Programming Methods Laboratory of the\nSwiss Federal Institute of Technology (EPFL), Lausanne, Switzerland.\n\nPermission to use, copy, modify, and distribute this software in source\nor binary form for any purpose with or without fee is hereby granted,\nprovided that the following conditions are met:\n\n   1. Redistributions of source code must retain the above copyright\n      notice, this list of conditions and the following disclaimer.\n\n   2. Redistributions in binary form must reproduce the above copyright\n      notice, this list of conditions and the following disclaimer in the\n      documentation and/or other materials provided with the distribution.\n\n   3. Neither the name of the EPFL nor the names of its contributors\n      may be used to endorse or promote products derived from this\n      software without specific prior written permission.\n\n\nTHIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND\nANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\nARE DISCLAIMED. IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE\nFOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\nDAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\nSERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER\nCAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\nLIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY\nOUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGE.\n\n>>>>>>>>>>>>>>\nYUI Compressor:\n\nCopyright (c) 2009, Yahoo! Inc.\nAll rights reserved.\n\nRedistribution and use of this software in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n    * Redistributions of source code must retain the above copyright notice,\n      this list of conditions and the following disclaimer.\n    * Redistributions in binary form must reproduce the above copyright notice,\n      this list of conditions and the following disclaimer in the documentation\n      and/or other materials provided with the distribution.\n    * Neither the name of Yahoo! Inc. nor the names of its contributors may be\n      used to endorse or promote products derived from this software without\n      specific prior written permission of Yahoo! Inc.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND\nANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR\nANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\nLOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON\nANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n>>>>>>>>>>>>>>\njQuery\nCopyright (c) 2009 John Resig, http://jquery.com/\n\nPermission is hereby granted, free of charge, to any person obtaining\na copy of this software and associated documentation files (the\n\"Software\"), to deal in the Software without restriction, including\nwithout limitation the rights to use, copy, modify, merge, publish,\ndistribute, sublicense, and/or sell copies of the Software, and to\npermit persons to whom the Software is furnished to do so, subject to\nthe following conditions:\n\nThe above copyright notice and this permission notice shall be\nincluded in all copies or substantial portions of the Software.\n\n>>>>>>>>>>>>>>\njQuery Pulse:\n\nCopyright (c) 2008 James Padolsey - jp(at)qd9(dot)co.uk | http://james.padolsey.com / http://enhance.qd-creative.co.uk\n\nPermission is hereby granted, free of charge, to any person obtaining\na copy of this software and associated documentation files (the\n\"Software\"), to deal in the Software without restriction, including\nwithout limitation the rights to use, copy, modify, merge, publish,\ndistribute, sublicense, and/or sell copies of the Software, and to\npermit persons to whom the Software is furnished to do so, subject to\nthe following conditions:\n\nThe above copyright notice and this permission notice shall be\nincluded in all copies or substantial portions of the Software.\n\n>>>>>>>>>>>>>>\nSWFObject v1.5\nCopyright (c) 2007 Geoff Stearns\n\nLicensed under the MIT License\n\n>>>>>>>>>>>>>>\njQuery Context Menu Plugin:\n\nOriginal version copyright 2008 A Beautiful Site, LLC. Modifications by AppJet, Inc. released under the same license.\n\nPermission is hereby granted, free of charge, to any person obtaining\na copy of this software and associated documentation files (the\n\"Software\"), to deal in the Software without restriction, including\nwithout limitation the rights to use, copy, modify, merge, publish,\ndistribute, sublicense, and/or sell copies of the Software, and to\npermit persons to whom the Software is furnished to do so, subject to\nthe following conditions:\n\nThe above copyright notice and this permission notice shall be\nincluded in all copies or substantial portions of the Software.\n\n>>>>>>>>>>>>>>\nc3p0\nCopyright (c) 2006 Machinery for Change, Inc.\n\nLicensed under the LGPL 2.1\n\n>>>>>>>>>>>>>>\nJCommon, JFreeChart\nCopyright (c) 2007-2009 Object Refinery Limited\n\nLicensed under the LGPL 2.1\n\n>>>>>>>>>>>>>>\nMozilla Rhino\n\nLicensed under the MPL 1.1, GPL 2.0 or later\n\n\n>>>>>>>>>>>>>>\nMySQL Connector\n\nLicensed uder the GPL 2.0 or later with the FOSS exception\n\n#### Emoji One Artwork\n\n*  Applies to all PNG and SVG files as well as any adaptations made.\n*  License: Creative Commons Attribution-ShareAlike 4.0 International\n*  Human Readable License: http://creativecommons.org/licenses/by-sa/4.0/\n*  Complete Legal Terms: http://creativecommons.org/licenses/by-sa/4.0/legalcode\n\n\n#### Emoji One Non-Artwork\n\n*  Applies to the Javascript, JSON, PHP, CSS, HTML files, and everything else not covered under the artwork license above.\n*  License: MIT\n*  Complete Legal Terms: http://opensource.org/licenses/MIT\n\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 5.0546875,
          "content": "# About Hackpad\nHackpad is a web-based realtime wiki, based on the open source EtherPad collaborative document editor.\n\nThere is no active development happening in this repository, but we'll maintain a list of active forks to the best of our knowledge.\nNote that none of these are affiliated with Dropbox or hackpad.com in any way.\n\nIf you'd like to have your fork listed, send us a pull request.  \n\nHere's the list:\n\n- https://github.com/hackpad/hackpad\n\n---\nThe etherpad package is distributed under the Apache License, Version 2.0.\n\nAll other packages are redistributed under their original license terms.  See below for a license summary of redistributed software.  More comprehensive license information can be found in the documentation of each package.\n\nThis document contains licensing information relating to the use of free and open-source software (FOSS) with or within the Hackpad software.  The authors, licensors, and distributors of the FOSS disclaim all express or implied conditions, representations, and warranties relating to the FOSS and any liability arising from use and distribution of the FOSS.\n\nThis document identifies the FOSS packages used in the Hackpad software, the FOSS licenses that Dropbox believes govern those FOSS packages.  While Dropbox has sought to provide complete and accurate licensing information for each FOSS package, Dropbox does not represent or warrant that the licensing information provided herein is correct or error-free.  Recipients of the Hackpad software should investigate the identified FOSS packages to confirm the accuracy of the licensing information provided herein.  Recipients are also encouraged to notify Dropbox of any inaccurate information or errors found in these notices.\n\n\n------\n\n\n## Apache License, Version 2.0\n\nsolr\nhttp://lucene.apache.org/solr/\n\nsmack api\nhttp://www.igniterealtime.org/projects/smack/\n\ngdata java client\nhttps://code.google.com/p/gdata-java-client/\n\nFacebookSDK.framework\nhttps://developers.facebook.com/docs/ios/\n\nGoogleToolbox\nhttps://code.google.com/p/google-toolbox-for-mac/\n\nOCMock\nhttps://github.com/erikdoe/ocmock/blob/master/Source/License.txt\n\n## MIT and MIT-Style Licenses\n\nbililiteRange.js\nhttps://github.com/dwachss/bililiteRange\n\nhandlebars.js\nhttps://github.com/wycats/handlebars.js/blob/master/LICENSE\n\nhtml5shiv\nhttps://code.google.com/p/html5shiv/\n\ni18next\nhttp://i18next.com/\n\nJQuery\nhttp://jquery.com/\n\nJQueryUI\nhttp://jqueryui.com/\n\njquery.ajaxqueue.js\nhttp://www.onemoretake.com/2009/10/11/ajaxqueue-and-jquery-1-3/\n\njquery.autocomplete.js\nhttp://bassistance.de/jquery-plugins/jquery-plugin-autocomplete/\n\njquery.ba-dotimeout.min.js\nhttp://benalman.com/projects/jquery-dotimeout-plugin/\n\njquery.color.js\nhttps://github.com/jquery/jquery-color\n\njquery.contextMenu.js\nhttps://github.com/medialize/jQuery-contextMenu\n\njquery.customSelect.js\nhttps://github.com/adamcoulombe/jquery.customSelect\n\njquery.embedly.js\nhttps://github.com/embedly/embedly-jquery\n\njquery.handsontable.js\nhttp://handsontable.com/\n\njquery.placeholder.js\nhttps://github.com/mathiasbynens/jquery-placeholder\n\njquery.sendkeys.js\nhttps://github.com/dwachss/bililiteRange\n\njquery.tablesorter.js\nhttp://tablesorter.com/docs/\n\njquery.textcomplete.min.js\nhttps://github.com/yuku-t/jquery-textcomplete/\n\njquery.tinysort.js\nhttp://tinysort.sjeiti.com/\n\njquery.ui.position.js\nhttp://jqueryui.com/\n\njquery.ui.touch-punch.min.js\nhttp://touchpunch.furf.com/\n\njquery.validate.js\nhttp://bassistance.de/jquery-plugins/jquery-plugin-validation/\n\njquery.transition.js\nhttps://github.com/louisremi/jquery.transition.js/\n\nless-1.4.1.min.js\nhttp://www.lesscss.org/\n\nLESS Hat\nhttp://LESSHat.com/\n\npagedown\nhttps://code.google.com/p/pagedown/source/browse/LICENSE.txt\n\nrequire.js\nhttp://github.com/jrburke/requirejs\n\nselectivizr-min.js\nhttp://selectivizr.com/\n\nsimplewebrtc.bundle.js\nhttps://github.com/HenrikJoreteg/SimpleWebRTC\n\nsocket.io.js\nhttps://github.com/LearnBoost/socket.io-client\n\nACE Syntax Highlighter (tokenizer.js)\nhttp://ace.c9.io/\n\nto-markdown\nhttps://github.com/domchristie/to-markdown\n\nunicode.js\nhttp://xregexp.com\n\nMBProgressHUD\nhttps://github.com/jdg/MBProgressHUD\n\nWebViewJavascriptBridge\nhttps://github.com/marcuswestin/WebViewJavascriptBridge/blob/master/LICENSE\n\nJavaScript Pretty Date\nhttp://ejohn.org/blog/javascript-pretty-date/\n\nJSON Framework\nhttps://code.google.com/p/json-framework/\n\nEmoji One Non-Artwork\nhttps://github.com/Ranks/emojione\n\nZeroClipboard\nhttps://github.com/zeroclipboard/zeroclipboard\n\n## BSD and BSD-Style Licenses\n\njava-apns\nhttps://github.com/notnoop/java-apns\n\nglue sprite generator\nhttps://github.com/jorgebastida/glue\n\nNSAttributedString+DDHTML\nhttps://github.com/dbowen/NSAttributedString-DDHTML/\n\nRNCachingURLProtocol\nhttps://github.com/rnapier/RNCachingURLProtocol\n\nSente Testing Kit\nhttp://www.quantum-step.com/download/sources/mystep/OCUnit/SourceCode/SenTestingKit/OpenSourceLicense.html\n\nASIHTTPRequest\nhttp://allseeing-i.com/ASIHTTPRequest/\n\n## Other Licenses\n\njquery.autoresize.js\nhttps://github.com/warpech/jQuery.fn.autoResize\n\nvocaro.com UIImage Resize\nhttps://gist.github.com/benilovj/2009030\n\nEmoji One Artwork\nhttps://github.com/Ranks/emojione\n"
        },
        {
          "name": "bin",
          "type": "tree",
          "content": null
        },
        {
          "name": "client",
          "type": "tree",
          "content": null
        },
        {
          "name": "contrib",
          "type": "tree",
          "content": null
        },
        {
          "name": "etherpad",
          "type": "tree",
          "content": null
        },
        {
          "name": "infrastructure",
          "type": "tree",
          "content": null
        },
        {
          "name": "lib",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}