{
  "metadata": {
    "timestamp": 1736710656874,
    "page": 6,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjEw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "flutter/samples",
      "stars": 17601,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.8720703125,
          "content": "# Auto detect text files and perform LF normalization\n*        text=auto\n\n# Always perform LF normalization on these files\n*.c      text\n*.cc     text\n*.cmake  text\n*.dart   text\n*.gradle text\n*.h      text\n*.html   text\n*.java   text\n*.json   text\n*.md     text\n*.py     text\n*.sh     text\n*.swift  text\n*.txt    text\n*.xml    text\n*.yaml   text\n\n# Make sure that these Windows files always have CRLF line endings in checkout\n*.bat             text eol=crlf\n*.ps1             text eol=crlf\n*.rc              text eol=crlf\n*.sln             text eol=crlf\n*.props           text eol=crlf\n*.vcxproj         text eol=crlf\n*.vcxproj.filters text eol=crlf\n# Including templatized versions.\n*.sln.tmpl        text eol=crlf\n*.props.tmpl      text eol=crlf\n*.vcxproj.tmpl    text eol=crlf\n\n# Never perform LF normalization on these files\n*.ico    binary\n*.jar    binary\n*.png    binary\n*.zip    binary"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 1.466796875,
          "content": "# Miscellaneous\n*.class\n*.log\n*.pyc\n*.swp\n.DS_Store\n.atom/\n.buildlog/\n.history\n.svn/\n\n# IntelliJ related\n*.iml\n*.ipr\n*.iws\n.idea/\n\n# Visual Studio Code related\n.vscode/\n\n# Flutter/Dart/Pub related\n**/doc/api/\n.dart_tool/\n.flutter-plugins\n.flutter-plugins-dependencies\n.packages\n.pub-cache/\n.pub/\n/build/\n\n# Android related\n**/gradle-wrapper.jar\n**/android/.gradle\n**/android/captures/\n**/android/gradlew\n**/android/gradlew.bat\n**/android/local.properties\n**/android/**/GeneratedPluginRegistrant.*\n\n# iOS/XCode related\n**/ios/**/*.mode1v3\n**/ios/**/*.mode2v3\n**/ios/**/*.moved-aside\n**/ios/**/*.pbxuser\n**/ios/**/*.perspectivev3\n**/ios/**/*sync/\n**/ios/**/.sconsign.dblite\n**/ios/**/.tags*\n**/ios/**/.vagrant/\n**/ios/**/DerivedData/\n**/ios/**/Icon?\n**/ios/**/Pods/\n**/ios/**/.symlinks/\n**/ios/**/profile\n**/ios/**/xcuserdata\n**/ios/.generated/\n**/ios/Flutter/App.framework\n**/ios/Flutter/Flutter.framework\n**/ios/Flutter/Generated.xcconfig\n**/ios/Flutter/app.flx\n**/ios/Flutter/app.zip\n**/ios/Flutter/flutter_assets/\n**/ios/Flutter/flutter_export_environment.sh\n**/ios/ServiceDefinitions.json\n**/ios/Runner/GeneratedPluginRegistrant.*\n\n# Web related\n**/web/**/lib/generated_plugin_registrant.dart\n\n# Service account files\nsvc-keyfile.json\n\n# Lockfiles\nPodfile.lock\npubspec.lock\nyarn.lock\n\n# Exceptions to above rules.\n!**/ios/**/default.mode1v3\n!**/ios/**/default.mode2v3\n!**/ios/**/default.pbxuser\n!**/ios/**/default.perspectivev3\n!/packages/flutter_tools/test/data/dart_dependencies_test/**/.packages\n"
        },
        {
          "name": "AUTHORS",
          "type": "blob",
          "size": 0.25,
          "content": "# Below is a list of people and organizations that have contributed\n# to the project. Names should be added to the list like so:\n#\n#   Name/Organization <email address>\n\nGoogle Inc.\nAbhijeeth Padarthi <rkinabhi@gmail.com>\nFilip Hracek <filip@raindead.com>\n"
        },
        {
          "name": "CHANGELOG.md",
          "type": "blob",
          "size": 1.615234375,
          "content": "# Changelog\n\nThe purpose of this changelog is to track the freshness of samples and which\nsamples reflect *current best practices*. It describes **human-made, significant\n** changes made to the repository or samples in the repository.\n\nWhile all samples in this repository build and run, some of them were written\nlong ago, and no longer reflect what we want developers to learn. For example,\nsamples should have been refactored when Dart 3 released to include patterns and\nrecords, where appropriate.\n\n* **DO include:**\n    * The addition of new samples.\n    * The removal of existing samples.\n    * Considerable refactoring of any given sample.\n\n* **DO NOT include:**\n    * Simple changes that reflect minor version bumps in Flutter. For example,\n      in a recent Flutter update, `Color.red` became `Color.r`.\n    * Dependency updates.\n    * Bug fixes.\n    * Any changes made to simply 'keep the lights on'.\n\n# Log\n\n| DATE (YYYY-MM-DD) | Sample(s)         | author       | Changes                                       |\n|-------------------|-------------------|--------------|-----------------------------------------------|\n| NEXT GOES HERE    |                   |              |                                               |\n|                   |                   |              |                                               |\n| 2024-12-04        | N/A - repo change | ericwindmill | Added changelog                               |\n| 2024-11-27        | fake_sample       | ericwindmill | Refactored fake_sample to use Dart 3 features |\n| 2020-04-17        | fake_sample       | ericwindmill | Created fake_sample                           |\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 12.671875,
          "content": "# Contributing\n\nWant to contribute to the Flutter sample ecosystem? Great! First, read this\npage (including the small print at the end).\n\nDo you work at Google? Great! You should **definitely** read this page before submitting a PR :)\n  \n* [Before you contribute]\n* [Contribute enhancements and fixes]\n* [Writing a new sample]\n* [Sample checklist]\n\n_See also: [Flutter's code of conduct]_\n\n<br />\n\n# Before you contribute\n\n\n## Is this the right place for your sample?\n\nIn most cases, if you've written a great sample app, it should be maintained \nin your own repoistory. You can maintain your sample app in your own repo \n(or with another source control provider) and still be as important a part of \nthe Flutter-verse as anything you see here.\n\n**What should be contributed here, then?**\n\nFixes and necessary improvements to the existing samples, mostly. \n\n## File an issue first!\n\nIf you see a bug or have an idea for a feature that you feel would improve one\nof the samples already in the repo, **please [file an issue] before you begin\ncoding or send a PR**. This will help prevent duplicate work by letting us know\nwhat you're up to. It will help avoid a situation in which you spend a lot of\ntime coding something that's not quite right for the repo or its goals.\n\n## Sign the license agreement.\n\nBefore we can use your code, you must sign the\n[Google Individual Contributor License Agreement]\n(CLA), which you can do online. The CLA is necessary mainly because you own the\ncopyright to your changes, even after your contribution becomes part of our\ncodebase, so we need your permission to use and distribute your code. We also\nneed to be sure of various other things—for instance that you'll tell us if you\nknow that your code infringes on other people's patents. You don't have to sign\nthe CLA until after you've submitted your code for review and a member has\napproved it, but you must do it before we can put your code into our codebase.\n\nBefore you start working on a larger contribution, you should get in touch with\nus first through the issue tracker with your idea so that we can help out and\npossibly guide you. Coordinating up front makes it much easier to avoid\nfrustration later on.\n\n<br />\n\n# Contribute enhancements and fixes\n\nEnhancements and bug fixes are welcome and appreciated. \nIf you spot an [issue] that you might want to fix but aren't sure how to get started, \nfeel free to comment on the issue and tag @ericwindmill with questions.\n\n## Filing issues and evaluating existing samples\n\nYou can also contribute by filing issues against existing samples. This is thankless work\nand is _greatly_ appreciated. It's also a good way to familiarize yourself with the repository.\n\nTo evaluate a sample for possible issues, use the [Sample checklist] below.\n\n<br />\n\n# Writing a new sample\n\nBefore filing an issue for a new sample or submitting a PR, you must read the rest of this page.\n\n## What is a sample? \n\nSamples are reference materials that teach developers how to solve a specific problem. \nSamples contain **correct and concise code** that developers can \n**quickly understand** and **easily reuse** with minimal side effects.\n\n### What samples should we have?\n\nSamples in this repo demonstrates how to **use current features** of the **Flutter and Dart SDKs** using **best practices**. \nIn other words, a sample should meet the following criteria:\n\n* Demonstrates _how to use the SDKS_ rather than show an end-product.\n* Covers a critical developer journey in the SDK that is useful to >80% of developers.\n* Prefers primitives in the SDK over libraries.\n* Demonstrates features available on the stable channel of Flutter.\n\nThese guidelines can be broken in rare cases. For example, this is likely the best place in the \nFlutter github org for demo apps, but those demo apps must be justified.\n\n## Is this the right place for your sample? (revisited)\n\nValidate your idea against the following criteria:\n\n1. **The sample solves a single problem or set of tightly coupled problems.** <br/>\n    If not, you're either writing a Demo app or an extended sample. These might \n    still be appropriate for the samples repos, but need to be justified.\n\n2. **The target audience for the sample isn’t beginners.**\n3. **The sample code isn’t so complex that it needs video or text explanation.** <br />\n    Samples are reference materials, and the code should speak for itself. If either of these aren't true, \n    you may prefer to write a blogpost or tutorial. \n\n5. **The sample isn’t tied to an event.** <br />\n    If it is, you should likely use a personal repository.\n\n5. **The sample isn’t tied to a library or package.** <br />\n    If it is, the usage example should likely be in the [repository of that package].\n\n6. **The topic doesn’t have crossover with any existing samples.** <br />\n    If it does, ensure that it wouldn't be better to update the existing sample.\n\n## What are your ongoing maintenance resposibilities?\n\nAll sample code has an unbound maintenance cost. If you cannot commit to maintaining a sample \n(for the forseeable future, barring changes in life circumstances), then you should talk to the\n[primary maintainers] of this project, particularly @ericwindmill, before submitting a PR.\n\nAny new sample **must** have a CODEOWNER, and that owner is most likely you (the author).\n\n## What type of sample are your writing?\n\nThis repository contains two types of sample apps: **quickstarts** and **demo apps**.\n\n### Quickstarts\n\n* **Purpose**: Provides starting points that a developer can extend. \n    Solves specific problems or implements generic app features.\n* **Size**: <= 200 lines of code, not including boiler plate (guide, not rule)\n* **Qualities:**\n    * Contains one feature or a small set of related features, but generally runnable.\n    * Generic and un-opinionated about the context in which it is used.\n    * Prioritizes being generic over best practices.\n    * The code is Copy+paste-able.\n      * In Flutter, this means that the code that is being demonstrated should be separated from and boiler plate (i.e. `runApp`)\n* **Audience:**\n    * Developers with Flutter and Dart experience that don't need code explained to them.\n* **Answers the questions:**\n    * “What’s the minimal amount of code needed to implement this feature…”\n        * “... so I can understand how it works?”\n        * “... so I can understand how to add it to my app?”\n    * “How can I make sure I know how to extend this feature without missing anything?”\n    * \"What code should I use as a starting point given I want to solve a very similar problem?\"\n\n### Demo apps\n\n* **Purpose**: Meant to be built and ran. Demos the _product_, not how to write code.\n* **Criteria**: Demo apps _only_ belong here if they...\n   * ...aren't tied to an event or moment in time.\n   * ...aren't tied to another resource (website, workshop, etc).\n   * ...don't require explanation (other than a short README).\n   * ...aren't primarily used to demonstrate an SDK feature.\n\n### Other sample types\n\nOther sample types, like demo apps that accompany docs or events, do not belong in this repository.\nThey should be maintained alongside the accompanying resources (i.e. in the website repository), or in a personal repository.\n\n### The `experimental` folder\n\nThe experimental folder is being deprecated. If you have an experiemental sample project, \nyou should manage it in a personal repository until it runs on the stable channel.\n\n<br />\n\n# Sample checklist\n\nEvery piece of code will have value to someone, but it is easy for maintenance costs to grow over time.\nThe more items checked on this list, the higher the value and lower the maintenance costs.\n\nUse this checklist to write new samples and evaluate existing ones.\n\n**NB:** Demo apps have looser requirements. Use your best judgement when following the guidelines.\n\n* Code\n    - [ ] Be designed to build against the current [stable]\n          release of the Flutter SDK.\n    - [ ] Sample is the only one for the API in question (across all Dash samples)\n    - [ ] Repository and pubspec name are titled for its ingredients (i.e. mvvm_architecture instead of compass_app)\n    - [ ] Only includes the minimal required code to demonstrate the feature or API and run the code.\n    - [ ] Sample favors 1P dependencies over 3P.\n    - [ ] Code has been sufficiently explained with doc comments.\n    - [ ] The sample app separates its bespoke code from general Flutter or Dart code.\n    - [ ] Favor readability over best practices unless readability requires an anti pattern. Use your best judgment.\n    - [ ] Avoid adding an onerous amount of blobs (typically images or other assets) to the repo.\n    - [ ] All files in the project must start with the appropriate [file headers].\n\n* Tests, style and maintenance\n    - [ ] Sample has Dart tests that cover the business logic\n    - [ ] Sample is wired into the list of projects in the CI scripts for [stable](tool/flutter_ci_script_stable.sh), \n      [beta](tool/flutter_ci_script_beta.sh), and [master](tool/flutter_ci_script_master.sh), \n      which runs the analyzer, the formatter, and `flutter test`.\n    - [ ] Sample has a codeowner (it's likely you, the author)\n    - [ ] Sample is formatted with `dart format`.\n    - [ ] Sample has no analyzer errors or warnings.\n    - [ ] Add the new project directory to the [dependabot](.github/dependabot.yaml) configuration\n      to keep dependencies updated in an on-going basis.\n    - [ ] Follows the [Flutter style guide]\n    - [ ] Include the top level [`analysis_options.yaml`](analysis_options.yaml)\n      file used throughout the repo. This file include a base set of analyzer\n      conventions and lints.\n\n* README\n    - [ ] Describes the apps design and purpose.\n    - [ ] Describes common errors and debugging steps.\n    - [ ] Describes any steps necessary to build and run.\n    - [ ] Has ‘Open in IDX’ button, and a nix file (if compatible with IDX).\n\n## File headers\n\nAll files in the project must start with the following header.\n\n```\n// Copyright 2024 The Flutter team. All rights reserved.\n// Use of this source code is governed by a BSD-style license that can be\n// found in the LICENSE file.\n```\n\n<br />\n\n# Code reviews\n\nAll submissions, including submissions by project members, require review.\n\nThis repo is part of the [Flutter](https://github.com/flutter) GitHub account,\nwhich means that a lot of folks have the ability to push and merge code. The\nprimary maintainers, though, are:\n\n* [@RedBrogdon](https://github.com/RedBrogdon)\n* [@johnpryan](https://github.com/johnpryan)\n* [@domesticmouse](https://github.com/domesticmouse)\n* [@ericwindmill](https://github.com/ericwindmill)\n\nYou are free to add one of these folks (particularly @ericwindmill) as a reviewer\nto any PR sent to this repo. We're happy to comment, answer (or ask) questions,\nand provide feedback.\n\nIf you're part of a team that's already landed a sample in the repo (Hi,\nMaterial!), and you're updating or fixing that sample, you are *not* expected to\nwait on one of the above folks before merging the code. Have it reviewed by\nsomeone you trust on your own team, and then merge it.\n\nHowever, if you're adding a new sample, updating a sample you've never worked on\nbefore, or changing something that's a meta-concern like the CI setup, web\nhosting, project setup, etc., please include one of the primary maintainers as a\nreviewer.\n\n<br />\n\n# The small print\n\nContributions made by corporations are covered by a different agreement than the\none above, the [Software Grant and Corporate Contributor License Agreement].\n\n[Flutter's code of conduct]: https://github.com/flutter/flutter/blob/master/CODE_OF_CONDUCT.md\n[Before you contribute]: https://github.com/flutter/samples/blob/main/CONTRIBUTING.md#before-you-contribute\n[Contribute enhancements and fixes]: https://github.com/flutter/samples/blob/main/CONTRIBUTING.md#contribute-enhancements-and-fixes\n[Writing a new sample]: https://github.com/flutter/samples/blob/main/CONTRIBUTING.md#writing-a-new-sample\n[Sample checklist]: https://github.com/flutter/samples/blob/main/CONTRIBUTING.md#samples-checklist\n[file headers]: https://github.com/flutter/samples/blob/main/CONTRIBUTING.md#file-headers\n[Software Grant and Corporate Contributor License Agreement]: https://developers.google.com/open-source/cla/corporate\n[issue]: https://github.com/flutter/samples/issues\n[file an issue]: https://github.com/flutter/samples/issues/new\n[repository of that package]: https://dart.dev/tools/pub/package-layout#examples\n[stable]: https://github.com/flutter/flutter/blob/master/docs/releases/Flutter-build-release-channels.md\n[Flutter style guide]: (https://github.com/flutter/flutter/blob/master/docs/contributing/Style-guide-for-Flutter-repo.md)\n[Google Individual Contributor License Agreement]: https://cla.developers.google.com/about/google-individual\n[primary maintainers]: https://github.com/flutter/samples/blob/main/CONTRIBUTING.md#code-reviews\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 17.0673828125,
          "content": "// Copyright 2014 The Chromium Authors. All rights reserved.\n//\n// Redistribution and use in source and binary forms, with or without\n// modification, are permitted provided that the following conditions are\n// met:\n//\n//    * Redistributions of source code must retain the above copyright\n// notice, this list of conditions and the following disclaimer.\n//    * Redistributions in binary form must reproduce the above\n// copyright notice, this list of conditions and the following disclaimer\n// in the documentation and/or other materials provided with the\n// distribution.\n//    * Neither the name of Google Inc. nor the names of its\n// contributors may be used to endorse or promote products derived from\n// this software without specific prior written permission.\n//\n// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n// \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\n// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\n// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\n// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\n// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\n// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\n// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\n// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n--------------------------------------------------------------------------------\nCopyright (c) 2014, Vaibhav Singh (design) and Rosetta Type Foundry s.r.o. (post-production).\n\nThis Font Software is licensed under the SIL Open Font License, Version 1.1.\nThis license is copied below, and is also available with a FAQ at:\nhttp://scripts.sil.org/OFL\n\n\n-----------------------------------------------------------\nSIL OPEN FONT LICENSE Version 1.1 - 26 February 2007\n-----------------------------------------------------------\n\nPREAMBLE\nThe goals of the Open Font License (OFL) are to stimulate worldwide\ndevelopment of collaborative font projects, to support the font creation\nefforts of academic and linguistic communities, and to provide a free and\nopen framework in which fonts may be shared and improved in partnership\nwith others.\n\nThe OFL allows the licensed fonts to be used, studied, modified and\nredistributed freely as long as they are not sold by themselves. The\nfonts, including any derivative works, can be bundled, embedded,\nredistributed and/or sold with any software provided that any reserved\nnames are not used by derivative works. The fonts and derivatives,\nhowever, cannot be released under any other type of license. The\nrequirement for fonts to remain under this license does not apply\nto any document created using the fonts or their derivatives.\n\nDEFINITIONS\n\"Font Software\" refers to the set of files released by the Copyright\nHolder(s) under this license and clearly marked as such. This may\ninclude source files, build scripts and documentation.\n\n\"Reserved Font Name\" refers to any names specified as such after the\ncopyright statement(s).\n\n\"Original Version\" refers to the collection of Font Software components as\ndistributed by the Copyright Holder(s).\n\n\"Modified Version\" refers to any derivative made by adding to, deleting,\nor substituting -- in part or in whole -- any of the components of the\nOriginal Version, by changing formats or by porting the Font Software to a\nnew environment.\n\n\"Author\" refers to any designer, engineer, programmer, technical\nwriter or other person who contributed to the Font Software.\n\nPERMISSION & CONDITIONS\nPermission is hereby granted, free of charge, to any person obtaining\na copy of the Font Software, to use, study, copy, merge, embed, modify,\nredistribute, and sell modified and unmodified copies of the Font\nSoftware, subject to the following conditions:\n\n1) Neither the Font Software nor any of its individual components,\nin Original or Modified Versions, may be sold by itself.\n\n2) Original or Modified Versions of the Font Software may be bundled,\nredistributed and/or sold with any software, provided that each copy\ncontains the above copyright notice and this license. These can be\nincluded either as stand-alone text files, human-readable headers or\nin the appropriate machine-readable metadata fields within text or\nbinary files as long as those fields can be easily viewed by the user.\n\n3) No Modified Version of the Font Software may use the Reserved Font\nName(s) unless explicit written permission is granted by the corresponding\nCopyright Holder. This restriction only applies to the primary font name as\npresented to the users.\n\n4) The name(s) of the Copyright Holder(s) or the Author(s) of the Font\nSoftware shall not be used to promote, endorse or advertise any\nModified Version, except to acknowledge the contribution(s) of the\nCopyright Holder(s) and the Author(s) or with their explicit written\npermission.\n\n5) The Font Software, modified or unmodified, in part or in whole,\nmust be distributed entirely under this license, and must not be\ndistributed under any other license. The requirement for fonts to\nremain under this license does not apply to any document created\nusing the Font Software.\n\nTERMINATION\nThis license becomes null and void if any of the above conditions are\nnot met.\n\nDISCLAIMER\nTHE FONT SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT\nOF COPYRIGHT, PATENT, TRADEMARK, OR OTHER RIGHT. IN NO EVENT SHALL THE\nCOPYRIGHT HOLDER BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,\nINCLUDING ANY GENERAL, SPECIAL, INDIRECT, INCIDENTAL, OR CONSEQUENTIAL\nDAMAGES, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING\nFROM, OUT OF THE USE OR INABILITY TO USE THE FONT SOFTWARE OR FROM\nOTHER DEALINGS IN THE FONT SOFTWARE.\n\n--------------------------------------------------------------------------------\n\n                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright [yyyy] [name of copyright owner]\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n"
        },
        {
          "name": "PATENTS",
          "type": "blob",
          "size": 1.0810546875,
          "content": "Google hereby grants to you a perpetual, worldwide, non-exclusive,\nno-charge, royalty-free, irrevocable (except as stated in this\nsection) patent license to make, have made, use, offer to sell, sell,\nimport, transfer, and otherwise run, modify and propagate the contents\nof this implementation, where such license applies only to those\npatent claims, both currently owned by Google and acquired in the\nfuture, licensable by Google that are necessarily infringed by this\nimplementation. This grant does not include claims that would be\ninfringed only as a consequence of further modification of this\nimplementation. If you or your agent or exclusive licensee institute\nor order or agree to the institution of patent litigation or any other\npatent enforcement activity against any entity (including a\ncross-claim or counterclaim in a lawsuit) alleging that this\nimplementation constitutes direct or contributory patent infringement,\nor inducement of patent infringement, then any patent rights granted\nto you under this License for this implementation shall terminate as\nof the date such litigation is filed.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 9.1201171875,
          "content": "# Flutter samples\n\n[![Build Status](https://github.com/flutter/samples/workflows/Main%20Branch%20CI/badge.svg)](https://github.com/flutter/samples/actions?workflow=Main%20Branch%20CI)\n\nA collection of open source samples that illustrate best practices for\n[Flutter].\n\n## Index\n\n### Quickstarts\n\n* [`asset_transformation`] - Demonstrates how to transform images' color scales and formats. \n* [`background_isolate_channels`] - Demonstrates how to use long-lived isolates.\n* [`code_sharing`] - Demonstrates how to share business logic between Flutter client and Dart server using [`package:shelf`] )\n* [`context_menus`] - This sample shows how to create and customize cross-platform context menus, such as the text selection toolbar on mobile or the right click menu on desktop.\n* [`desktop_photo_search`] - Demonstrates desktop features in both Material and FluentUI design systems.\n* [`dynamic_theme`] - A developer sample demonstrating how to call on-device Flutter APIs based on output from the Gemini API.\n* [`form_app`] - A sample demonstrating different types of forms and best practices.\n* [`game_template`] - (**note: deprecated!**) A starter game in Flutter with all the bells and whistles of a mobile (iOS & Android) game.\n* [`gemini_tasks`] - A developer sample written in Flutter demonstrating how to interact with a to-do list in natural language using the Gemini API.\n* [`google_maps`] - Demonstrates the Google Maps for Flutter plugin.\n* [`infinite_list`] - A Flutter sample app that shows an implementation of the \"infinite list\" UX pattern.\n* [`isolate_example`] - A sample application that demonstrate best practices when using [isolates].\n* [`navigation_and_routing`] - A sample that shows how to use [go_router] API to handle common navigation scenarios.\n* [`place_tracker`] - A sample place tracking app that uses the [google_maps_flutter plugin].\n* [`platform_design`] - This sample project shows a Flutter app that maximizes application code reuse while adhering to different design patterns on Android and iOS.\n* [`provider_counter`] - The starter Flutter application, but using [package:provider] to manage state.\n* [`provider_shopper`] - A Flutter sample app that shows a state management approach using [package:provider].\n* [`simple_shader`] - A simple [Flutter fragment shaders] sample project.\n* [`simplistic_calculator`] - A calculator to demonstrate a simple start for a desktop Flutter app.\n* [`simplistic_editor`] - This sample text editor showcases the use of [TextEditingDeltas] and a DeltaTextInputClient to expand and contract styled ranges of text.\n* [`testing_app`] - A sample app that shows different types of testing in Flutter.\n* [`web_embedding`] - This directory contains examples of how to embed Flutter in web apps (without iframes).\n  * [`element_embedding_demo`] - Modifies the index.html of a flutter app so it is launched in a custom hostElement. This is the most basic embedding example.\n  * [`ng-flutter`] - A simple Angular app (and component) that replicates the above example, but in an Angular style.\n\n### Native platform samples\n\n* [`add-to-app`] - Collection of samples that demonstrate embedding Flutter a view into a native app.\n  * [`fullscreen`] — Embeds a full screen instance of\n  Flutter into an existing iOS or Android app.\n  * [`prebuilt_module`] — Embeds a full screen\n  instance of Flutter as a prebuilt library that can be loaded into an existing\n  iOS or Android app.\n  * [`plugin`] — Embeds a full screen Flutter instance that\n  is using plugins into an existing iOS or Android app.\n  * [`books`] — Mimics a real world use-case of embedding Flutter into an\n  existing Android app and demonstrates using [Pigeon] to communicate between Flutter and\n  the host application.\n  * [`multiple_flutters`] — Shows the usage of the Flutter\n  Engine Group APIs to embed multiple instances of Flutter into an existing app\n  with low memory cost.\n  * [`android_view`] — Shows how to integrate a Flutter\n  add-to-app module at a view level for Android.\n* [`android_splash_screen`]\n* [`ios_app_clip`]\n* [`platform_channels`] - A sample app which demonstrates how to use MethodChannel, EventChannel, BasicMessageChannel and MessageCodec in Flutter.\n* [`platform_view_swift`] - A Flutter sample app that combines a native iOS UIViewController with a full-screen Flutter view.\n\n### Demo galleries\n\n* [`animations`] - Showcases Flutter's animation features\n* [`material_3_demo`] - showcases [Material 3] features in the Flutter Material library.\n\n### Demo apps\n\n* [`compass_app`] - A sample application that implements MVVM architecture.\n* [`deeplink_store_example`] - A demo app that implements deep-linking with go_router.\n* [`veggie_seasons`] - A demo application.\n\n## Flutter sample code\n\nSamples are **correct and concise code** that developers \ncan **quickly understand** and **easily reuse** with minimal side effects. \nSamples teach developers how to be successful using Flutter and Dart. \nThey are maintained on an ongoing basis \nto reflect changing APIs and best practices.\n\n### Types of samples\n\nThere are two types of sample code in this repository:\n\n* **Quickstarts** provide a starting point to extend. They answer the question,\n  \"What is the minimal amount of code needed to implement this feature?\"\n* **Demo apps** are meant to be built and ran. They demo the _product_, \n   not how to write code.\n\nA majority of samples in this repository are quickstarts.\n\n## Usage\n\nEvery sample in this repo is fully runnable. To run an example, \nuse `flutter run` inside that example's directory. \nSee the [getting started guide] to install the `flutter` tool.\n\n> [!IMPORTANT]  \n> If you want to run an add-to-app sample, there are additional requirements.\n> We suggest reading the [add-to-app documentation].\n\n### Tip: minimize download size\n\nAs this repository is quite big, you can use \n[svn] to download a single example.\nFor example:\n\n```\nsvn co https://github.com/flutter/samples/trunk/provider_shopper\n```\n\nYou can also use a [partial clone] to skip blob objects \nthat aren't currently checked out, while including the full commit history:\n\n```\ngit clone --filter=blob:none https://github.com/flutter/samples.git\n```\n\n## Interested in contributing?\n\nSee the [contributor's guide]!\n\n## Questions or issues?\n\nIf you have a general question about one of these samples or how to adapt its\ntechniques for one of your own apps, try one of these resources:\n\n* [The FlutterDev Discord]\n* [The Flutter Community forum]\n\nIf you run into a bug in one of the samples, please file an issue in the\n[`flutter/samples` issue tracker].\n\n\n[`asset_transformation`]: ./asset_transformation\n[`background_isolate_channels`]: ./background_isolate_channels\n[`code_sharing`]: ./code_sharing\n[`context_menus`]: ./context_menus\n[`desktop_photo_search`]: ./desktop_photo_search\n[`dynamic_theme`]: ./dynamic_theme\n[`form_app`]: ./form_app\n[`game_template`]: ./game_template\n[`gemini_tasks`]: ./gemini_tasks\n[`google_maps`]: ./google_maps\n[`infinite_list`]: ./infinite_list\n[`isolate_example`]: ./isolate_example\n[`navigation_and_routing`]: ./navigation_and_routing\n[`place_tracker`]: ./place_tracker\n[`platform_design`]: ./platform_design\n[`provider_counter`]: ./provider_counter\n[`provider_shopper`]: ./provider_shopper\n[`simple_shader`]: ./simple_shader\n[`simplistic_calculator`]: ./simplistic_calculator\n[`simplistic_editor`]: ./simplistic_editor\n[`testing_app`]: ./testing_app\n[`web_embedding`]: ./web_embedding\n[`element_embedding_demo`]: ./web_embedding/element_embedding_demo\n[`ng-flutter`]: ./web_embedding/ng-flutter\n[`add-to-app`]: ./add_to_app\n[`fullscreen`]: ./add_to_app/fullscreen\n[`prebuilt_module`]: ./add_to_app/prebuilt_module\n[`plugin`]: ./add_to_app/plugin\n[`books`]: ./add_to_app/books\n[`multiple_flutters`]: ./add_to_app/multiple_flutters\n[`android_view`]: ./add_to_app/android_view\n[`android_splash_screen`]: ./android_splash_screen\n[`ios_app_clip`]: ./ios_app_clip\n[`platform_channels`]: ./platform_channels\n[`platform_view_swift`]: ./platform_view_swift\n[`animations`]: ./animations\n[`material_3_demo`]: ./material_3_demo\n[`compass_app`]: ./compass_app\n[`deeplink_store_example`]: ./deeplink_store_example\n[`veggie_seasons`]: ./veggieseasons\n\n[Flutter]: https://flutter.dev\n[getting started guide]: https://docs.flutter.dev/get-started/install\n[add-to-app documentation]: https://docs.flutter.dev/add-to-app\n[isolates]: https://api.dart.dev/dart-isolate/Isolate-class.html\n[Material 3]: https://m3.material.io\n[go_router]: https://pub.dev/packages/go_router\n[google_maps_flutter plugin]: https://github.com/flutter/plugins/tree/master/packages/google_maps_flutter\n[package:provider]: https://pub.dev/packages/provider\n[Flutter fragment shaders]: https://docs.flutter.dev/development/ui/advanced/shaders\n[TextEditingDeltas]: https://api.flutter.dev/flutter/services/TextEditingDelta-class.html\n[Pigeon]: https://pub.dev/packages/pigeon\n[`package:shelf`]: https://pub.dev/packages/shelf\n[svn]: https://subversion.apache.org/\n[partial clone]: https://github.blog/2020-12-21-get-up-to-speed-with-partial-clone-and-shallow-clone/\n[contributor's guide]: CONTRIBUTING.md\n[The FlutterDev Discord]: https://discord.gg/rflutterdev\n[The Flutter Community forum]: https://forum.itsallwidgets.com/latest\n[`flutter/samples` issue tracker]: https://github.com/flutter/samples/issues\n"
        },
        {
          "name": "add_to_app",
          "type": "tree",
          "content": null
        },
        {
          "name": "ai_recipe_generation",
          "type": "tree",
          "content": null
        },
        {
          "name": "analysis_defaults",
          "type": "tree",
          "content": null
        },
        {
          "name": "android_splash_screen",
          "type": "tree",
          "content": null
        },
        {
          "name": "animations",
          "type": "tree",
          "content": null
        },
        {
          "name": "asset_transformation",
          "type": "tree",
          "content": null
        },
        {
          "name": "background_isolate_channels",
          "type": "tree",
          "content": null
        },
        {
          "name": "code_sharing",
          "type": "tree",
          "content": null
        },
        {
          "name": "compass_app",
          "type": "tree",
          "content": null
        },
        {
          "name": "context_menus",
          "type": "tree",
          "content": null
        },
        {
          "name": "deeplink_store_example",
          "type": "tree",
          "content": null
        },
        {
          "name": "desktop_photo_search",
          "type": "tree",
          "content": null
        },
        {
          "name": "dynamic_theme",
          "type": "tree",
          "content": null
        },
        {
          "name": "experimental",
          "type": "tree",
          "content": null
        },
        {
          "name": "flutter_maps_firestore",
          "type": "tree",
          "content": null
        },
        {
          "name": "form_app",
          "type": "tree",
          "content": null
        },
        {
          "name": "game_template",
          "type": "tree",
          "content": null
        },
        {
          "name": "gemini_tasks",
          "type": "tree",
          "content": null
        },
        {
          "name": "google_maps",
          "type": "tree",
          "content": null
        },
        {
          "name": "infinite_list",
          "type": "tree",
          "content": null
        },
        {
          "name": "ios_app_clip",
          "type": "tree",
          "content": null
        },
        {
          "name": "isolate_example",
          "type": "tree",
          "content": null
        },
        {
          "name": "jsonexample",
          "type": "tree",
          "content": null
        },
        {
          "name": "material_3_demo",
          "type": "tree",
          "content": null
        },
        {
          "name": "navigation_and_routing",
          "type": "tree",
          "content": null
        },
        {
          "name": "place_tracker",
          "type": "tree",
          "content": null
        },
        {
          "name": "platform_channels",
          "type": "tree",
          "content": null
        },
        {
          "name": "platform_design",
          "type": "tree",
          "content": null
        },
        {
          "name": "platform_view_swift",
          "type": "tree",
          "content": null
        },
        {
          "name": "provider_counter",
          "type": "tree",
          "content": null
        },
        {
          "name": "provider_shopper",
          "type": "tree",
          "content": null
        },
        {
          "name": "simple_shader",
          "type": "tree",
          "content": null
        },
        {
          "name": "simplistic_calculator",
          "type": "tree",
          "content": null
        },
        {
          "name": "simplistic_editor",
          "type": "tree",
          "content": null
        },
        {
          "name": "testing_app",
          "type": "tree",
          "content": null
        },
        {
          "name": "tool",
          "type": "tree",
          "content": null
        },
        {
          "name": "veggieseasons",
          "type": "tree",
          "content": null
        },
        {
          "name": "web",
          "type": "tree",
          "content": null
        },
        {
          "name": "web_embedding",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}